{
  "id": "bleeping-computer-2025-11-07-06419995",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-confirms-google-gemini-3-pro-and-nano-banana-2-could-launch-soon/",
  "title": "Leak confirms Google Gemini 3 Pro and Nano Banana 2 could launch soon",
  "url": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-confirms-google-gemini-3-pro-and-nano-banana-2-could-launch-soon/",
  "published_at": "2025-11-07T13:06:11+00:00",
  "fetched_at": "2025-11-08T11:10:38.236250+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Google is planning to ship two new models. One is Gemini 3, which is optimised for coding and regular use, and the second is Nano Banano 2 for generating realistic images. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Google is planning to ship two new models. One is Gemini 3, which is optimised for coding and regular use, and the second is Nano Banano 2 for generating realistic images.\nAs spotted on X, Gemini-3-pro was first spotted on Vertex AI, which is a Google-hosted cloud platform for using AI agents and building apps or products using AI.\nThis model is called \"gemini-3-pro-preview-11-2025,\" which aligns with previous reports that Google plans to ship Gemini 3 in November.\nWhile there have been some wild reports on X that claim people have access to Gemini 3, we don't think that's the case.\nGoogle typically tests its AI models secretly. While Google may have shared access with certain business partners, they cannot share the results on a public platform due to an NDA (non disclosure agreement).\nEarly leaks suggest that Gemini 3 will begin rolling out in November with a 1 million context limit.\nAt the moment, Google's latest AI model is Gemini 2.5 Pro, and it's about 8 months old, but it still remains one of the best models in the market.\nFor example, on SWE-Bench Verified, the industry standard for agentic code evals, Gemini 2.5 Pro scores 63.8% with a custom agent setup. On the other hand, Claude Sonnet 4.5 scores about 77%.\nNano Banana 2\nIn addition to Gemini 3, Google is testing Nano Banana 2, codenamed \"GEMPIX2,\" and it was recently spotted on the Gemini website.\nThis could mean that the model, which could be one of the best for generating AI images, will begin shipping as early as December 2025.\nGoogle is not the only company planning to ship new models before the end of the year.\nOpenAI is also working on GPT 5.1 and new models for Codex, which is the company's agentic coding terminal.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
      "enhanced_at": 1762600546.7184148,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:15:46.718747+00:00Z"
}