{
  "id": "bleeping-computer-2025-11-07-ab6c890d",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/microsoft/microsoft-testing-faster-quick-machine-recovery-in-windows-11/",
  "title": "Microsoft testing faster Quick Machine Recovery in Windows 11",
  "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-testing-faster-quick-machine-recovery-in-windows-11/",
  "published_at": "2025-11-07T19:46:32+00:00",
  "fetched_at": "2025-11-08T11:10:38.234798+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Microsoft is testing a faster version of Quick Machine Recovery (QMR) and updated Smart App Control (SAC), allowing users to toggle it without requiring a Windows clean install. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Microsoft is testing a faster version of Quick Machine Recovery (QMR) and updated Smart App Control (SAC), allowing users to toggle it without requiring a Windows clean install.\nQMR enables IT administrators to resolve Windows boot failures remotely, eliminating the need for physical access to the system.\nIf Windows 11 fails to start due to a configuration change or a new driver, it boots into the Windows Recovery Environment (WinRE), launches the Quick Machine Recovery Tool, and connects to the internet to send crash data to Microsoft, allowing the admins to remove the problematic updates and adjust the settings to fix the boot issues.\nThe main change announced on Friday is that the recovery task now runs a single scan to fix systems experiencing booting problems, rather than searching for solutions in a loop.\nAs the Windows Insider team explained today, the \"Quick machine recovery\" and \"Automatically check for solutions\" options are now enabled in the System Recovery settings to run a one-time QMR scan by default.\n\"On PCs with the settings' quick machine recovery' and 'automatically check for solutions' both enabled, QMR now runs a one‑time scan by default instead of repeating scans in a loop,\" the Windows Insider team said.\n\"If a fix isn't available right away, you won't be left waiting; QMR will quickly point you to the most appropriate recovery options to get you back up and running.\"\nQuick Machine Recovery was introduced in November 2024 as part of Microsoft's Windows Resiliency Initiative at Ignite 2024, in response to a massive July 2024 outage caused by a buggy CrowdStrike Falcon update that took down hundreds of thousands of Windows devices worldwide, rendering them unbootable.\nMicrosoft began testing quick machine recovery in late March, when it started rolling it out to Windows Insiders in the Beta Channel.\nToday, the company also announced that Smart App Control, a Windows 11 security feature designed to block untrusted or potentially harmful apps at the process level, can now be toggled on and off from Windows Security > App & Browser Control > Smart App Control settings without requiring a Windows clean install.\nThese changes are rolling out to Windows Insiders in the Dev and Beta channels who have installed the Windows 11 Insider Preview Build 26220.7070 (KB5070300).\nLast month, Microsoft also released a preview update to the Dev and Beta channels, testing a new feature that recommends running a memory scan when logging in after a Blue Screen of Death (BSOD) to improve system reliability.\nSecrets Security Cheat Sheet: From Sprawl to Control\nWhether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start.\nGet the cheat sheet and take the guesswork out of secrets management.",
      "enhanced_at": 1762600494.9424908,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:14:54.942860+00:00Z"
}