{
  "id": "bleeping-computer-2025-11-07-8b45cb9b",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/qnap-fixes-seven-nas-zero-day-vulnerabilities-exploited-at-pwn2own/",
  "title": "QNAP fixes seven NAS zero-day flaws exploited at Pwn2Own",
  "url": "https://www.bleepingcomputer.com/news/security/qnap-fixes-seven-nas-zero-day-vulnerabilities-exploited-at-pwn2own/",
  "published_at": "2025-11-07T18:24:43+00:00",
  "fetched_at": "2025-11-08T11:10:38.235138+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "QNAP has fixed seven zero-day vulnerabilities that security researchers exploited to hack QNAP network-attached storage (NAS) devices during the Pwn2Own Ireland 2025 competition. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "QNAP has fixed seven zero-day vulnerabilities that security researchers exploited to hack QNAP network-attached storage (NAS) devices during the Pwn2Own Ireland 2025 competition.\nThe flaws impact QNAP's QTS and QuTS hero operating systems (CVE-2025-62847, CVE-2025-62848, CVE-2025-62849) and the company's Hyper Data Protector (CVE-2025-59389), Malware Remover (CVE-2025-11837), and HBS 3 Hybrid Backup Sync (CVE-2025-62840, CVE-2025-62842) software.\nQNAP said in advisories published on Friday that the security bugs were demonstrated at Pwn2Own by the Summoning Team, DEVCORE, Team DDOS, and a CyCraft technology intern.\nTo patch these security flaws, QNAP recommends updating software to the latest version and changing all passwords for increased security.\nQNAP has fixed all these vulnerabilities in the following software versions:\n- Hyper Data Protector 2.2.4.1 and later\n- Malware Remover 6.6.8.20251023 and later\n- HBS 3 Hybrid Backup Sync 26.2.0.938 and later\n- QTS 5.2.7.3297 build 20251024 and later\n- QuTS hero h5.2.7.3297 build 20251024 and later\n- QuTS hero h5.3.1.3292 build 20251024 and later\nUsers who want to update their OS to log in to QTS or QuTS Hero as an administrator should go to Control Panel > System > Firmware Update and click \"Check for Update\" under Live Update.\nTo update the vulnerable apps, first log in to QTS or QuTS hero as an admin, then open the App Center and click the search button. Type the name of the app you want to update and press ENTER. In the search results, click \"Update,\" and then confirm the action by clicking \"OK\" on the confirmation message that appears.\n\"To secure your device, we recommend regularly updating your system to the latest version to benefit from vulnerability fixes. You can check the product support status to see the latest updates available to your NAS model,\" QNAP said.\nOne year ago, the NAS maker patched two other zero-days exploited during the Pwn2Own Ireland 2024 contest: an OS command injection weakness (CVE-2024-50388) in the Hybrid Backup Sync disaster recovery and data backup solution, and an SQL injection (SQLi) vulnerability (CVE-2024-50387) in QNAP's SMB Service.\nToday, QNAP also released QuMagie 2.7.0 with patches for a critical SQLi vulnerability (CVE-2025-52425) in its photo management and sharing solution that can allow remote attackers to execute unauthorized code or commands on vulnerable devices.\nSecrets Security Cheat Sheet: From Sprawl to Control\nWhether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start.\nGet the cheat sheet and take the guesswork out of secrets management.",
      "enhanced_at": 1762600501.6062,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:15:01.606533+00:00Z"
}