{
  "id": "bleeping-computer-2025-11-07-163bcfb1",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/malicious-nuget-packages-drop-disruptive-time-bombs/",
  "title": "Malicious NuGet packages drop disruptive 'time bombs'",
  "url": "https://www.bleepingcomputer.com/news/security/malicious-nuget-packages-drop-disruptive-time-bombs/",
  "published_at": "2025-11-07T20:53:48+00:00",
  "fetched_at": "2025-11-08T11:10:38.234435+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Several malicious packages on NuGet have sabotage payloads scheduled to activate in 2027 and 2028, targeting database implementations and Siemens S7 industrial control devices. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Several malicious packages on NuGet have sabotage payloads scheduled to activate in 2027 and 2028, targeting database implementations and Siemens S7 industrial control devices.\nThe embedded malicious code uses a probabilistic trigger, so it may or may not activate depending on a set of parameters on the infected device.\nNuGet is an open-source package manager and software distribution system, enabling developers to download and include ready-to-run .NET libraries for their projects.\nResearchers at code security company Socket found nine malicious packages on NuGet, all published under the developer name shanhai666, that featured legitimate functionality along with the harmful code.\nThe packages \"strategically target all three major database providers used in .NET applications (SQL Server, PostgreSQL, SQLite).\" However, the most dangerous of them is Sharp7Extend, which targets users of the legitimate Sharp7 library for communicating over ethernet with Siemens programmable logic controllers (PLCs).\n\"By appending \"Extend\" to the trusted Sharp7 name, the threat actor exploits developers searching for Sharp7 extensions or enhancements,\" Socket researchers said.\nUnder the shanhai666 developer name, NuGet listed 12 packages, but only nine of them included malicious code:\n- SqlUnicorn.Core\n- SqlDbRepository\n- SqlLiteRepository\n- SqlUnicornCoreTest\n- SqlUnicornCore\n- SqlRepository\n- MyDbRepository\n- MCDbRepository\n- Sharp7Extend\nAt publishing time, there are no packages listed under that developer's name. But it should be noted that the delisting occurred after the download count almost reached 9,500.\nSneaking a “bomb” for 2028\nAccording to Socket researchers, the packages contain mostly (99%) legitimate code, creating a false sense of safety and trust, but include a small 20-line malicious payload.\n\"The malware exploits C# extension methods to transparently inject malicious logic into every database and PLC operation,\" Socket explains in a report this week.\nThe extension methods execute every time an application performs a database query or a PLC operation. There is also a verification for the current date on the compromised system against a hardcoded trigger date, which ranges from August 8, 2027, to November 29, 2028.\nIf the date condition is a match, the code creates a ‘Random’ class to generate a number between 1 and 100, and if it’s higher than 80 (20% chance), calls ‘Process.GetCurrentProcess().Kill()’ for the immediate termination of the host process.\nFor typical PLC clients that call transactional or connection methods frequently, this would lead to an immediate stop of operations.\nThe Sharp7Extend package, which impersonates the legitimate Sharp7 library, a popular .NET communication layer for Siemens S7 PLCs, follows the opposite approach, immediately terminating PLC communications in 20% of cases. This mechanism is set to expire on June 6, 2028.\nA second sabotage method in the Sharp7Extend package consists in code trying to read from an inexistent configuration value. As a result, the initialization always fails.\nA second mechanism creates a filter value for internal PLC operations and sets a payload execution delay between 30 and 90 minutes.\nAfter that time has elapsed, PLC writes that pass through the filter have an 80% chance to get corrupted, resulting in actuators not receiving commands, setpoints not being updated, safety systems not engaging, and production parameters not being modified.\n\"The combination of immediate random process termination (via BeginTran()) and delayed write corruption (via ResFliter) creates a sophisticated multi-layered attack that evolves over time,\" Socket researchers say.\nWhile the exact goals and origins of these extensions remain unclear, organizations potentially impacted are recommended to immediately audit their assets for the nine packages and assume compromise if any are present.\nFor industrial environments running Sharp7Extend, audit PLC write operations for integrity, check safety system logs for missed commands or failed activations, and implement write-verification for critical operations.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
      "enhanced_at": 1762600479.930436,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:14:39.930751+00:00Z"
}