{
  "id": "gbhackers-security-1-globally-trusted-cyber-security-news-platform-gbhackers-com-2025-11-07-20555ec5",
  "source_id": "gbhackers-security-1-globally-trusted-cyber-security-news-platform-gbhackers-com",
  "guid": "https://gbhackers.com/?p=168427",
  "title": "New Analysis Reveals LockBit 5.0’s Core Features and Dual-Stage Attack Model",
  "url": "https://gbhackers.com/lockbit-5-0s-core-features/",
  "published_at": "2025-11-07T11:55:51+00:00",
  "fetched_at": "2025-11-08T11:13:20.797800+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "LockBit has remained one of the most dominant ransomware-as-a-service (RaaS) groups in the world since its emergence as ABCD ransomware in 2019 and official launch as LockBit in 2020. Despite high-profile setbacks including international law enforcement takedowns in early 2024 and a damaging affiliate panel leak in May 2025 the group continues to update its [&#8230;] The post New Analysis Reveals LockBit 5.0’s Core Features and Dual-Stage Attack Model appeared first on GBHackers Security | #1 Globally Trusted Cyber Security News Platform.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "LockBit has remained one of the most dominant ransomware-as-a-service (RaaS) groups in the world since its emergence as ABCD ransomware in 2019 and official launch as LockBit in 2020.\nDespite high-profile setbacks including international law enforcement takedowns in early 2024 and a damaging affiliate panel leak in May 2025 the group continues to update its codebase, expand affiliate operations, and launch large-scale attacks targeting organizations across industries.\nFlashpoint has tracked LockBit through numerous evolutions, from the early .abcd encryptors to the faster and stealthier LockBit 3.0 and the Conti-inspired LockBit Green.\nNow, with version 5.0, the group has introduced a refined two-stage ransomware deployment model that aims to maximize evasion, modularity, and destructive impact.\nThis analysis outlines how LockBit 5.0 works, what’s changed, and why defenders should treat this latest evolution as a clear signal that even after takedowns and leaks, ransomware groups are innovating faster, not backing off.\nTrend Micro first flagged the emergence of LockBit 5.0 in late September 2025. Flashpoint’s analysis confirms that the group is building on the existing v4.0 codebase rather than starting from scratch.\nMany core functions remain, including familiar file encryption methods, geographic execution limits, and even a recycled ransom note that still misspells “information”.\nHowever, LockBit 5.0 introduces several new or upgraded capabilities. A modular two-stage architecture separates the loader from the primary payload, and expanded anti-analysis features include control-flow obfuscation and API hashing.\nThe malware employs aggressive EDR bypass using process hollowing, unhooked libraries, and ETW patching. It also supports stealth execution modes that omit file extensions and ransom notes.\nThese updates demonstrate that LockBit’s developers are focused on staying operational under pressure, iterating on technical defenses while retaining the group’s familiar tooling and affiliate model.\nThe Two-Stage Execution Model\nAt the heart of LockBit 5.0 is its new two-stage execution model. Stage one acts as a loader built for stealth and survivability, while stage two executes the core ransomware payload, designed for flexible deployment, targeted destruction, and layered evasion.\nStage One: The Stealthy Loader and EDR Evasion\nKey features of the loader at stage one include control flow obfuscation, where the code calculates jump destinations dynamically, making traditional disassembly and reverse engineering more difficult.\nDynamic API resolution means the malware avoids hardcoded API names and instead resolves function calls at runtime using a custom hashing algorithm.\nLibrary unhooking is employed to reload clean copies of NTDLL and Kernel32 from disk, overwriting any hooks placed by security tools in memory.\nThe loader constructs custom shellcode trampolines that redirect execution to resolved API calls, bypassing standard detection methods.\nThe loader then creates a suspended instance of defrag.exe and injects the decrypted payload using process hollowing.\nFlashpoint analysts confirmed that the stage two payload is written into memory using ZwWriteProcessMemory, the instruction pointer is updated, and the process resumes execution all without triggering default security alerts.\nStage Two: The Destructive Ransomware Payload\nStage two is the main ransomware payload. Flashpoint observed this binary labeled “ChuongDoung Locker v1.01,” a likely nod to researcher Chuong Dong. It contains both familiar LockBit features and new destructive options.\nThe payload supports various command-line switches and can run with or without a visible impact. In “destruction-only” mode, it encrypts files silently without changing extensions or displaying a ransom note, a tactic that may be used for retaliatory or purely disruptive campaigns.\nAdditional behaviors include encryption of local drives, specific directories, and network shares, as well as multi-threaded encryption using Curve25519 keys and XChaCha20 cipher.\nRepeated library unhooking occurs for every DLL loaded, while system services such as VSS, WSearch, and Edgeupdate are disabled.\nFile and directory exclusions preserve OS functionality and evade detection. The ransom note text is decrypted using RC4 and written as ReadMeForDecrypt.txt.\nBefore executing, the payload checks the victim machine to ensure it is not in Russia or Russia-allied locations, and curiously, avoids execution on systems located in the Philippines a behavior Flashpoint continues to investigate.\nImplications for Defenders\nLockBit 5.0 reflects a broader shift in ransomware development: professionalization under pressure. Despite sanctions, leaks, and arrests, the group continues to operate at scale.\nSecurity teams should monitor illicit forums and breach sites for early warning signals, correlate vulnerability intelligence with ransomware group preferences to prioritize patching, use behavioral detection to flag evasive actions like ETW patching or library unhooking, and prepare tailored response playbooks with negotiation protocols, offline backups, and legal guidance pre-staged before an attack occurs.\nThe release follows the May 2025 leak of internal LockBit data, which exposed affiliate accounts, ransomware builds, and ransom negotiations between victims and affiliates.\nFor defenders, this reinforces the importance of tracking ransomware groups not only by indicators of compromise but also by their tooling, tactics, techniques, and procedures.\nLockBit 5.0 is the latest proof that ransomware isn’t going away it’s adapting. The best way to stay ahead is by fusing primary source intelligence, behavioral analysis, and coordinated readiness.\nFollow us on Google News, LinkedIn, and X to Get Instant Updates and Set GBH as a Preferred Source in Google.",
      "enhanced_at": 1762600563.3222632,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:16:03.322566+00:00Z"
}