{
  "id": "latest-news-zdnet-com-2025-11-07-0dbe5ba6",
  "source_id": "latest-news-zdnet-com",
  "guid": "670ef322-c4a5-4155-a8c1-9f55d57da4a6",
  "title": "Upgrade your study game with NotebookLM - here's how",
  "url": "https://www.zdnet.com/article/upgrade-your-study-game-with-notebooklm-heres-how/",
  "published_at": "2025-11-07T17:16:00+00:00",
  "fetched_at": "2025-11-08T11:14:23.797651+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Finals are approaching - let NotebookLM's new flash card and quiz upgrades help.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Upgrade your study game with NotebookLM - here's how\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeways\n- Google NotebookLM has flashcard and quiz features now.\n- It also got customization and memory upgrades.\n- Everyone can access the improvements.\nGoogle's NotebookLM is one of our favorite AI tools for productivity, and it just got several upgrades just in time for finals season. Users can now create flashcards and quizzes with the NotebookLM app, which also now has a four-fold larger context window and six-fold longer conversation memory.\nAlso: I used NotebookLM for an entire month - here's why it really is a game changer\nHow it works\nAccording to Google, the most significant update to NotebookLM this week is the addition of flashcards and quizzes to further your learning on the go. Google says the new feature can help users memorize key terms, dates, and concepts by pulling from their uploaded sources.\nAlso: You can now give NotebookLM more instructions - here's why that's a game changer\nUsers can use flashcards to test their knowledge and challenge themselves with quizzes, as well as customize topics, difficulty, and the number of cards within the flashcard deck. They can temporarily add or remove sources within NotebookLM while using the chat or Studio tabs, ensuring responses are based on relevant sources.\nNotebookLM's chat improvements allow users to customize chat to achieve a specific goal or adopt a unique voice or role. For example, users can direct chat to act as a scrutinizing professor or analyze their provided sources from multiple perspectives.\nStill, AI tools often hallucinate; especially when using them for schoolwork, be sure to verify any claims or examples NotebookLM and similar products make before incorporating them further into an assignment or study prep.\nTry it for yourself\nUsers can access NotebookLM's upgrades in the app for iOS and Android. To find the new features, you'll need to update your app to the latest version. NotebookLM's free tier allows for 10 sets of flashcards daily.",
      "enhanced_at": 1762600525.2494378,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:15:25.249773+00:00Z"
}