{
  "id": "latest-news-zdnet-com-2025-11-07-90140b06",
  "source_id": "latest-news-zdnet-com",
  "guid": "61894687-d421-44de-851e-b319ac248614",
  "title": "Shop the best early Costco deals for Black Friday 2025",
  "url": "https://www.zdnet.com/article/best-early-black-friday-costco-deals-2025/",
  "published_at": "2025-11-07T17:52:47+00:00",
  "fetched_at": "2025-11-08T11:14:23.796291+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Black Friday is less than a month away, and Costco already has some great early holiday deals live now on TVs, tablets, and more.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest early Black Friday Costco deals 2025: I'm tracking my favorite discounts live now\nBlack Friday is just three weeks away, but Costco has already sent out its holiday deals mailer, and several early Black Friday sales have hit stores and its website this week.\nAlso: The best Black Friday deals live now\nCostco is a membership-based wholesale retailer. Non-members can shop with a guest account online, but only members can access the full savings for the store's sales events (non-members can expect a 5% markup on purchases, and some deals are members-only). Memberships start at $65 a year (and you can sometimes find membership deals through third-party sites).\nI'm a commerce editor, and personally, a Costco Executive Member and frequent Costco shopper. These are my favorite early Black Friday Costco deals you can shop now.\nBest early Black Friday Costco deals\n- Current price: $699\n- Original price: $779\nCostco was the first retailer to discount the new Apple Watch Ultra 3, which was just released this fall. ZDNET smartwatch reviewer Nina Raemont called it \"Apple's most durable and longest-lasting wearable yet,\" with a 42-hour battery life, emergency SOS, location sharing, and messaging through Satellite, and an FDA-cleared Hypertension Detection feature.\nReview: I've tested every Apple Watch model in 2025 - here's why now is the best time to buy the Ultra\n- Current price: $749\n- Original price: $949\nThe latest MacBook Air just hit its lowest price ever, at $200 off. It's our pick for the best MacBook you can buy right now, thanks to its lightweight build and powerful M4 chip.\n- Current price: $299\n- Original price: $329\nOur pick for the best iPad you can buy, the 11th-generation iPad features an A16 Bionic chip, 6GB of RAM, USB-C charging, 5G support, 4K video capture, Wi-Fi 6, and 128GB of base storage.\n- Current price: $429\n- Original price: $499\nOur tablet review Maria Diaz recommends the Samsung S10 FE tablets over pricier models, thanks to their reliable performance and large screens.\n- Current price: $1,399\n- Original price: $2,697\nOne of the best OLED TVs we've tested gets a big discount at Costco this week.\n- Current price: $1,699\n- Original price: $2,600\nIf you've been looking to upgrade to a cinematic 100-inch TV and are on a budget, this Hisense model is a great choice. We've tested several Hisense TVs, and they've become a trusted option.\n- Current price: $449\n- Original price: $699\nThe Acer Aspire 14 is one of the most battery-efficient laptops we've tested this year with some of the latest hardware, for an excellent price -- especially on sale like this.\n- Current price: $849\n- Original price: $1,149\nZDNET laptop reviewer Cesar Cadenas said the HP Omnibook \"may be the best alternative to the MacBook Air, thanks to its absurdly-long battery life, lightweight design, and solid performance.\"\nReview: I found the ultimate MacBook Air alternative for Windows users - and it's priced well\n- Current price: $1,299\n- Original price: $1,899\nJackery portable power stations are always among our tested best portable power station picks. The Jackery Explorer 3000 v2 can power your refridgerator for up to 2 days during an outage, and comes with solar panels for recharging.\nMore early Black Friday Costco deals\n- iPad Pro (M4) 11-inch: $1,499 (save $50): Last year's iPad Pro model is still incredibly fast and thin, and gets a discount ahead of Black Friday.\n- TCL 65-inch Q77K Series 4K UHD QLED Smart TV: $379: This affordable TCL TV includes a high-contrast HVA panel, a 144Hz native refresh rate, and a backlit voice remote.\n- Sony WH1000XM5 Wireless Noise-Cancelling Over-the-Ear Headphones: $279 (save $70): These stylish and popular Sony headphones may be a generation behind, but we still highly recommend them.\n- Nespresso Vertuo Next Deluxe with Aeroccino 3 and 32 Capsules: $179: This members-only Nespresso Vertuo Next Deluxe bundle comes with a milk frother, 32 coffee capsules, and a $20 voucher to Nespresso.com for more.\n- Dell Inspiron 15.6-inch Touchscreen Laptop: $399 (save $200): This affordable Dell laptop includes a 2-year warranty.\nFAQs\nWhen is Black Friday?\nThis year, Black Friday falls on Friday, Nov. 28, 2025, the day after Thanksgiving. Cyber Monday follows soon after, on Monday, Dec. 1, 2025.\nDoes Costco have a Black Friday sale?\nYes. According to the latest mailer, Costco's first holiday savings event runs Oct. 31-Nov. 16, both in-warehouse and online. The second (and main Black Friday event) will run from Nov. 17-Dec. 1. Costco will also run Cyber Monday deals online on Dec. 1.\nAre tech products really cheaper during Black Friday?\nYes -- we often see some of the lowest prices of the year on a variety of tech products during Black Friday sales, including TVs, laptops, headphones, and more.\nHow did we choose these early Black Friday deals?\nZDNET only writes about deals we want to buy -- devices and products we desire, need, or would recommend. Our experts looked for deals that were at least 20% off (or are hardly ever on sale), using established price comparison tools and trackers to determine whether the deal is actually on sale and how frequently it drops.\nWe also looked over customer reviews to find out what matters to real people who already own and use the deals we're recommending. Our recommendations may also be based on our own testing -- in addition to extensive research and comparison shopping. The goal is to deliver the most accurate advice to help you shop smarter.",
      "enhanced_at": 1762600514.668632,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:15:14.668987+00:00Z"
}