{
  "id": "latest-news-zdnet-com-2025-11-07-17adc8d4",
  "source_id": "latest-news-zdnet-com",
  "guid": "07aafbce-468c-4a6a-86e2-fa6ee5803eec",
  "title": "Samsung showed me its secret HDR10+ Advanced TV samples - and I'm nearly sold",
  "url": "https://www.zdnet.com/article/samsung-showed-me-its-secret-hdr10-advanced-tv-samples-and-im-nearly-sold/",
  "published_at": "2025-11-07T19:31:00+00:00",
  "fetched_at": "2025-11-08T11:14:23.794974+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The upcoming open-source standard goes toe-to-toe with Dolby Vision 2, and you'll likely see more of it in a matter of months.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nSamsung showed me its secret HDR10+ Advanced TV samples - and I'm nearly sold\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Samsung just launched HDR10+ Advanced to optimize older content for newer TVs.\n- New features include brightness boosting, adaptive motion smoothing, and better gaming performance.\n- The simulated demo is a teaser for what's to come in 2026.\nThere were two 115-inch Samsung Micro RGB TVs set in front of me, one broadcasting in the HDR10+ format that our eyes have grown accustomed to since 2017, and the other simulating the upcoming HDR10+ Advanced standard. The difference, as the time gap should suggest, was almost immediately noticeable.\nAhead of CES 2026, Samsung showcased HDR10+ Advanced, the next generation of the open-source HDR10+ standard, which optimizes digital content for both the latest super-bright TVs and those yet to come. The company invited me to its Suwon campus in South Korea to see the technical upgrades up close, and I left the demo feeling excited for next year's crop of TVs.\nAlso: Dolby Vision 2 has arrived, but you don't have to replace your TV for a new one yet\nParticularly, upcoming Mini-LED and Micro RGB models -- that typically output more than 1,000 nits, brighter than most mastered films -- should be able to truly embrace the new HDR standard. And while it's easy to compare HDR10+ Advanced to Dolby Vision 2, announced only months ago at IFA Berlin, there are several features that set the former apart. Here's the breakdown.\n1. It's all about accuracy\nThe simulations demonstrated how the new HDR standard leverages brighter, more color-accurate TVs by effectively reproducing the wider dynamic range and color volume intended by the content creator. Samsung calls this HDR10+ Bright.\nThis is achieved by feeding the TVs with scene-by-scene dynamic metadata that guides the display's processing to optimize brightness and color, resulting in a more impactful viewing experience.\nAlso: I tested the Samsung S95F OLED for a week, and it spoiled the way I watch TV\nTo further assist with local dimming, particularly on more capable RGB Micro LED models (by Samsung) and RGB Mini-LED models (by Sony, TCL, and Hisense) that can sometimes experience unwanted light blooming, a new Local Tone Mapping feature allows the TV to analyze the image more precisely, granting far better control over the local dimming zones of a mini-LED backlight.\nFrom the demo videos I saw, subjects that would otherwise lose detail in darker scenes -- like the buttons and toggles in the cars' center consoles above -- instead appeared more vivid with higher contrast. Textures and hair detail were also more distinguishable on the HDR10+ Advanced sample.\nLastly, creators can now submit their color grading data directly to TV manufacturers, ensuring their mastering intent is accurately reflected on the consumer's screen. If this system works reliably, it represents a significant victory for directors and colorists.\n2. Gamer's paradise\nThere are some notable benefits that HDR10+ Advanced brings to gamers and entertainment buffs. For one, HDR10+ Intelligent Gaming enables the TV to adjust the tone mapping of supported cloud gaming services based on your ambient lighting. It's a big win if you've ever found yourself squinting for details in titles like Dark Souls and Batman: Arkham Knight, as general visibility should see an improvement.\nSimilarly, HDR10+ Genre detects the genre of what you're watching -- whether that be a moody drama or live sports -- and adjusts the picture settings for optimal viewing.\nAlso: You should turn off ACR on your TV right now (and why it matters so much to privacy)\nMotion smoothing is a fairly controversial topic amongst ZDNET's TV experts, but features like HDR10+ Intelligent FRC, which behaves similarly to Dolby Vision 2's Authentic Motion, feel like a step in the right direction. Instead of forcing constant motion smoothing, creators can suggest adding frames on a scene-to-scene basis.\nFrom what I saw, the selective motion smoothing is best appreciated during panning shots, which typically have a juddering effect as TVs mismatch the content's recorded frame rate. The switch-up wasn't jarring to the eye, and I expect the tech to improve at adapting to scenes over time.\n3. Who's in (for now)\nWhile the HDR10+ Advanced demos I saw were simulated, they offered a compelling vision for how modern content consumption will change. Crucially, this advanced technology provides a practical way for consumers to maximize their high-end TV investments, specifically by leveraging the display's powerful processing and granular local dimming capabilities.\nAlso: Best early Black Friday TV deals 2025: Save on Samsung, TCL, and more\nThe big question now is the coming format war: how will HDR10+ Advanced compare to Dolby Vision 2? This matchup is likely to dominate discussions at future trade shows, particularly at CES.\nWhat's certain is the early momentum: Samsung has already secured buy-in from streaming giant Amazon Prime Video, and widespread adoption by other major content studios will be the definitive measure of success.\nDisclosure: The cost of Kerry Wan's travel to South Korea was covered by Samsung, a common industry practice for long-distance trips. The judgments and opinions of ZDNET's writers and editors are always independent of the companies we cover.",
      "enhanced_at": 1762600497.6211438,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:14:57.621482+00:00Z"
}