{
  "id": "latest-news-zdnet-com-2025-11-07-97efd713",
  "source_id": "latest-news-zdnet-com",
  "guid": "30c6ea7e-0c7d-4e42-9e81-73e92607a99b",
  "title": "Best early Black Friday phone deals 2025: I'm tracking the 10 best deals right now",
  "url": "https://www.zdnet.com/article/best-early-black-friday-phone-deals-2025/",
  "published_at": "2025-11-07T17:45:04+00:00",
  "fetched_at": "2025-11-08T11:14:23.796552+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "We're still a few weeks from the big holiday sale, but there are already several deals on iPhones, Google, Samsung, and more to take advantage of.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThe 10 best early Black Friday phone deals to grab now\nIt's the two words you either dread or love: Black Friday. This year's holiday shopping bonanza is just a few weeks away -- with the official sale happening on Nov. 28 -- but if there's one thing I've learned from covering the biggest holiday for retailers, it's that every single one of them is impatient in the best way.\nAhead of Black Friday, stores like Amazon, Best Buy, and Walmart, as well as carriers like AT&T, Verizon, and T-Mobile, have marked down a handful of phones at prices that you can expect to stick around as the weeks go by. One of the best deals nets you a Samsung Galaxy S25 Edge with 512GB for $490 off.\nAlso: The best Black Friday deals live now\nI should mention that we only recommend phones that have gone through our rigorous testing methodologies, so all the picks mentioned on this list have been thoroughly inspected for their performance, endurance, unique features, and real-world benefits.\nBest early Black Friday phone deals\n- Current price: $599\n- Original price: $799\nArguably the most well-rounded phone on the market today, the Google Pixel 10 is currently on sale for its best price of the season, having been released just months ago. While the Pro models are also on sale, I'd recommend the standard Pixel for its value and performance. It also features most of the Gemini AI tools found on the pricier models, making it the best deal for both casual and pro consumers.\n- Current price: $819\n- Original price: $1,219\nWhile you're paying less for the 256GB variant of Samsung's ultra-thin Galaxy flagship, it's the 512GB variant that will save you the most money, with a discounted rate of $400 ahead of Black Friday. This is the price that the phone should've been since the beginning, so it's great to see it that way, as more consumers are upgrading this fall season.\nReview: Samsung Galaxy S25 Edge\n- Current price: Free (sort of)\n- Original price: $1,099\nI know; nothing's actually free in today's market, but if you play your cards right, you can certainly get yourself the latest iPhone, Google Pixel, or Samsung Galaxy for close to nothing. Take this AT&T promotion as an example: As long as you're in a qualifying Unlimited data plan and trade in a device valued at $230 or more (which can be as simple as an older iPhone model), the carrier will cover the cost of the new iPhone over the course of three years.\nThere are a lot of ifs and buts with carrier deals, so I'd recommend reading through the fine print and making your best judgment on what to commit to.\nAlso: I compared the iPhone 17, iPhone Air, 17 Pro, and 17 Pro Max: Here's which one to buy\n- Current price: Free\n- Original price: $999\nT-Mobile is doing something similar, but its trade-in offer requires a shorter commitment, with you only needing to agree to 24 months' worth of trade-in bill credits. This offer nets you the latest Google Pixel model for free, so long as you cover the pre-discounted tax.\nAlso: I compared the Pixel 10 Pro to every older Google flagship model - the biggest upgrades\n- Current price: $900\n- Original price: $1,999\nFinally, I can confidently recommend Samsung's big-screen foldable phone to the masses, as this year's Z Fold 7 model features its thinnest (and hand-friendly) form factor yet. It's still expensive, with a retail price of $2,000, but this Verizon deal reduces the cost by more than 50%, provided you're on an Unlimited Ultimate plan and trade in a device as old as the Galaxy S22 (from 2022).\nReview: I spent a week in New York City with the Samsung Z Fold 7 - and it spoiled me the entire time\nMore early Black Friday phone deals\n- Google Pixel 9: $499 (save $300): While it's no longer the latest model, the Pixel 9 remains a formidable option in 2025, with a high-refresh-rate display, similar software and AI features to the Pixel 10, and an accessible price tag.\n- Google Pixel 10 Pro Fold: $1,499 (save $300): Rivaling the Samsung Z Fold 7 is the new Pixel 10 Pro Fold, which is the first foldable phone with an IP68 rating for water and dust resistance.\n- Samsung Galaxy S25 FE: $649 (save $60): Although it often goes under the radar, the FE model this year excels in display, performance, and battery life at a relatively affordable price.\n- AAWireless Two adapter: $55 (save $10): ZDNET's most-recommended Android Auto adapter lets you pair your phone to your car wirelessly, but there are a few other tricks up its sleeves.\n- Motorola Moto G 2025: $175 (save $25): It's not a big discount, but the Moto G (2025), a fantastic budget phone with a large battery, is now even more accessible during the holiday season.\nFAQs\nWhen is Black Friday?\nBlack Friday is Friday, Nov. 28, the day after Thanksgiving. While it's typically associated with general retail sales, we're seeing a lot more online deals, as well. Cyber Monday, the traditional online shopping sale day, is Monday, Dec. 1. Both of these days will have some great deals, and there will be some overlap.\nAre phones really cheaper during Black Friday?\nYes, phones, including recent iPhone models, are often cheaper on Black Friday and Cyber Monday, matching (if not beating) the level of discount you'd find during any other major shopping event. This is partly because Cyber Week occurs months after most manufacturers, such as Samsung, OnePlus, Google, and Apple, have launched new devices. With the passage of time, you'll often see the more recent phones discounted by a significant amount at this time.\niPhones are cheaper during this time because carriers like Verizon, T-Mobile, and AT&T offer competitive trade-in and sign-on promotions. As long as you read the fine print about the qualifications, most of these deals will cover the retail cost of the new iPhone. You'll just have to agree to a long-term installment plan that ranges between 24 months to 36 months.\nHow did we choose these early Black Friday deals?\nZDNET chooses Black Friday and Cyber Monday deals based on the percentage of discount compared to the original price ($5 off a $20 item is just as good as $250 off a $1,000 item), how significant the discount is compared to pricing history, and whether our experts have tested and recommended the product.\nWe also examine deals from a broader perspective, considering alternative options, unique use cases, stock availability, and existing customer reviews on websites such as Amazon, Best Buy, and Reddit. The best deals will save you a meaningful amount of money while providing a truly worthwhile product.",
      "enhanced_at": 1762600517.883887,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:15:17.884232+00:00Z"
}