{
  "id": "latest-news-zdnet-com-2025-11-07-5b3d144f",
  "source_id": "latest-news-zdnet-com",
  "guid": "1e8154ec-5872-4cd1-b1b4-873c221da860",
  "title": "Best early Black Friday TV deals 2025: Save on Samsung, TCL, and more",
  "url": "https://www.zdnet.com/article/best-early-black-friday-tv-deals-2025/",
  "published_at": "2025-11-07T19:53:00+00:00",
  "fetched_at": "2025-11-08T11:14:23.794186+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Black Friday is just a few weeks away, and you can already find great deals on TVs and home theater equipment from Samsung, Sony, and more.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI've found the best early Black Friday TV deals actually worth your time\nBlack Friday and Cyber Monday are just a few weeks away, and if you want to get a jump on your holiday shopping list before Black Friday, you can already find steep markdowns on both premium and entry-level TVs from brands like Samsung, Hisense, Sony, and more.\nAlso: The top TVs ZDNET readers bought this year so far (including a surprise pick)\nRetailers like Amazon, Best Buy, and Walmart are ramping up sales, offering up to $2,500 off everything from premium OLED models to basic smart TVs to use as a second screen. You'll also be able to find discounts on home audio equipment and projectors, which means you'll be able to update or build your dream home theater without breaking the bank.\nI've been reviewing TVs for years, and can help you cut through the noise and find the best early Black Friday TV deals live now. (Check out the rest of our favorite early Black Friday deals, too.)\nBest early Black Friday TV deals\n- Current price: $230 (43% off)\n- Original price: $400\nThe Insignia QF Series is a great entry-level smart TV that uses the Fire TV platform to give you access to thousands of movies, shows, and songs to turn your living room into the ultimate entertainment hub without breaking your budget. It supports both Dolby Vision HDR and Dolby Atmos virtual surround sound for enhanced picture and audio quality, as well as integrated Alexa features for hands-free voice controls.\n- Current price: $2,000 (43% off)\n- Original price: $3,500\nThe Hisense U8QG is an excellent Mini-LED smart TV with a 165Hz refresh rate, making it perfect for everything from live sports to console gaming. It also supports Dolby Vision HDR, Dolby Atmos virtual surround sound, and AMD FreeSync Premium Pro VRR.\n- Current price: $1,400 (48% off)\n- Original price: $2,700\nThe LG C5 OLED is a high-end TV with excellent picture and audio quality, backed up by support for Dolby Vision HDR, Dolby Atmos virtual surround sound, and a 120Hz refresh rate. It's also compatible with both Nvidia G-Sync and AMD FreeSync VRR for console gaming.\nReview: Why I recommend the LG C5 OLED over more premium models\n- Current price: $2,300 (49% off)\n- Original price: $4,500\nSamsung's flagship QLED TV offers impressive picture and audio quality that rivals even OLED models, with support for HDR10+ and Dolby Atmos virtual surround sound as well as Samsung's own object tracking sound technology. You'll also get integrated voice controls for hands-free use of your new TV, a 120Hz refresh rate for smoother motion in video games, movies, and live sports, and AMD FreeSync Premium Pro VRR for console gaming.\nReview: This Samsung QLED TV model is the one most people should buy\n- Current price: $4,000 (38% off)\n- Original price: $6,500\nThe Sony Bravia 5 is the brand's flagship Mini LED TV, and it's available in a cinema-sized 98-inch model for a true movie theater experience at home. It supports both AirPlay and Google Cast for sharing media from your iOS and Android devices, Sony's Acoustic Multi-Audio for 3D surround sound, and exclusive HDR tone mapping and VRR features for gaming on the PlayStation 5.\nReview: I replaced my Samsung OLED TV with this Sony Mini LED model for a week - and didn't regret it\n- Current price: $530 (34% off)\n- Original price: $800\nThe TCL QM6K is a great, budget-friendly smart TV with integrated Alexa and Google Assistant voice controls, a 144Hz refresh rate for live sports and console gaming, and support for both Dolby Vision IQ and Dolby Atmos for enhanced picture and audio quality.\n- Current price: $900 (55% off)\n- Regular price: $2,000\nSamsung's entry-level OLED TV offers signature picture quality at a more affordable price. Built with an updated processor, the S84F uses AI-assisted machine learning to analyze everything from the latest blockbusters to classic shows and movies to provide crisp, clean 4K resolution. It also features a Pantone Validated OLED panel for better color accuracy and more lifelike images.\n- Current price: $1,500 (40% off)\n- Regular price: $2,500\nTCL's flagship QD-Mini LED TV offers premium features like a 144Hz refresh rate, Bang & Olufsen audio, IMAX Certification for movie buffs, and support for both Dolby Atmos and Dolby Vision HDR.\nBlack Friday Fire TV deals\n- Current price: $75 (42% off)\n- Regular price: $130\nThis 32-inch smart TV from Toshiba is a great option as a second screen in your bedroom or kids' playroom, with support for DTS Virtual: X audio, Apple AirPlay screen sharing, and integrated Alexa voice controls. The Fire TV platform gives you access to the entire Prime library of shows, movies, and music as well as support for thousands of popular streaming apps so you never miss a second of your favorite media.\n- Current price: $170 (32% off)\n- Regular price: $250\nThe Amazon Fire TV 2 Series is a solid entry-level smart TV with integrated Alexa voice controls, a preloaded suite of popular streaming apps, and Dolby Digital Plus audio processing. It also features Bluetooth connectivity for a wireless home theater setup and HDMI ARC for integrating soundbars and other audio equipment.\n- Current price: $180 (40% off)\n- Regular price: $300\nThe Insignia F50 is a great mid-range Fire TV with integrated Alexa voice controls, DTS Virtual: X audio, and standard HDR support. It also features integrated parental controls so little ones won't be able to access restricted content, apps, and channels.\n- Current price: $380 (31% off)\n- Regular price: $550\nIf you prefer the Fire TV platform for streaming, that doesn't mean you're stuck with an Amazon-branded TV. The Hisense E6 is an excellent mid-range Fire TV with Dolby Vision and Dolby Atmos support, an integrated AI light sensor for automatic brightness adjustments, and a dedicated gaming mode that boosts the 60Hz refresh rate and lowers input latency.\n- Current price: $340 (23% off)\n- Regular price: $440\nThe Amazon Fire TV Omni QLED features an updated QLED panel as well as support for Dolby Vision IQ HDR for enhanced picture quality, even on its smaller 43-inch screen. It also uses integrated sensors to monitor ambient lighting and automatically adjust picture brightness for the best viewing experience in almost any room.\n- Amazon Fire TV Cube: $100 (save $40): This device combines the functionality of both a smart speaker and streaming box into a single unit. With support for 4K resolution, Dolby Vision HDR, and Dolby Atmos virtual surround sound, you'll get a great streaming experience as well as a convenient way to control your smart home network.\n- Hisense A7 43-inch: $200 (save $50): A solid entry-level smart TV from Hisense with support for Dolby Vision, Dolby Atmos, and an automatic low latency picture mode for console gaming.\n- Amazon Fire TV Soundbar Plus: $175 (save $75): A decent mid-range soundbar with both Dolby Atmos and DTS:X audio processing as well as four preset modes and custom EQ options. You can also buy a version bundled with a subwoofer or both a subwoofer and satellite speakers.\nBlack Friday Hisense TV deals\n- Current price: $1,900 (46% off)\n- Regular price: $3,500\nThis cinema-sized TV from Hisense features a 144Hz refresh rate for smoother action during live sports as well as fast-paced movies, shows, and video games. It also uses integrated sensors to monitor ambient lighting and automatically adjust picture brightness for the best viewing in almost any environment. There's even an integrated subwoofer for enhanced bass tones when streaming music and enhanced audio for movies, shows, and games.\nRead more: The best Hisense TVs you can buy\n- Current price: $1,730 (42% off)\n- Regular price: $3,000\nA slightly more affordable ultra big-screen option from Hisense that offers similar picture and audio quality to the U6 as well as a 144Hz refresh rate, anti-glare display for better viewing, AirPlay 2 support for screen sharing, and a Filmmaker Mode for movie buffs.\n- Current price: $1,450 (58% off)\n- Regular price: $2,500\nA worthy competitor to Samsung's The Frame, the Hisense Canvas S7 features a gallery-inspired design so you can create your very own art displays when you aren't streaming or gaming. The wooden frame helps elevate the illusion of being a piece of art rather than a TV, while the matte display diffuses harsh lighting for better viewing in both media and art modes.\n- Current price: $1,500 (35% off)\n- Regular price: $2,300\nOne of the more budget-friendly cinema-sized Hisense TVs, the QD5 offers a 144Hz refresh rate, Dolby Vision and Dolby Atmos support, AMD FreeSync Premium Pro VRR for console gaming, and integrated Google Assistant voice controls.\n- Current price: $1,500 (40% off, plus $100 FIFA voucher)\n- Regular price: $2,500\nThe Hisense U8 is a great mid-range big-screen TV with support for both Dolby Vision IQ and Dolby Atmos virtual surround sound, a 165Hz refresh rate, and VRR support for console gaming. The 75-inch display features an anti-glare coating and a peak brightness of 5,000 nits for better visibility in brighter spaces.\nBlack Friday LG TV deals\n- Current price: $999 (50% off)\n- Regular price: $2,000\nIf you're in the market for an OLED TV but want something a bit more affordable, the LG B5 is a great option. The 120Hz refresh rate is great for everything from live sports and action movies to fast-paced video games. And with support for both Nvidia G-Sync and AMD FreeSync VRR, you'll hardly have to worry about screen tearing and stuttering. It features integrated support for Alexa, Google Assistant, and even Siri via Apple HomeKit so you can more easily integrate your new TV into your smart home network.\n- Current price: $1,800 (49% off)\n- Regular price: $3,500\nThe LG Class 92A is a high-end Mini-LED TV that features a 120hz refresh rate, support for Alexa and Google Assistant voice controls, Dolby Vision HDR and Dolby Atmos virtual surround sound, and AMD FreeSync Premium VRR for console gaming.\n- Current price: $4,000 (38% off)\n- Regular price: $6,500\nThe LG G4 OLED might be an older model, but it still offers top-notch picture and audio quality with a gallery-inspired design, integrated brightness booster, support for both Nvidia G-Sync and AMD FreeSync Premium VRR, and a dedicated Filmmaker Mode for movie buffs.\n- Current price: $3,300 (34% off)\n- Regular price: $5,000\nAn older iteration of LG's flagship OLED line that still offers great features and excellent picture and sound. It supports both Dolby Vision and Dolby Atmos for a more immersive experience, and it features an integrated brightness booster for the best viewing in almost any lighting. You'll also get a 120Hz refresh rate and 0.1ms response time, making it an excellent option for console gamers.\n- Current price: $750 (38% off)\n- Regular price: $1,200\nA mid-range Mini-LED option from LG, the Class 85A features support for Alexa, Google Assistant, and Siri voice controls as well as AMD FreeSync Premium VRR for console gaming. It also supports Apple AirPlay for screen sharing photos and video from your iOS devices.\nBlack Friday Samsung TV deals\n- Current price: $1,800 (49% off)\n- Regular price: $3,500\nThe Samsung QN80F is a TV that's almost tailor-made for streaming. It features support for both Dolby Atmos virtual surround sound and Samsung's object tracking sound technology for a more immersive listening experience. It also has an active voice amplifier mode so you never miss a line of your favorite movies and shows. Console gamers will love the 144Hz max refresh rate and dedicated gaming dashboard with support for cloud gaming services like GeForce Now and Xbox GamePass, so you can play your favorite titles without a physical console.\n- Current price: $1,700 (43% off)\n- Regular price: $3,000\nThe Samsung DU9000 is one of the more affordable cinema-sized TVs on the market while still offering great picture, audio, and smart features. It comes with a preloaded suite of popular streaming apps like Netflix, Disney+, and Prime Video so you can start streaming your favorite shows, music, and movies right out of the box. You'll also get HDR 10+ support, a 120Hz refresh rate, and integrated Alexa voice controls.\n- Current price: $1,850 (38% off)\n- Regular price: $3,000\nThe QNX1D is a model sold exclusively on the Samsung website, and is a decent mid-range QLED TV for streaming, live sports, and gaming. It features both Dolby Atmos and Samsung's object tracking sound technology for 3D virtual surround sound that follows the on-screen action as well as auto HDR remastering so even classic Hollywood movies look great in 4K.\n- Current price: $1,500 (40% off)\n- Regular price:\nAn entry-level version of Samsung's OLED TV lineup with support for Dolby Atmos HDR and object-tracking sound for enhanced picture quality and a more immersive listening experience. The 120Hz refresh rate is perfect for everything from live sports to console gaming, while integrated voice assistants give you hands-free control over your new TV.\n- Current price: $600 (33% off)\n- Regular price: $900\nAn affordable big-screen TV with premium features like a dedicated console gaming dashboard, object-tracking sound, and Filmmaker Picture Mode for film buffs. It uses integrated sensors to monitor ambient sound and automatically adjust volume and audio settings for a listening experience tailored to your space.\n- Samsung The Frame 65-inch: $1,300 (save $700): Samsung's gallery-inspired QLED TV features an anti-glare display for better visibility in bright rooms, a Pantone Validated panel for better color accuracy, and an integrated motion sensor for better energy efficiency.\n- Samsung QEF1 75-inch: $611 (save $588): An entry-level big-screen TV from Samsung with integrated Knox security for better protection of your personal data and online activity, and it features object-tracking sound for a more immersive streaming experience.\n- Samsung QE1D 55-inch: $350 (save $650): A basic, but solid, QLED TV from Samsung that features a dual LED panel to create warm and cool colors simultaneously, basic object tracking sound, and dedicated gaming hub with cloud gaming support.\nBlack Friday Sony TV deals\n- Current price: $1,600 (47% off)\n- Regular price: $3,000\nThe Sony X93CL is an updated version of the brand's mid-range Mini LED TVs, featuring an IMAX Enhanced picture mode for movie buffs, Apple AirPlay support for screen sharing from mobile devices, and both Dolby Atmos and Acoustic Multi-Audio for room-filling, 3D virtual surround sound and a more immersive streaming experience.\n- Current price: $1,600 (43% off)\n- Regular price: $2,800\nThe Sony A95L might be an older OLED model, but it still offers great features like AirPlay support, a 120Hz refresh rate, and DTS:X audio processing for room-filling sound and a more immersive streaming experience.\n- Current price: $1,400 (30% off)\n- Regular price: $2,000\nThe Bravia XR8B is Sony's entry-level OLED TV, offering signature picture and audio quality in a more affordable package. It also features Sony's Acoustic Surface Audio+ technology that turns the entire screen into a speaker for object-tracking sound and near-perfect video and audio syncing.\n- Current price: $700 (36% off)\n- Regular price: $1,100\nAn excellent mid-range LED TV from Sony with a 60Hz refresh rate, integrated Alexa and Google Assistant voice controls, HDR10 support, and a suite of preloaded popular streaming apps so you can start watching your favorite shows and movies right out of the box.\n- Current price: $2,300 (30% off)\n- Regular price: $3,300\nThe Sony Bravia 8 II is an excellent OLED TV with signature picture quality and Sony's Acoustic Surface Audio+ technology for object-tracking sound and near-perfect video and audio syncing. Its dedicated game mode is perfect not only for the PlayStation 5, but any console you own with a 120Hz refresh rate, VRR support, and support for Dolby Vision HDR.\nBlack Friday TCL TV deals\n- Current price: $600 (50% off)\n- Regular price: $1,200\nA budget-friendly big-screen TV with a 144Hz refresh rate, Dolby Atmos virtual surround sound, HDR10+ support for enhanced picture quality, and VRR support for console gaming.\n- Current price: $1,100 (45% off)\n- Regular price: $2,000\nA mid-range big-screen TV with integrated Google Assistant voice controls, a 144Hz refresh rate, an IMAX Enhanced certification for movie lovers, and support for AMD FreeSync Premium Pro VRR while console gaming.\n- Current price: $700 (46% off)\n- Regular price: $1,300\nA great mid-range QD-Mini LED TV that uses the Google TV platform for integrated Google Assistant voice controls as well as access to thousands of popular streaming apps to turn your living room or home theater into the ultimate entertainment hub. With Bluetooth support, you can set up wireless home audio equipment for a custom home theater or share media from your iOS and Android devices.\n- Current price: $1,500 (50% off)\n- Regular price: $3,000\nThe QM9K is TCL's flagship QD-Mini LED TV featuring Bang & Olufsen audio, a 144Hz refresh rate, and a dedicated game mode with VRR support. It also has an IMAX Enhanced picture mode for streaming movies and shows, while Dolby Atmos virtual surround sound gives you a more immersive listening experience while streaming music.\n- Current price: $290 (28% off)\n- Regular price: $400\nAn entry-level TV from TCL that features the Fire TV platform for access to thousands of apps for streaming movies, shows, and music. It also features Bluetooth connectivity for setting up wireless soundbars or sharing media from your iOS and Android mobile devices. It even supports both Dolby Vision and Dolby Atmos for enhanced picture quality and virtual surround sound.\nFAQs\nWhen is Black Friday?\nIn the US, Black Friday is the day after Thanksgiving. This year, Black Friday falls on Nov. 28, but you can already find great discounts on high-end and midrange TVs from brands like Samsung, Sony, and more, both online and at brick-and-mortar retailers.\nAre TVs really cheaper during Black Friday?\nThey can be! Televisions are one of the few big-ticket tech items that regularly see sales and markdowns throughout the year, but especially during Black Friday and the entire holiday shopping season. Both big-name brands like LG and Sony, as well as smaller names like TCL and Hisense, will offer significant markdowns around the holidays to clear inventory space for the new model year releases.\nHow did we choose these early Black Friday deals?\nWhen it comes to TV deals, not all of them are created equal. For this list, I chose only the best TV models with the steepest discounts, ignoring everything that wasn't at least 20% off. I also made sure to include a variety of screen sizes to help you find the perfect TV to fit your space without breaking your budget.",
      "enhanced_at": 1762600488.4685082,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:14:48.468843+00:00Z"
}