{
  "id": "latest-news-zdnet-com-2025-11-07-53aa4eaa",
  "source_id": "latest-news-zdnet-com",
  "guid": "ec9a16d1-f9a4-4d65-956d-f0612738c788",
  "title": "A new Chinese AI model claims to outperform GPT-5 and Sonnet 4.5 - and it's free",
  "url": "https://www.zdnet.com/article/a-new-chinese-ai-model-claims-to-outperform-gpt-5-and-sonnet-4-5-and-its-free/",
  "published_at": "2025-11-07T22:07:28+00:00",
  "fetched_at": "2025-11-08T11:14:23.793200+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The plot of the US-China AI arms race just thickened - again.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "A new Chinese AI model claims to outperform GPT-5 and Sonnet 4.5 - and it's free\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Moonshot released its new Kimi K2 Thinking model on Thursday.\n- It claims to outperform GPT-5 and Sonnet 4.5 on some benchmarks.\n- Open-source AI poses a challenge to proprietary US models.\nThe global AI arms race stays in constant flux, this time thanks to the arrival of a new model from the up-and-coming Chinese AI lab Moonshot.\nAlso: Why open source may not survive the rise of generative AI\nOn Thursday, the Beijing-based company released Kimi K2 Thinking, a reasoning model that it says outperforms OpenAI's GPT-5 and Anthropic's Claude Sonnet 4.5 on key benchmarks, including Humanity's Last Exam, BrowseComp (which tests AI agents' ability to extract hard-to-find online information via web browsers), and Seal-0 (which assesses reasoning capabilities). Kimi K2 Thinking also showed coding abilities that were comparable to GPT-5 and Sonnet 4.5, but not notably more impressive.\n\"By reasoning while actively using a diverse set of tools, K2 Thinking is capable of planning, reasoning, executing, and adapting across hundreds of steps to tackle some of the most challenging academic and analytical problems,\" Moonshot wrote on its website.\nWhat Kimi K2 offers\nKimi K2 Thinking is a Mixture-of-Experts (MoE) model blending long-horizon planning, adaptive reasoning, and the use of online tools (such as browsers), \"continually generating and refining hypotheses, verifying evidence, reasoning, and constructing coherent answers,\" the company wrote. \"This interleaved reasoning allows it to decompose ambiguous, open-ended problems into clear, actionable subtasks.\" It was trained with around 1 trillion parameters and can be accessed on Hugging Face.\nAlso: The best free AI for coding in 2025 - only 3 make the cut now\nCrucially, Kimi K2 Thinking -- which builds upon the Kimi K2 model released in July -- is open source, meaning developers can access and build upon the underlying code and weights for free. Read that again: A model that (according to Moonshot) has more advanced agentic capabilities than frontier models from OpenAI and Anthropic is free. Moonshot also said it cost less than $5 million to train -- $4.6 million to be exact, according to CNBC -- a vanishingly small amount compared to the billions that have been spent by the most prominent AI labs in the U.S.\nIf externally verified, the implications of that could be huge -- or flame out like the DeepSeek-induced panic of January 2025 did.\nConsiderations for businesses\nFirst and foremost, there's the commercial side of things. Since the arrival of ChatGPT just under three years ago, business owners have been bombarded with pressure to onboard new AI tools, especially agents, which tech developers have marketed as productivity boosters and virtual assistants. That often meant paying for business-tier offerings, like OpenAI's ChatGPT for Enterprise.\n(Disclosure: Ziff Davis, ZDNET's parent company, filed an April 2025 lawsuit against OpenAI, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.)\nUntil now, the general sales pitch across Silicon Valley has been that it's worthwhile to pay for proprietary AI tools from a leading developer, since -- to paraphrase what's become a popular marketing trope -- even if AI doesn't put you out of business, another company using AI almost certainly will (never mind the fact that the vast majority of businesses using AI haven't seen any measurable ROI).\nAlso: As OpenAI hits 1 million business customers, could the AI ROI tide finally be turning?\nSimilar to DeepSeek's R1, the arrival of Moonshot's new model throws the entire logic of that sales pitch into question. Suddenly, businesses have at their disposal a free AI model that's supposedly better at performing critical agentic tasks than the best proprietary models available.\nOf course, it's highly unlikely that legions of businesses are going to throw the AI baby out with the bathwater and immediately cancel their OpenAI or Anthropic enterprise subscriptions just because the latest hotshot Chinese firm claims to have built a more advanced model. But it'll certainly turn some heads and get people wondering again: Maybe the proprietary, subscription-based model of AI they've been sold isn't the only way of the future.\nIn fact, it's already happening: Some US companies like Airbnb now prefer AI tools from Chinese companies over those from their American counterparts, citing both their better performance across some critical tasks as well as their lower cost. Of course, some experts have expressed concern that open-source models, especially with foreign origins, pose an added security risk; several US agencies and other countries swiftly banned DeepSeek.\nAI faceoff: US vs. China\nIf the January arrival of R1 was that country's \"Sputnik Moment,\" then Thursday's debut of Moonshot's Kimi K2 Model is the Chinese AI industry's moon landing (pun intended).\nAlso: AI agents are only as good as the data they're given, and that's a big issue for businesses\nAmerican policymakers and tech pundits have commonly framed that race as an ideological one, with \"American AI\" on one side supposedly encapsulating the ideals of Western liberal democracy and \"Chinese AI\" on the other, representing centralized control over the flow and censorship of information.\nWhile it's true that some AI models built by Chinese labs exhibit biases and censor information that seem to align with the official policies of the Chinese Communist Party, it's important to bear in mind that all AI systems -- regardless of where their parent companies are based -- come with some kind of bias; the technology you use will to some degree reflect the worldview of the people who built it and the bias embedded in the data used to train it.\nIn any event, ideological concerns may take a backseat to financial ones if the new Kimi model's performance holds up to the impressive metrics on Moonshot's website. No investor can overlook that paltry $4.6 million pricetag.\nAlso: I've been testing the top AI browsers - here's which ones actually impressed me\nHere in the US, while businesses and individual consumers have been sold the idea that it's worth paying for a top-tier proprietary model, investors have been sold the story that in order to build those tools, companies need to spend enormous sums of money, well into the tens of billions of dollars, even though many of those companies aren't yet profitable.\nSo far, it's been working. Leading US AI labs like OpenAI and Anthropic are now valued in the hundreds of billions, and their spending on the infrastructure and compute required to build increasingly advanced models has been ramping up by the day. But fears have been growing around the prospect of an AI bubble: the possibility that a large segment of our global economy has been inextricably tied up with a commodity that, in the end, might not be able to generate a profit, and which could send the whole house of cards toppling down, like the widespread use of securitized derivatives did to the housing market in 2008.\nAlso: Gartner dropped its 2026 tech trends - and it's not all AI: Here's the list\nOnly time will tell if we're actually living inside an AI bubble. But one thing is certain: The sudden arrival of a free tool that outperforms leading models from OpenAI and Anthropic is going to make many tech investors' eyes water -- and wonder if they ought to be backing a different horse.",
      "enhanced_at": 1762600466.3896332,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:14:26.389984+00:00Z"
}