{
  "id": "latest-news-zdnet-com-2025-11-07-82dd9c46",
  "source_id": "latest-news-zdnet-com",
  "guid": "05ff7e20-950c-47aa-a1ed-fa2d5985fb7e",
  "title": "As OpenAI hits 1 million business customers, could the AI ROI tide finally be turning?",
  "url": "https://www.zdnet.com/article/as-openai-hits-1-million-business-customers-could-the-ai-roi-tide-finally-be-turning/",
  "published_at": "2025-11-07T19:50:11+00:00",
  "fetched_at": "2025-11-08T11:14:23.794737+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "ChatGPT Enterprise seats have grown nine times year-over-year. Here's what experts say is working.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "As OpenAI hits 1 million business customers, could the AI ROI tide finally be turning?\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- OpenAI now has 1 million business customers.\n- Customers report positive ROI, contrasting industry findings.\n- ChatGPT for Work seats increased by 40% in two months.\nThe promise of what generative AI can do for productivity has led businesses to invest substantial capital in AI products and services, creating a new, lucrative market for AI companies to tap into. OpenAI has launched new features and offerings to meet this demand -- and it appears to be working.\nAlso: How Anthropic's enterprise dominance fueled its monster $183B valuation\nOn Wednesday, OpenAI announced that it has more than one million business customers worldwide, which the company claimed makes it the fastest-growing business platform in history. That brings the company to seven million total ChatGPT for Work seats -- a 40% increase in two months, and nine times the year-over-year growth of ChatGPT Enterprise seats.\nHow did OpenAI do it?\nThe company credits this demand to some of its latest features, including company knowledge, which enables ChatGPT to reason across different company databases like Slack, SharePoint, Google Drive, and Codex -- the company's coding agent -- which has seen a 10-fold increase in usage since August.\nHowever, OpenAI also noted its ability to convert everyday users -- over 800 million per week, the company reports -- into committed business customers.\nAlso: Want better ChatGPT responses? Try this surprising trick, researchers say\n\"OpenAI acquired its customer base by converting massive consumer usage into an enterprise sales funnel,\" Gartner analyst Chirag Dekate told ZDNET. \"This consumer-to-enterprise flywheel is supported by simple product offerings, like ChatGPT for Work and direct API access.\"\nThis year was also big for the company on the multimodal front. OpenAI launched its most advanced and realistic video model, Sora 2, just last month. This model has surpassed OpenAI's own DALL-E 3, even producing accurate text. The company also recently released the Realtime API and gpt-realtime to help customers produce realistic voice agents.\nOpenAI vs. competitors\nThese releases have helped OpenAI compete with Anthropic, Google, and Microsoft, which have also been trying to capture the enterprise audience.\nAlso: The best free AI for coding in 2025 now - only 3 make the cut (and 5 fall flat)\nSome, like Microsoft, possess a unique advantage, as many businesses prefer to go to their cloud provider for AI solutions. For example, a Wharton study found that all of the top employer-paid subscriptions aligned with the top primary cloud providers, except for ChatGPT.\nWhile it may be true that offering customers a solution already included in their projects may be convenient, it could also make it more difficult for non-Microsoft users to adopt its tools.\n\"Microsoft continues to maintain a strategic moat of its deep incumbency in enterprise accounts and a strong bundling strategy,\" said Dekate. \"Microsoft leverages its M365, Security, and Azure data services as a massive distribution channel for Copilot.\"\nAlso: Microsoft researchers tried to manipulate AI agents - and only one resisted all attempts\nGoogle's advantage lies more heavily on DeepMind's ability to create cutting-edge AI innovations such as Veo 3, Nano banana, and Gemini models, as well \"as the breadth of its Vertex AI toolchain and integration with Workspace,\" added Dekarte.\nUntil now, OpenAI's biggest competitor in the enterprise space has been Anthropic, which currently serves up to 300,000 enterprise customers. According to Anthropic, that totals over $100,000 in run-rate revenue, and has grown nearly seven times in the past year. To capture this audience, the company has largely relied on its reputation as a safe and reliable AI tool, taking a careful approach to training on user data from the beginning and avoiding major scandals.\nA turn in the ROI debate\nOne of the biggest topics of discussion in AI right now is a growing body of evidence failing to show its ROI for businesses that implement it. However, OpenAI included in the blog post examples of how many of its enterprise customers are already seeing some payoff.\nAlso: Everyone thinks AI will transform their business - but only 13% are making it happen\nFor example, the company wrote that Cisco reduced code review times by 50% by shrinking project timelines from weeks to days using Codex. Meanwhile, Carlyle utilized OpenAI's AgentKit evaluation platform to reduce the development time for Carlyle's multi-agent due diligence framework by over 50%.\n\"New products like company knowledge and AgentKit are designed to reduce integration time and shorten deployment cycles. This dual approach of expanding access and simplifying deployment has accelerated adoption. There is verified evidence that companies are seeing ROI in specific, high-value workflows,\" said Dekarte.\nWant more stories about AI? Sign up for our AI Leaderboard newsletter.\nFurthermore, the same Wharton study found that most enterprises achieve a positive ROI, with Tech and Telecom reporting as high as an 88% positive ROI, and Banking/Finance and Professional Services reporting 83% positive ROI. Other sectors see slightly smaller returns, with retail, for example, showing 54% positive ROI.",
      "enhanced_at": 1762600492.7154305,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:14:52.715749+00:00Z"
}