{
  "id": "latest-news-zdnet-com-2025-11-07-78110ff1",
  "source_id": "latest-news-zdnet-com",
  "guid": "199f214e-50ef-4249-907e-f52f56a290ab",
  "title": "Need a sleep study? It could be as easy as downloading an Apple Watch app soon",
  "url": "https://www.zdnet.com/article/need-a-sleep-study-it-could-be-as-easy-as-downloading-an-apple-watch-app-soon/",
  "published_at": "2025-11-07T17:40:05+00:00",
  "fetched_at": "2025-11-08T11:14:23.796764+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "BIDSleep, an app developed using the Apple Watch Series 6, aims to monitor sleep disorders - without the hassle of a sleep study.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Need a sleep study? It could be as easy as downloading an Apple Watch app soon\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- A team of researchers developed a new sleep study app.\n- The app was developed using AI and an Apple Watch Series 6.\n- BIDSleep aims to monitor sleep disorders without a sleep study.\nResearchers at the University of Massachusetts Amherst are turning Apple Watches into advanced sleep stage monitoring devices.\nAlso: The best sleep trackers of 2025: These sleep trackers improved my sleep\nProfessor Joyita Dutta and her team at the Biomedical Imaging and Data Science Lab developed BIDSleep, an app that collects data for studying sleep and could serve as an alternative to the expensive and complex equipment and protocols associated with the gold standard of sleep studies. BIDSleep uses an Apple Watch, which Dutta says the team included for its accessibility.\nDutta said she envisions that researchers will eventually use this app to monitor people with sleep disorders outside of a lab.\nThe study for the app was conducted with 47 adults who wore the Apple Watch Series 6 and a Dreem 2 Headband over seven nights for sleep monitoring and stage assessment.\nAlso: I tested the e-paper smartwatch that got the internet buzzing - and don't want to take it off\nThe BIDSleep app collects instantaneous heart rate data as a person progresses through their sleep stages and feeds it into the researchers' AI model. In this study, the results mirrored those of EEG-based sleep staging -- the gold standard -- and accurately identified the correct sleep stage around 70% of the time. The AI model outperformed other sleep stage prediction approaches in the research community, according to the blog post.\nThe team did not use the Apple Watch Series 6's native sleep tracking capabilities, but they plan to compare those features with the BIDSleep app's own in the future. Dutta says her and her team's app will be more accurate because of its richer data aggregation.\nWearables for research\nHealth wearable technology, like Apple Watches, smart rings like Oura, and more, is constantly being used in scientific research to either monitor health conditions or develop tools for addressing them. These devices, which are packed with heart sensors, accelerometers, gyroscopes, and light sensors, can capture a wide array of biomarkers. Those are useful both to consumers aiming to track their health and researchers seeking the next health innovation.\nAlso: One of the best Apple Watches you can buy isn't Apple's newest (but it's 30% off)\nSleep studies for people with sleep disorders are often costly and complex to conduct. The gold standard is conducted in a lab, and at-home assessments require people to wear electrodes on their heads as they sleep. Not to mention that sleep monitoring through this process is limited to one night and rarely takes into account shorter sleep durations, like naps.\nContrast that with an Apple Watch, which continuously monitors sleep activity -- whether that's a nap or a full night of sleep -- and is comfortable and discreet around the wrist.\nAlso: AI agents are transforming the healthcare and life sciences industry\n\"The broad availability and round-the-clock wearability of smartwatches make them particularly well-suited for studying all forms of sleep,\" the researchers wrote in a blog post.",
      "enhanced_at": 1762600520.2274268,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:15:20.227776+00:00Z"
}