{
  "id": "schneier-on-security-2025-11-07-df9db05a",
  "source_id": "schneier-on-security",
  "guid": "https://www.schneier.com/?p=71119",
  "title": "Faking Receipts with AI",
  "url": "https://www.schneier.com/blog/archives/2025/11/faking-receipts-with-ai.html",
  "published_at": "2025-11-07T12:01:46+00:00",
  "fetched_at": "2025-11-08T11:10:33.655499+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Over the past few decades, it&#8217;s become easier and easier to create fake receipts. Decades ago, it required special paper and printers&#8212;I remember a company in the UK advertising its services to people trying to cover up their affairs. Then, receipts became computerized, and faking them required some artistic skills to make the page look realistic. Now, AI can do it all: Several receipts shown to the FT by expense management platforms demonstrated the realistic nature of the images, which included wrinkles in paper, detailed itemization that matched real-life menus, and signatures. [&#8230;] The rise in these more realistic copies has led companies to turn to AI to help detect fake receipts, as most are too convincing to be found by human reviewers. The software works by scanning receipts to check the metadata of the image to discover whether an AI platform created it. However, this can be easily removed by users taking a photo or a screenshot of the picture. To combat this, it also considers other contextual information by examining details such as repetition in server names and times and broader information about the employee&#8217;s trip. Yet another AI-powered security arms race.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Faking Receipts with AI Over the past few decades, it’s become easier and easier to create fake receipts. Decades ago, it required special paper and printers—I remember a company in the UK advertising its services to people trying to cover up their affairs. Then, receipts became computerized, and faking them required some artistic skills to make the page look realistic. Now, AI can do it all : Several receipts shown to the FT by expense management platforms demonstrated the realistic nature of the images, which included wrinkles in paper, detailed itemization that matched real-life menus, and signatures. […] The rise in these more realistic copies has led companies to turn to AI to help detect fake receipts, as most are too convincing to be found by human reviewers. The software works by scanning receipts to check the metadata of the image to discover whether an AI platform created it. However, this can be easily removed by users taking a photo or a screenshot of the picture. To combat this, it also considers other contextual information by examining details such as repetition in server names and times and broader information about the employee’s trip. Yet another AI-powered security arms race.  AI , forgery , fraud Posted on November 7, 2025 at 7:01 AM • 6 Comments",
      "enhanced_at": 1762600557.5784202,
      "fetch_method": "website_specific"
    }
  },
  "updated_at": "2025-11-08T11:15:57.578712+00:00Z"
}