{
  "id": "security-affairs-securityaffairs-co-2025-11-07-48bd09b4",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184303",
  "title": "Russia-linked APT InedibleOchotense impersonates ESET to deploy backdoor on Ukrainian systems",
  "url": "https://securityaffairs.com/184303/apt/russia-linked-apt-inedibleochotense-impersonates-eset-to-deploy-backdoor-on-ukrainian-systems.html",
  "published_at": "2025-11-07T08:39:55+00:00",
  "fetched_at": "2025-11-07T11:15:48.478808+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Russia-linked group InedibleOchotense used fake ESET installers in phishing attacks on Ukrainian targets in May 2025. Russia-linked group InedibleOchotense used trojanized ESET installers in phishing attacks against Ukrainian entities detected in May 2025. The campaign used emails and Signal messages to deliver trojanized ESET installers that installed both legitimate software and the Kalambur backdoor. &#8220;Another Russia-aligned threat actor, InedibleOchotense, conducted a spearphishing campaign impersonating ESET. This campaign involved emails and Signal messages delivering a trojanized ESET installer that leads to the download of a legitimate ESET product along with the Kalambur backdoor.&#8221; reads the report published by ESET. The Russia-aligned group sent phishing emails and Signal messages containing links to trojanized ESET installers hosted on fake domains. The campaign shares tactics with activity previously attributed to UAC-0212 and the BACKORDER downloader. The researchers noticed that messages contained minor language errors, suggesting poor translation from Russian to Ukrainian. The phishing email impersonating ESET warned users of suspicious activity linked to their email and urged them to download “official threat removal software.” The link directed victims to fake ESET domains (e.g., esetsmart[.]com, esetscanner[.]com, esetremover[.]com) hosting a ZIP file with a legitimate ESET AV Remover and a Kalambur backdoor. The InedibleOchotense group exploited ESET’s strong reputation in Ukraine to trick users into installing malware. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, malware)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}