{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-07-5202ddc9",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/cbo-implements-controls-following-cyberattack-reports",
  "title": "Congressional Budget Office implementing new security controls following cyberattack",
  "url": "https://therecord.media/cbo-implements-controls-following-cyberattack-reports",
  "published_at": "2025-11-07T18:09:33+00:00",
  "fetched_at": "2025-11-08T11:13:23.297541+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A spokesperson for the CBO confirmed the security incident and said the agency has taken immediate action to contain it while also implementing “additional monitoring and new security controls to further protect the agency’s systems going forward.”",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Congressional Budget Office implementing new security controls following cyberattack\nThe Congressional Budget Office (CBO) disclosed a cybersecurity incident this week after an alleged nation-state breached its systems.\nThe federal agency offers budget and economic information to Congress. The Washington Post reported on Thursday that an unnamed “foreign actor” hacked into the agency and may have gained access to messages and chats between Congressional offices and staffers.\nHouse Budget Committee chairman Jodey Arrington (R-TX) confirmed in a statement that a “complex foreign actor” was behind the attack on the CBO.\n“The House Budget Committee is working closely with CBO, the House Chief Information Officer, and others to monitor the situation, ensure it’s contained, and mitigate any adverse effects of the intrusion,” Arrington said.\nA spokesperson for the CBO confirmed the security incident and said the agency has taken immediate action to contain it while also implementing “additional monitoring and new security controls to further protect the agency’s systems going forward.”\n“The incident is being investigated and work for the Congress continues,” the spokesperson said. “Like other government agencies and private sector entities, CBO occasionally faces threats to its network and continually monitors to address those threats.”\nAn anonymous source told The Washington Post that the breach was discovered in “recent days” and that the agency told Congress it detected the incident “early.”\nThe CBO declined to answer follow-up questions about the nature of the breach and how the hackers gained entry. The agency provides analysis of the financial impact of legislation to Congress.\nAndrew Garbarino (R-NY), chairman of the House Committee on Homeland Security, said he has contacted the federal cybersecurity agency about mitigation efforts, adding that cybercriminals and nation-states “are increasingly targeting government entities at every level.”\nNation-state hackers have repeatedly targeted federal government agencies involved in the country’s finances. Threat actors gained access to “highly sensitive information” in February after breaching the email system used by the U.S. Office of the Comptroller of the Currency (OCC).\nChinese hackers breached systems at the Treasury Department in December 2024 and accessed computers used by then Secretary Janet Yellen, Deputy Secretary Adewale Adeyemo and acting Undersecretary Brad Smith. Several Chinese citizens and companies were eventually sanctioned for their role in the cyberattacks.\nLast year, several U.S. agencies were also attacked by Russian government hacking groups through a vulnerability in software from Microsoft.\nThroughout 2025, federal cybersecurity agencies have warned of several vulnerabilities that would likely be used by hackers to target government systems. The Cybersecurity and Infrastructure Security Agency has released urgent emergency directives about bugs affecting popular federal government tools from Microsoft, Cisco and Oracle.\nJonathan Greig\nis a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.",
      "enhanced_at": 1762600509.016949,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:15:09.017268+00:00Z"
}