{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-07-d611b94d",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/revised-cyber-command-master-plan-dod-pentagon",
  "title": "Don't call it Cyber Command 2.0: Master plan for digital forces will take years to implement",
  "url": "https://therecord.media/revised-cyber-command-master-plan-dod-pentagon",
  "published_at": "2025-11-07T19:18:27+00:00",
  "fetched_at": "2025-11-08T11:13:23.297222+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The latest model for improving U.S. Cyber Command is circulating at the Pentagon. Some of the initiatives will spill into the next decade — an approach that is sure to create friction on Capitol Hill and beyond.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Don't call it Cyber Command 2.0: Master plan for digital forces will take years to implement\nThe Department of Defense on Thursday rolled out the final version of the latest model for how the U.S. military will build its cyber forces over the next several years, an approach that is unlikely to quell growing calls for a separate service.\nThe revised model — meant to help U.S. Cyber Command tackle issues that have persisted since its creation in 2010, like an inability to attract and keep top-tier talent — represents what is left over from the overhaul effort once known as “Cyber Command 2.0.”\nThe revamp, which began under the Biden administration, was fast-tracked by Defense Secretary Pete Hegseth earlier this year. It was eventually sent to Pentagon brass, only to be returned to Cyber Command for reexamination. Mid-level staffers and career service members carried on the initiative amid leadership churn within the command and DOD.\nThe result is a makeover that could prompt even more demands for a cyber-focused military service from outside experts and on Capitol Hill.\nWhat’s in?\nWhile the memo that details the revamp will not be made public, parts of the plan shared on Friday with Recorded Future News show the department expects it to take several years to implement its initiatives.\nFor example, an Advanced Cyber Training and Education Center, which DOD says will “develop and deliver mission-specific training and education to build expertise and mastery” won’t reach what is known as “initial operational capability” — meaning it is minimally ready for use — until late in fiscal 2028, according to the document.\nThe proposed center, originally meant to be a brick-and-mortar organization, will exist virtually, and it won’t be fully operational and serve as the central training hub for cyber forces until fiscal 2031.\nMeanwhile, many of the responsibilities assigned to a new Cyber Innovation Warfare Center, which DOD says will “accelerate the rapid development and delivery of operational cyber capabilities,” will be met between fiscal 2026 to sometime beyond fiscal 2030, the document states.\nOther portions, such as a phased approach for the services to present “fully functional tactical level” support to Cyber Command, stretch into fiscal 2032 and 2033.\nFrustration over the long-running failure by the existing military branches to provide Cyber Command with enough personnel capable of fighting foreign adversaries online has reached a boiling point in recent years. In response, Congress demanded a third-party study of the issue of creating a U.S. Cyber Force and two Washington organizations recently launched a commission that specifically aims to map out how such a force should be built.\nConversely, Pentagon officials are likely to argue the new approach, and its implementation, as reasons to hold off on creating a digital branch.\n“This model fundamentally changes the department’s approach to generating cyber forces, enabling increased lethality in our cyber forces and establishing a warrior ethos built on domain mastery, specialized skills and mission agility,” Katie Sutton, assistant secretary of Defense for cyber policy, said in a statement.\nMartin Matishak\nis the senior cybersecurity reporter for The Record. Prior to joining Recorded Future News in 2021, he spent more than five years at Politico, where he covered digital and national security developments across Capitol Hill, the Pentagon and the U.S. intelligence community. He previously was a reporter at The Hill, National Journal Group and Inside Washington Publishers.",
      "enhanced_at": 1762600499.766833,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-08T11:14:59.767144+00:00Z"
}