{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-18-f9ec395f",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42340",
  "title": "Ciberseguridad familiar o cómo enseñar a los hijos a proteger su dinero online con responsabilidad",
  "url": "https://cybersecuritynews.es/ciberseguridad-familiar-o-como-ensenar-a-los-hijos-a-proteger-su-dinero-online-con-responsabilidad/",
  "published_at": "2025-11-18T22:00:00+00:00",
  "fetched_at": "2025-11-19T11:19:13.733261+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "¿Son los niños y adolescentes vulnerables a las compras compulsivas que se producen durante el Black Friday, Ciber Monday o el periodo navideño? Estas fechas en las que las compras online se disparan pueden convertirse en una oportunidad para que padres y madres eduquen a sus hijos en materia de ciberseguridad a la vez que les hacen tomar conciencia sobre su dinero digital y hacer compras con cabeza. Desde Correcta, empresa adherida al Grupo Armora y especializada en ciberseguridad y transformación digital, dan algunos consejos sobre cómo trabajar en la ciberseguridad familiar y enseñar a los adolescentes a proteger su dinero digital. Compras online, un fenómeno que crece entre los adolescentes En estas fechas las compras por Internet se disparan y con ellas los fraudes digitales. Hoy, este fenómeno no solo afecta a los adultos, sino también a los adolescentes que manejan ya su propio dinero digital (tarjetas, cuentas virtuales, apps, videojuegos, etc.). Y es que lo que en un primer momento se podría considerar como una amenaza, se convierte en una oportunidad para que los padres les enseñen a sus hijos a organizar su propio dinero a la vez que se les educa en ciberseguridad financiera. No cabe duda de que los adolescentes están cada vez más expuestos. Y es que el número de víctimas por ciberestafas en redes sociales o en plataformas de videojuegos ha ido en aumento en los últimos años. Esto significa que esta amenaza no es solo exclusiva de adultos. Es por ese motivo que los expertos en materia de ciberseguridad y finanzas han de poner remedio a través de iniciativas de formación a familias, pero también los padres deben concienciar a sus hijos de los peligros que ofrece la red y enseñarles a crear presupuestos, tarjetas virtuales, contraseñas seguras, códigos de doble autentificación e identificar posibles amenazas de su día a día para evitar ser ciberestafados. Cómo ayudar a los más jóvenes a proteger su dinero digital y evitar ser víctimas de ciberestafas ¿De qué forma pueden los padres enseñar a sus hijos a operar con su dinero digital? Es importante explicarles cuál es valor del dinero, pero también del dinero digital. Han de entender que las tarjetas o las plataformas de pago no son infinitas y, aunque da más facilidad de pago, el gasto debe considerarse en función de prioridades y no por impulsos. Por su parte, para evitar que su gasto se dispare es necesario ayudarles a crear un presupuesto real de gasto y ahorro. Por ello, es necesario enseñarles a identificar las ofertas reales y prestar especial atención a aquellas ofertas o páginas web fraudulentas que replican otras reales. Es en este punto donde la formación en ciberseguridad a las familias se hace más que necesaria para aprender a identificarlas. Verificar la URL del sitio web, errores ortográficos, búsqueda de opiniones reales, revisión en redes sociales del comercio o plataforma, evitar pagos o aportar datos bancarios a pasarelas de pago no seguras, habilitar la verificación en dos pasos, uso de tarjetas virtuales, evitar conectarse a redes públicas Wi-Fi o desconfiar de los mensajes con descuentos exclusivos y sus remitentes es clave para evitar caer en ciberestafas. ¿Qué ocurre si a pesar de todas las precauciones se es víctima de una ciberestafa? Cada año, el número de adolescentes ciberestafados aumenta de forma significativa. Preocupa, además, cómo ha crecido el número de delitos sexuales entre los más jóvenes, un hecho que refleja su vulnerabilidad en el entorno digital. Los últimos informes de expertos revelan, también, la creciente preocupación por las ciberamenazas impulsadas por la inteligencia artificial o los deepfakes entre adolescentes. “Ante cualquier situación y sea cual sea la amenaza es fundamental que los padres mantengan una comunicación de confianza con sus hijos para que estos puedan sentirse seguros para denunciar lo ocurrido. Esto permitirá actuar con rapidez de la mano de las autoridades y expertos en la materia con el fin de identificar la amenaza y preservar las pruebas digitales”, ha afirmado Álvaro Fernández de Araoz Gómez-Acebo, fundador y CEO de Correcta. Los hábitos de compras online de los padres son ejemplo para los más pequeños Por todo, estas fechas se convierten en una gran oportunidad para que padres e hijos aprendan juntos sobre ciberseguridad y seguridad digital financiera. De esta forma las familias pueden revisar sus propios hábitos de compra para continuar su aprendizaje y ser de ejemplo a los más pequeños de la casa. Enseñar a los más jóvenes a cómo gestionar un presupuesto de compra, decidir de forma consciente y responsable sobre sus compras y blindar su presencia digital es la mejor forma de mantenerse protegidos ante posibles ciberamenazas. Así pues, la colaboración activa entre familias, instituciones educativas y expertos en ciberseguridad es la vía más eficaz para construir entre todos un entorno digital más seguro entre los adolescentes. La entrada Ciberseguridad familiar o cómo enseñar a los hijos a proteger su dinero online con responsabilidad se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}