{
  "id": "cyberscoop-2025-11-18-72c74408",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86852",
  "title": "Completed draft of cyber strategy emphasizes imposing costs, industry partnership",
  "url": "https://cyberscoop.com/trump-cyber-strategy-six-pillars-industry-partnerships-deterrence/",
  "published_at": "2025-11-18T17:01:48+00:00",
  "fetched_at": "2025-11-19T11:19:38.007949+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A forthcoming Trump administration cyber strategy will have six pillars, two of which will be deterring malicious hackers and partnering with industry, executive branch officials said Tuesday. Top figures in the administration have been slowly unveiling details of the strategy, with a draft being currently reviewed by agencies. It reportedly is taking shape earlier in the second Trump administration than it did in the preceding Biden administration, which published its strategy in 2023. National Cyber Director Sean Cairncross said the six-pillar strategy “is going to be a short statement of intent and policy, and then it will be paired very quickly with action items and deliverables.” The administration is striving “to make sure that there is a single, coordinated strategy in this domain, in a way that hasn&#8217;t happened before,” he said at the 2025 Aspen Cyber Summit. One of those pillars is deterring U.S. adversaries in cyberspace and other kinds of attackers, like ransomware gangs. “As a top line matter, it&#8217;s going to be focused on shaping adversary behavior, introducing costs and consequences into this mix,” Cairncross said.&nbsp; “It is becoming more aggressive every passing day, and as new technology is developed … and AI is folded into this next, it will become more aggressive.” There has been good work done toward responding to and mitigating ransomware attacks, he said, but that’s not enough. “What we haven&#8217;t been good at is saying, ‘What can we do over the course of 12 months to really put a dent in the incentive to engage in this,’”Cairncross said. “Is it solvable? I mean, ‘No, is the answer. It&#8217;s a very high mark. But is it possible to raise costs in a way that people maybe want to find something more productive to do with their day?” The FBI has taken a look at the entire strategy as the administration circulates it among federal agencies for consultation, said Brett Leatherman, assistant director of the bureau’s cyber division. “Sean talks about shifting the burden to the adversary. That equals imposing cost on the adversary, and there are few agencies that can do that,” Leatherman said at the same conference, touting the bureau’s joint sequenced operations. “I think having a strategy like that really does rally the interagency around certain lines of effort.” Another pillar of the strategy will focus on industry partnerships and include the streamlining of cyber regulations, Cairncross said.&nbsp; The goal is to make sure industry is “aware of what the USG [U.S. government] priorities are, sector by sector, the things that we would like to see protected, and then working with you to free up those resources to protect those assets,” Cairncross said. Cairncross said the Israeli model of fostering innovative startups to take on cyber problems is one the United States should emulate. Kemba Walden, who once served as acting national cyber director, said Cairncross is on the right track with the strategy by making sure it includes action lines and deliverables, but making sure the budget is there across agencies is important, too. “A lot of government agencies have unfunded mandates,” said Walden, now president of Paladin Global Institute. The Trump administration has slashed federal government budgets and is seeking deeper cuts, including for cyber agencies and efforts. Cairncross said some of his other priorities include modernizing the federal government and building up the cybersecurity workforce. A cyber workforce initiative will focus on aligning incentives in industry and academia, including vocational schools. On modernization, the idea involves launching pilot programs for new technologies, speeding up procurement, and testing technologies at the national labs. But Carincross didn’t give a timeline on the strategy or government modernization effort. “We are pressing to get things moving as quickly as we can,” he said. “I am not a fan of dropping things out of thin air on people, and that includes everyone that we work with throughout government. So what we&#8217;re doing right now is socializing this. We&#8217;re getting feedback. We are moving this forward in a way that people are bought in honestly.” The post Completed draft of cyber strategy emphasizes imposing costs, industry partnership appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}