{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-18-661df318",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42342",
  "title": "Compra sin prisas y con cabeza cómo usar la IA para comprar de forma segura este Black Friday",
  "url": "https://cybersecuritynews.es/compra-sin-prisas-y-con-cabeza-como-usar-la-ia-para-comprar-de-forma-segura-este-black-friday/",
  "published_at": "2025-11-18T22:00:00+00:00",
  "fetched_at": "2025-11-19T11:19:13.733640+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Con el Black Friday a la vuelta de la esquina, los consumidores recurrirán cada vez más a la Inteligencia Artificial. Desde asistentes personalizados hasta probadores virtuales, la IA promete una experiencia de compra más fluida y eficiente. Los datos son claros: los consumidores están listos para dejar que la IA tome el control. Según una encuesta de Kaspersky, el 72 % de los encuestados ha utilizado herramientas de IA, y un 30 % las ha integrado ya en su rutina diaria, por ejemplo, para generar listas de la compra o planificar presupuestos. Esta tendencia promete dispararse durante la temporada navideña. Cada vez más consumidores están integrando herramientas de Inteligencia Artificial en sus procesos de compra. Esta tecnología ya no se limita a comparadores de precios, sino que permite automatizar tareas complejas dentro de lo que se conoce como comercio agéntico. Por ejemplo, los usuarios pueden programar sistemas de IA para monitorizar productos concretos y ejecutar automáticamente la compra cuando se alcanza un precio determinado. A su vez, las grandes marcas y plataformas de comercio electrónico están incorporando IA en múltiples capas de su operativa, desde motores de precios dinámicos y gestión predictiva del inventario hasta recomendaciones personalizadas y asistentes conversacionales que permiten completar compras directamente desde entornos como ChatGPT. Pero esta comodidad también conlleva riesgos. Confiar a la IA decisiones de compra y pago puede abrir nuevas puertas a los ciberataques. Por ejemplo, los chatbots pueden ser manipulados mediante técnicas como la inyección de prompts para redirigir al usuario a webs maliciosas. En España, el INCIBE ha alertado sobre cómo los ciberdelincuentes ya están utilizando interfaces conversacionales para simular chats de soporte o atención al cliente, con el objetivo de engañar al usuario y obtener datos personales o bancarios. Si se introducen credenciales en estas páginas fraudulentas, puede producirse robo de datos o fraude financiero. A esto se suma que, durante el Black Friday, los ciberdelincuentes suelen suplantar a grandes comercios como Amazon o Walmart para enviar correos de phishing con supuestas ofertas exclusivas o premios. El año pasado, Kaspersky registró un aumento del 25 % en ciberamenazas dirigidas al sector retail justo antes del Black Friday, según su informe “Scammer Black Friday offers: Online shopping threats and dark web sales”. Ahorrar con IA sin poner en riesgo tu ciberseguridad La buena noticia es que no hace falta renunciar a las ventajas de la IA para comprar con seguridad. Basta con adoptar buenos hábitos digitales como estos: Redacta prompts con criterio: en lugar de escribir una orden genérica como “Encuentra las mejores ofertas de portátiles en Black Friday”, sé específico: “Actúa como mi asistente de compras. Encuentra tres portátiles de marcas fiables como Apple, Amazon o Dell, con una valoración mínima de 4 estrellas y más de 1.000 reseñas. Para cada uno, incluye el nombre del producto, sus características clave, el precio actual y un enlace directo a la página oficial del minorista. Solo muestra ofertas válidas para el Black Friday 2025”. Controla lo que compartes con la IA: evita dar acceso a tus datos de pago a herramientas de IA o extensiones de navegador, salvo que provengan de empresas muy consolidadas. Refuerza tus cuentas con autenticación multifactor y utiliza plataformas de pago de confianza o tarjetas de crédito, que ofrecen mejor protección contra el fraude que las de débito. Para una protección extra, usa una solución de ciberseguridad que proteja específicamente los pagos online. Revisa siempre las URL antes de introducir datos personales o bancarios: no hagas clic en enlaces de correos, mensajes o anuncios en redes sociales que no esperabas, aunque la oferta sea muy tentadora. Es mejor acceder directamente al sitio web del minorista. Para una protección real durante las compras del Black Friday, utiliza una solución de seguridad con protección antiphishing. Por ejemplo, Kaspersky ha incorporado capacidades basadas en IA a sus herramientas antiphishing para defenderte frente a amenazas cada vez más sofisticadas. Este Black Friday, la IA puede una gran aliada para encontrar los mejores chollos, pero los ciberdelincuentes también la están utilizando. Es necesario usar esta tecnología de forma responsable y seguir unas buenas prácticas de seguridad, para poder disfrutar de una experiencia de compra más cómoda, inteligente y protegida. La entrada Compra sin prisas y con cabeza cómo usar la IA para comprar de forma segura este Black Friday se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}