{
  "id": "palo-alto-networks-blog-researchcenter-paloaltonetworks-com-2025-11-18-aa8c1872",
  "source_id": "palo-alto-networks-blog-researchcenter-paloaltonetworks-com",
  "guid": "https://www.paloaltonetworks.com/blog/?p=348329",
  "title": "Prisma AIRS Integrates Microsoft Foundry for Comprehensive AI Security",
  "url": "https://www.paloaltonetworks.com/blog/2025/11/prisma-airs-integrates-azure-ai-foundry/",
  "published_at": "2025-11-18T15:59:07+00:00",
  "fetched_at": "2025-11-19T11:18:24.053055+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Securing Enterprise AI Development at the Source Enterprises are accelerating AI innovation with Microsoft Foundry, Microsoft’s unified platform for building, customizing and managing AI applications and agents. But every advancement brings new security challenges. AI applications and agents need protection from prompt injections, data leaks and unsafe outputs without slowing development. Palo Alto Networks is proud to announce the integration of Prisma® AIRS with Microsoft Foundry. Through this new integration, Prisma AIRS now enables native scanning of prompts and responses directly within Microsoft Foundry via the Prisma AIRS AI Runtime Security API. This gives developers real-time protection with extensive, high-fidelity threat detection coverage. What Is Prisma AIRS? Prisma AIRS is a comprehensive AI security platform that protects applications, models, data and agents. It provides end-to-end security across five pillars: AI Model Security, AI Posture Management, AI Red Teaming, AI Runtime Security, as well as AI Agent Security. The Prisma AIRS Runtime Security API scans prompts and model outputs to identify and block threats (i.e., prompt injection, sensitive data leakage, malicious code and URLs, toxic content) while remaining model-agnostic and easy to integrate. Microsoft Foundry Is Your AI App Factory Microsoft Foundry unifies agents, models and tools under one interface. Teams can build AI apps and agents on an enterprise-grade platform with access to thousands of models from Microsoft, OpenAI, Meta, Mistral, DeepSeek and others. Sarah Bird, Chief Product Officer, Responsible AI, Microsoft: Trust is the foundation of AI adoption. Our collaboration with Palo Alto Networks brings model agnostic, policy-driven protection into Microsoft Foundry so teams can ship innovation with confidence at enterprise scale – combining Microsoft’s platform strength with Palo Alto Networks broad and deep AI threat detection. Native Security Integration Is Better Together You can now natively scan prompts and model responses in Microsoft Foundry via the Prisma AIRS API. This integration delivers real-time threat detection as developers build, test and deploy AI applications, providing instant protection: Prompt Injections: Blocks attempts to manipulate AI behavior through malicious prompts. Sensitive Data Loss: Prevents PII, credentials and confidential information from being exposed. Malicious Code &amp; URLs: Detects and stops harmful code or dangerous links in outputs. Toxic Content: Identifies and blocks offensive or inappropriate responses. Custom Topics: Defines and filters specific content categories relevant to your organizational policies. Agents &amp; MCP: Inspect LLM assistant output for risks like sensitive data and malicious code that could be sent to downstream agent tools Ian Swanson, AI Security Leader, Palo Alto Networks: AI must be safe, trusted and secure. Security has to be built into the way AI systems are created and operated. With the Prisma AIRS API integrated into Microsoft Foundry, organizations gain real time protection against AI-specific threats, including prompt injection, data exposure and malicious code, while enabling teams to innovate with confidence. What sets this integration apart is Palo Alto Networks Threat Detection coverage. Why it matters: Enterprises get production-grade AI security by default, cutting breach risk, enabling compliance needs while preserving developer velocity. Prisma AIRS delivers comprehensive security across all AI-specific threats while maintaining the flexibility and ease of use that developers need. With a simple API integration, you can embed enterprise-grade AI security directly into your Microsoft Foundry workflows. Microsoft and Palo Alto Networks share a commitment to helping organizations innovate with AI in a secure and trusted way. By combining Microsoft Foundry’s powerful development platform with Prisma AIRS' comprehensive threat detection, we’re empowering enterprises to deploy AI applications with confidence. Together, we’re better. Get Started Today The Prisma AIRS integration with Microsoft Foundry is available now as part of our early access program. To get started protecting your AI applications with industry-leading security, contact your Palo Alto Networks Account team to be added to the early access. Stay tuned for more updates and make Prisma AIRS the foundation of your AI security strategy. The post Prisma AIRS Integrates Microsoft Foundry for Comprehensive AI Security appeared first on Palo Alto Networks Blog.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}