{
  "id": "security-affairs-securityaffairs-co-2025-11-18-80001d94",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184757",
  "title": "Dutch police takes down bulletproof hosting hub linked to 80+ cybercrime cases",
  "url": "https://securityaffairs.com/184757/cyber-crime/dutch-police-takes-down-bulletproof-hosting-hub-linked-to-80-cybercrime-cases.html",
  "published_at": "2025-11-18T06:23:10+00:00",
  "fetched_at": "2025-11-18T11:22:03.517223+00:00Z",
  "status": "processed",
  "content": {
    "raw": "Dutch police seized 250 servers running a bulletproof hosting service tied to cybercriminals and linked to over 80 investigations since 2022. Dutch police Politie, seized 250 servers running an unnamed bulletproof hosting service used solely by cybercriminals. Active since 2022, it appeared in over 80 cybercrime investigations. &#8220;In an investigation into a rogue hosting company, the East Netherlands cybercrime team seized thousands of servers.&#8221; reads the press release published by Politie. &#8220;According to the police, the hosting company is used solely for criminal activities. Research shows that the company has appeared in more than 80 investigations into cybercrimes at home and abroad since 2022 and has recently continued to be used for criminal activities.&#8221; Dutch police took thousands of virtual servers offline. The move blocks criminal use and enables further investigation. Bulletproof hosting is a hosting service that deliberately ignores or resists abuse reports, takedown requests, and law-enforcement orders. It is designed to let customers run illegal or harmful operations with minimal risk of being shut down. Typical criminal uses include: Malware command-and-control servers Phishing and scam sites Ransomware infrastructure Botnet control panels Data-leak or extortion sites These providers often operate in jurisdictions with weak enforcement or frequently move their infrastructure to avoid detection. The seizure enables investigators to probe the servers’ criminal activity and prevents the hosting service from being used for further cybercrime. While Dutch authorities have not named the seized bulletproof hosting provider, sources told BleepingComputer that Dutch police took servers from a The Hague datacenter used by CrazyRDP, now offline. CrazyRDP offered anonymous VPS/RDP services with no-KYC and no logs, and was often recommended by threat actors as bulletproof hosting. The Telegram channel deleted all its posts and moved to a new one, where users said they’d lost many servers and feared an exit scam. Support first blamed datacenter issues but then stopped giving updates, leaving the situation unclear. Pierluigi&nbsp;Paganini (SecurityAffairs&nbsp;–&nbsp;hacking,&nbsp;bulletproof hosting)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": 80,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": [],
    "processed_at": "2025-11-18"
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updated_at": "2025-11-18T11:22:48.425846+00:00Z"
}