{
  "id": "security-affairs-securityaffairs-co-2025-11-18-140c5b02",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184795",
  "title": "Pennsylvania Office of the Attorney General (OAG) confirms data breach after August attack",
  "url": "https://securityaffairs.com/184795/data-breach/pennsylvania-office-of-the-attorney-general-oag-confirms-data-breach-after-august-attack.html",
  "published_at": "2025-11-18T20:36:03+00:00",
  "fetched_at": "2025-11-19T11:20:58.779359+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Pennsylvania Office of the Attorney General (&#8220;OAG&#8221;) confirms a data breach following a ransomware attack by Inc Ransom group. The Pennsylvania Office of the Attorney General (&#8220;OAG&#8221;) confirmed a data breach following a ransomware attack attributed to Inc Ransom group. However, the organization did not share details about the security breach, either the number of affected individuals. &#8220;The OAG later learned that certain files may have been accessed without authorization. The OAG reviewed which data may have been involved and learned that certain personal information was contained in some files. Again, the OAG has no evidence of the misuse, or attempted misuse, of any information that was potentially involved.&#8221; reads the media notice published by OAG. &#8220;Based on the OAG&#8217;s review of the data involved, for some individuals the information involved may have included name, Social Security number, and/or medical information.&#8221; The attack occurred in August and disrupted its website, email, and phone systems for about three weeks. The extortion group claimed responsibility for the security breach on September 21 and claimed the theft of 5.7 TB of sensitive data. &#8220;Pennsylvania Office of Attorney General is a law enforcement official that protects and serves the agencies of the Commonwealth and citizens of Harrisburg, Pennsylvania.5.7TB data leak, access to internal network of FBI and more&#8230;Data includes: Executive Office, Criminal Investigations PC, Financial Crimes, Security, Medicaid Fraud, Bureau of Investigative, Child Predator Section, Environmental Crimes, Retail Theft, Special Operations, Bureau of Narcotics, Word Templates, Celebrite.Contact us using report system and leave your tox for communication in case if you are interested.&#8221; reads the message published by the Inc Ransom group on its data leak site. The Inc Ransom group claimed to have gained “access to internal network of FBI”. The investigation conducted by OAG confirmed that data involved for some individuals may have included name, Social Security number, and/or medical information. The Pennsylvania OAG set up a toll-free call center (1-833-353-8060) to assist those affected, available Monday–Friday from 8 a.m. to 8 p.m. ET, excluding U.S. holidays. In September, cybersecurity researcher Kevin Beaumont reported that attackers had exploited the Citrix NetScaler vulnerability known as CitrixBleed2. &#8220;Pennsylvania Office of Attorney General has been down for several weeks from a ransomware attack.&#8221; Beaumont wrote. &#8220;They haven&#8217;t mentioned it, but I&#8217;m told the group got in via CitrixBleed 2.&#8221; Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Pennsylvania Office of the Attorney General)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}