{
  "id": "security-affairs-securityaffairs-co-2025-11-18-81e7907e",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184780",
  "title": "DoorDash data breach exposes personal info after social engineering attack",
  "url": "https://securityaffairs.com/184780/data-breach/doordash-data-breach-exposes-personal-info-after-social-engineering-attack.html",
  "published_at": "2025-11-18T15:03:53+00:00",
  "fetched_at": "2025-11-19T11:20:58.779602+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "DoorDash says a social engineering attack led to a data breach exposing names, addresses, emails, and phone numbers of users, Dashers, and merchants. U.S.-based food delivery and logistics company DoorDash announced that a social engineering attack led to a data breach. &#8220;Our team recently identified and shut down a cybersecurity incident that involved an unauthorized third party gaining access to and taking certain user information.&#8221; reads a statement published by the company on the cybersecurity incident. &#8220;Importantly, no sensitive information was accessed by the unauthorized third party and we have no indication the data has been misused for fraud or identity theft at this time.&#8221; The company confirmed that one of its employees fell victim to a social engineering scam, but it cut off the intruder’s access and alerted law enforcement. Exposed data include names, addresses, emails, and phone numbers of users, Dashers, and merchants. &#8220;DoorDash employee was recently targeted in a social engineering scam. The response team identified the incident, shut down the unauthorized party’s access, started an investigation, and referred the matter to law enforcement.&#8221; continues the statement. The company pointed out that no sensitive data like SSNs, IDs, driver’s licenses, or bank/payment details was accessed. DoorDash says there’s no evidence the stolen data has been misused, the company also confirmed that Wolt and Deliveroo customers were not affected. The U.S.-based food delivery and logistics company notified impacted users. At this time it is unclear the scope of the data breach and the number of impacted individuals. Follow me on Twitter: @securityaffairs and Facebook and Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, DoorDash)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}