{
  "id": "tenable-blog-tenable-com-2025-11-18-27644c54",
  "source_id": "tenable-blog-tenable-com",
  "guid": "https://www.tenable.com/210519",
  "title": "Tenable Cloud Vulnerability Management: Reducing Vulnerability Risk in the Cloud Era",
  "url": "https://www.tenable.com/blog/tenable-cloud-vulnerability-management-unifies-onprem-and-cloud-vulnerability-management",
  "published_at": "2025-11-18T13:45:00+00:00",
  "fetched_at": "2025-11-19T11:19:49.741677+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Tenable has launched Tenable Cloud Vulnerability Management — a powerful new offering within Tenable One — to help vulnerability management leaders identify, prioritize, and remediate exposures across multi-cloud and hybrid environments.&nbsp;Key takeawaysAgentless inventory and visibility: Achieve complete asset inventory and coverage across all existing virtual machines, virtual machine images and container images in AWS, Azure, Oracle Cloud, and GCP – without deploying agents or moving data off-account.&nbsp;Unified hybrid risk view: Consolidate your virtual machine and image security data into the Tenable One platform for a single, unified Asset Exposure Score (AES), providing instant, contextualized risk insight across your entire attack surface.&nbsp;Guided remediation and an exposure management pathway: Receive the clear remediation steps needed to close risk, laying the foundation for a holistic exposure management program tomorrow.Your vulnerability management team has spent years perfecting its program. With top-notch processes, expertise and technology, it excels at pinpointing and remediating the most critical vulnerabilities that put your on-premises assets at risk. But the cloud is, quite simply, a different beast.Your organization’s cloud-native development keeps accelerating. Cloud workloads and containers spin up and down in minutes. You know you need to extend your program so that cloud vulnerabilities don’t become a dangerous blind spot.What if you could simply extend your existing, best-in-class vulnerability management program directly into the cloud? What if you could get the foundational security you need for cloud workloads and containers?&nbsp;We heard you, and we’re pleased to say that we’ve now made it very easy for you to do this.&nbsp;That’s why we’re thrilled to announce the launch of Tenable Cloud Vulnerability Management — a new offering within our Tenable One Exposure Management Platform.&nbsp;The power of Tenable One in action – Tenable Cloud Vulnerability Management instantly unifies vulnerability risk visibility across on-premises, cloud, and hybrid environments, leveraging prioritization and unified reporting to clarify exposure.Tenable Cloud Vulnerability Management is designed to help organizations identify, prioritize, and remediate cloud vulnerabilities while supporting foundational cloud-workload protection (CWPP) practices.&nbsp;The growing cloud vulnerability gapAs organizations accelerate cloud and AI adoption, security isn’t keeping pace. These stats from the Tenable Cloud AI Risk Report 2025 illustrate how even a single exposure in AI-linked workloads can cascade into major risk:70% of cloud AI workloads contain at least one unremediated critical vulnerability — significantly higher than the 50% of non-AI workloads with the same issue.91% of organizations using Amazon SageMaker have the risky default of root access enabled in at least one notebook instance.14% of Amazon Bedrock users have at least one AI training bucket that lacks public access blocks.With AI-powered applications driving new dependencies and expanding the attack surface, organizations face a growing visibility and prioritization gap between what they can see across their on-prem and cloud environments — and what attackers can exploit. To close this gap, it’s critical to unify vulnerability management and cloud security under a single, contextual view of exposure, enabling both CISOs and security teams to act with clarity and speed.Introducing Tenable Cloud Vulnerability ManagementTenable Cloud Vulnerability Management closes that gap. It brings agentless, multi-cloud coverage to AWS, Azure, Oracle Cloud Infrastructure (OCI), and Google Cloud — offering near real-time visibility and risk assessment through native API connections within the Tenable One platform.&nbsp;&nbsp;The new Tenable Cloud Vulnerability Management license delivers an agentless inventory of all your cloud-based virtual machines, machine images (AMIs) and container images directly within the Tenable Cloud Security dashboard, with clear, guided risk remediation steps.With Tenable Cloud Vulnerability Management, vulnerability management leaders can:Gain effortless, agentless inventory coverage for your hybrid environment. Assess workloads and containers across your entire multi-cloud and hybrid environment without the operational headache. By leveraging native cloud APIs, Tenable performs the data analysis in-account, ensuring continuous, accurate coverage without deploying agents or requiring you to move sensitive data off-account for scanning.Secure containers in registries. Tenable Cloud Vulnerability Management provides comprehensive vulnerability scanning at a critical stage of the container lifecycle: registry scanning. We scan container images stored in registries — whether in managed services like AWS Elastic Container Registry (ECR) or third-party container registries. This allows you to identify and address vulnerabilities before the image is ever pulled into a live runtime environment.Gain the comprehensive, unified view of risk that modern security demands. Tenable Cloud Vulnerability Management integrates seamlessly with the Tenable One Exposure Management Platform. This integration instantly combines your new cloud findings with data from Tenable One components like Tenable Vulnerability Management (for on-prem), Identity Exposure, OT Security, and Web Application Scanning. This platform unification delivers true hybrid visibility and filters out the noise.&nbsp;This means organizations can extend their existing vulnerability management practices into the cloud without the complexity, latency, or blind spots of traditional agent-based solutions.&nbsp;Why agentless visibility changes everythingUnlike legacy vulnerability scanners, Tenable Cloud Vulnerability Management eliminates the need to deploy or maintain agents across thousands of workloads. It uses cloud-native APIs to connect to accounts, capture snapshots, and decrypt volumes as needed — providing fast, comprehensive insight into software packages, file signatures, and vulnerabilities.Without impacting the performance of production workloads, Tenable Cloud Vulnerability Management gives vulnerability management leaders:Instant onboarding across accounts and regionsIn-account data analysis for strict privacy complianceManaging and prioritizing vulnerabilities - everywhereCombined with Tenable’s Vulnerability Priority Rating (VPR) — a predictive model powered by one of the world’s most comprehensive vulnerability-intelligence databases — organizations can pinpoint which exposures matter most based on exploitability, maturity, and threat context.Visibility meets context: Start with what you need, grow as you goWith Tenable Cloud Vulnerability Management, you can start addressing critical cloud vulnerabilities today. For example, the platform can instantly reveal a live virtual machine that has a critical vulnerability (like an old OS with an unpatched zero-day) that has a known exploit and high VPR score. You can then find and remediate this high-impact issue before attackers exploit the flaw, gaining immediate protection.&nbsp;At the same time, Tenable Cloud Vulnerability Management is part of Tenable One, the Exposure Management platform, which provides a scalable path forward. It unifies visibility across IT, cloud, identity, and operational technology (OT), and enables the layering of additional capabilities – including CIEM for identity risks, DSPM for sensitive data, and more – to create a holistic continuous threat exposure management (CTEM) program without starting from scratch. Vulnerability data is no longer just a list of flaws – it’s analyzed in the context of misconfigurations, exposure, and operational risk.&nbsp;In other words, capitalize on Tenable Cloud Vulnerability Management to start protecting your cloud workloads today and gain a clear path to holistic CTEM tomorrow.Learn moreRead the Tenable Cloud AI Risk Report 2025Explore Tenable Cloud SecurityDownload the Tenable Cloud Vulnerability Management datasheet",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}