{
  "id": "bleeping-computer-2025-11-06-6a437096",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/critical-cisco-uccx-flaw-lets-hackers-run-commands-as-root/",
  "title": "Critical Cisco UCCX flaw lets attackers run commands as root",
  "url": "https://www.bleepingcomputer.com/news/security/critical-cisco-uccx-flaw-lets-hackers-run-commands-as-root/",
  "published_at": "2025-11-06T13:31:10+00:00",
  "fetched_at": "2025-11-07T11:12:24.269010+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Cisco has released security updates to patch a critical vulnerability in the Unified Contact Center Express (UCCX) software, which could enable attackers to execute commands with root privileges. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Cisco has released security updates to patch a critical vulnerability in the Unified Contact Center Express (UCCX) software, which could enable attackers to execute commands with root privileges.\nThe Cisco UCCX platform, described by the company as a \"contact center in a box,\" is a software solution for managing customer interactions in call centers, supporting up to 400 agents.\nTracked as CVE-2025-20354, this security flaw was discovered in the Java Remote Method Invocation (RMI) process of Cisco Unified CCX by security researcher Jahmel Harris, allowing unauthenticated attackers to execute arbitrary commands remotely with root permissions.\n\"This vulnerability is due to improper authentication mechanisms that are associated to specific Cisco Unified CCX features,\" Cisco explained in a Wednesday security advisory.\n\"An attacker could exploit this vulnerability by uploading a crafted file to an affected system through the Java RMI process. A successful exploit could allow the attacker to execute arbitrary commands on the underlying operating system and elevate privileges to root.\"\nYesterday, Cisco also patched a critical security flaw in the Contact Center Express (CCX) Editor application of Cisco UCCX, which allows unauthenticated attackers to remotely bypass authentication and create and execute arbitrary scripts with admin permissions.\nThis can be exploited by tricking the CCX Editor app into believing the authentication process was successful after redirecting the auth flow to a malicious server.\nIT admins are advised to upgrade their Cisco UCCX software to one of the fixed releases listed in the table below as soon as possible.\n| Cisco Unified CCX Release | First Fixed Release |\n|---|---|\n| 12.5 SU3 and earlier | 12.5 SU3 ES07 |\n| 15.0 | 15.0 ES01 |\nWhile the vulnerabilities affect Cisco Unified CCX software regardless of device configuration, the Cisco Product Security Incident Response Team (PSIRT) has yet to find evidence of publicly available exploit code or that the two critical security flaws have been exploited in the wild.\nOn Wednesday, the tech giant also warned of a high-severity vulnerability (CVE-2025-20343) impacting its Cisco Identity Services Engine (ISE) identity-based network access control and policy enforcement software. This vulnerability allows unauthenticated, remote attackers to trigger a denial-of-service (DoS) condition, causing unpatched appliances to restart unexpectedly.\nFour other security flaws in Cisco Contact Center products (CVE-2025-20374, CVE-2025-20375, CVE-2025-20376, and CVE-2025-20377) can be exploited by attackers with high-level privileges to gain root permissions, execute arbitrary commands, access sensitive information, or download arbitrary files.\nEarlier this year, Cisco addressed a Cisco ISE vulnerability that also allowed threat actors to run commands as root on vulnerable appliances, months after patching another ISE flaw that enabled root privilege escalation.\nIn September, CISA issued a new emergency directive ordering U.S. federal agencies to secure Cisco firewall devices on their networks against two flaws (CVE-2025-20333 and CVE-2025-20362) that have been exploited in zero-day attacks. Days later, the threat monitoring service Shadowserver found over 50,000 Internet-exposed Cisco ASA and FTD firewall appliances that were left unpatched.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
      "enhanced_at": 1762514249.9209251,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:17:29.921278+00:00Z"
}