{
  "id": "bleeping-computer-2025-11-06-e2b07801",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/ai-slop-ransomware-test-sneaks-on-to-vs-code-marketplace/",
  "title": "AI-Slop ransomware test sneaks on to VS Code marketplace",
  "url": "https://www.bleepingcomputer.com/news/security/ai-slop-ransomware-test-sneaks-on-to-vs-code-marketplace/",
  "published_at": "2025-11-06T21:52:47+00:00",
  "fetched_at": "2025-11-07T11:12:24.267922+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A malicious extension with basic ransomware capabilities seemingly created with the help of AI, has been published on Microsoft's official VS Code marketplace. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "A malicious extension with basic ransomware capabilities seemingly created with the help of AI, has been published on Microsoft's official VS Code marketplace.\nNamed susvsex and published by ‘suspublisher18,' the extension's malicious functionality is openly advertised in its description.\nSecure Annex researcher John Tuckner discovered susvsex and says that it is the product of “vibe coding” and is far from sophisticated.\nDespite reporting the extension and its explicit description, which discloses file theft to a remote server and encryption of all files with AES-256-CBC, Microsoft ignored Tuckner’s report and did not remove it from the VS Code registry.\nHow the ransomware extension works\nThe extension activates on any event, including on installation or when launching VS Code, initializing the ‘extension.js’ file that contains its hardcoded variables (IP, encryption keys, command-and-control address).\n“Many of these values have comments which indicate that the code was not written directly by the publisher and very likely generated through AI,” says Tuckner.\nOn activation, the extension calls a function named zipUploadAndEncrypt which checks the presence of a marker text file, and starts the encryption routine.\nIt creates a .ZIP archive of the files in the defined target directory and exfiltrates them to the hardcoded C2 address. All the files are then replaced with their encrypted versions.\nTucker found that the extension polls a private GitHub repository for commands, periodically checking an ‘index.html’ file that uses a PAT token for authentication, and tries to execute any commands there.\nBy leveraging the hardcoded PAT, the researcher could access host information and discover that the owner of the repository is likely based in Azerbaijan.\nBecause the extension is an overt threat, it may be the result of an experiment to test Microsoft’s vetting process.\nSecure Annex labels susvsex an ‘AI slop’ with its malicious actions exposed in the README file, but notes that a few tweaks would make it far more dangerous.\nBleepingComputer has contacted Microsoft about the issue, and we are waiting for their response. While susvsex was present at the time of writing this article, it was no longer available by publishing time.\nSecrets Security Cheat Sheet: From Sprawl to Control\nWhether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start.\nGet the cheat sheet and take the guesswork out of secrets management.",
      "enhanced_at": 1762514185.95479,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:25.955164+00:00Z"
}