{
  "id": "blog-crowdstrike-com-2025-11-06-481677f4",
  "source_id": "blog-crowdstrike-com",
  "guid": "https://www.crowdstrike.com/?p=177128",
  "title": "New User Experience Transforms Interaction with the Falcon Platform",
  "url": "https://www.crowdstrike.com/en-us/blog/crowdstrike-transforms-falcon-ux-charlotte-ai/",
  "published_at": "2025-11-06T11:15:42.663747+00:00",
  "fetched_at": "2025-11-06T11:15:42.666002+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Security teams face overwhelming complexity. Enterprises employ a multitude of security tools, each with its own console, siloed data, and disconnected workflows that slow investigations and increase risk. This fragmentation is especially dangerous as adversaries grow faster and smarter and pursue cross-domain attacks. According to the CrowdStrike 2025 Threat Hunting Report, cloud intrusions surged 136% in the previous 12 months and 81% of hands-on-keyboard attacks were malware-free — often relying instead on identity abuse and lateral movement.\nThis growing complexity demands a new approach. Security teams need more than access to data; they need a smooth and intuitive user experience that empowers them to gain critical insights and make decisions. At Fal.Con 2025, we unveiled the new dynamic user experience: the first AI-powered, persona-aware security console built natively for the AI era. It is now available in public preview for customers of CrowdStrike Falcon® Cloud Security and CrowdStrike Falcon® Exposure Management.1\nPowered by CrowdStrike Enterprise Graph® and CrowdStrike® Charlotte AI™, the new dynamic user experience transforms how users interact with the Falcon platform and delivers clarity, speed, and tailored workflows for every persona. It provides unified asset and risk visibility, customizable workspaces, and executive-ready reporting. The result is a native AI-driven experience that turns complexity into clarity and accelerates defense.\nA Unified View of Assets and Risk\nThe new dynamic user experience now allows teams to unify assets from hybrid and multi-cloud environments into a single view. This consolidates areas of risk into a single view so operators can rapidly identify misconfigurations, prioritize vulnerabilities, and remediate risk without switching tools or losing visibility across complex hybrid and multi-cloud environments.\nOur AI-powered experience gives teams one place to explore hybrid risk with clarity, without hopping between consoles or juggling spreadsheets. Whether tracking cloud posture drift or prioritizing CVEs across environments, it provides the context to accelerate investigations, uncover blind spots, and eliminate risk. This allows cloud security and exposure management teams to work from a shared source of truth, driving faster remediation and better alignment across functions to stop adversaries and breaches.",
      "enhanced_at": 1762514269.208104,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:17:49.208433+00:00Z"
}