{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-06-af30e573",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42286",
  "title": "S2GRUPO impulsa el Ciberescudo Nacional junto al Ministerio de Defensa",
  "url": "https://cybersecuritynews.es/s2grupo-impulsa-el-ciberescudo-nacional-junto-al-ministerio-de-defensa/",
  "published_at": "2025-11-06T22:00:00+00:00",
  "fetched_at": "2025-11-07T11:13:58.484384+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "En un contexto global en el que la seguridad y la soberanía digital se han convertido en elementos esenciales para la defensa de los Estados, S2GRUPO avanza junto al Ministerio de Defensa en la construcción del Ciberescudo Nacional, una infraestructura estratégica destinada a proteger los sistemas IT y OT de las Fuerzas Armadas y, de forma progresiva, extender su cobertura al conjunto del ciberespacio nacional. Esta semana, se ha formalizado el contrato entre el Mando Conjunto del Ciberespacio (MCCE) y S2GRUPO para desarrollar un sistema de monitorización y protección de los sistemas IT y OT de los Centros de Operaciones de Seguridad (COS) del Ejército de Tierra, la Armada y el Ejército del Aire y del Espacio. El proyecto, con una financiación de 9,3 millones de euros, contribuirá a garantizar la libertad de maniobra y la seguridad en el ciberespacio de los sistemas específicos de las Fuerzas Armadas, articulando los mecanismos necesarios para eliminar o mitigar los riesgos detectados frente a acciones ofensivas del adversario. El sistema se basará en la solución GLORIA, del Centro Criptológico Nacional (CCN) y desarrollada por S2GRUPO. Esta herramienta está cualificada con certificación ENS ALTA en la familia de Sistemas de Gestión de Eventos de Seguridad (SIEM) del Catálogo CCN-STIC 105, y proporciona capacidades avanzadas de detección, correlación y respuesta frente a ciberamenazas en entornos críticos. La solución será escalable en capacidades y alcance, acreditable en las partes que lo requieran y distribuida en varios niveles, de modo que permitirá a cada Ejército actuar en el ciberespacio de forma interoperable con el MCCE, así como con los sistemas desplegados en zonas de operaciones o en apoyo a la protección de infraestructuras críticas. En el caso de la Armada, esta tecnología se integrará con otro proyecto también adjudicado recientemente a S2GRUPO, denominado iCIAR-EM, con una financiación de 1,6 millones de euros y plazo de ejecución hasta diciembre de 2026. Este sistema permitirá monitorizar y defender los sistemas a bordo de los buques de la Armada, tanto desde las propias plataformas navales como desde el Centro de Operaciones de Ciberseguridad de la Armada (COS-AR). Además, el sistema iCIAR posibilitará la escalada de ciberincidentes al Centro de Operaciones de Ciberseguridad del MCCE y a otros Centros de Operaciones de Ciberseguridad, que vigilan y protegen las redes del Ministerio de Defensa. Ambos proyectos se sustentan en tecnología soberana desarrollada en España, y constituyen el núcleo tecnológico del futuro Ciberescudo Nacional. Este escudo digital nace con un enfoque modular, escalable y acreditable, capaz de desplegarse en múltiples niveles y operar de forma interoperable con los sistemas de defensa nacionales e internacionales. Su diseño permitirá reforzar la libertad de maniobra de las Fuerzas Armadas en el ciberespacio y elevar la capacidad de prevención, vigilancia y respuesta ante amenazas cada vez más sofisticadas y persistentes. Para S2 Grupo, esta colaboración representa un avance firme en su compromiso con la soberanía tecnológica y la autonomía estratégica nacional. El desarrollo e implantación de soluciones ciber soberanas como GLORIA, junto con sistemas navales avanzados como iCIAR, consolidan un modelo de defensa digital basado en capacidades nacionales propias, que refuerza la resiliencia del Estado y protege los intereses esenciales de la nación. Rafael Rosell, CRO de S2GRUPO, ha señalado: “La defensa del ciberespacio no es solo una cuestión tecnológica, sino una responsabilidad compartida que define nuestra capacidad para proteger la seguridad, los derechos y las libertades de todos los ciudadanos. La construcción del Ciberescudo Nacional es un hito que refuerza la autonomía tecnológica de España y demuestra que la colaboración entre Defensa e industria nacional es clave para garantizar la seguridad del Estado en la era digital.” Así, con la construcción del Ciberescudo Nacional, España avanza hacia un modelo de ciberdefensa más autónomo, robusto y soberano, en el que la colaboración público-privada y la innovación tecnológica nacional se consolidan como los pilares de la seguridad y la libertad en el ciberespacio. La entrada S2GRUPO impulsa el Ciberescudo Nacional junto al Ministerio de Defensa se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "En un contexto global en el que la seguridad y la soberanía digital se han convertido en elementos esenciales para la defensa de los Estados, S2GRUPO avanza junto al Ministerio de Defensa en la construcción del Ciberescudo Nacional, una infraestructura estratégica destinada a proteger los sistemas IT y OT de las Fuerzas Armadas y, de forma progresiva, extender su cobertura al conjunto del ciberespacio nacional.\nEsta semana, se ha formalizado el contrato entre el Mando Conjunto del Ciberespacio (MCCE) y S2GRUPO para desarrollar un sistema de monitorización y protección de los sistemas IT y OT de los Centros de Operaciones de Seguridad (COS) del Ejército de Tierra, la Armada y el Ejército del Aire y del Espacio. El proyecto, con una financiación de 9,3 millones de euros, contribuirá a garantizar la libertad de maniobra y la seguridad en el ciberespacio de los sistemas específicos de las Fuerzas Armadas, articulando los mecanismos necesarios para eliminar o mitigar los riesgos detectados frente a acciones ofensivas del adversario.\nEl sistema se basará en la solución GLORIA, del Centro Criptológico Nacional (CCN) y desarrollada por S2GRUPO. Esta herramienta está cualificada con certificación ENS ALTA en la familia de Sistemas de Gestión de Eventos de Seguridad (SIEM) del Catálogo CCN-STIC 105, y proporciona capacidades avanzadas de detección, correlación y respuesta frente a ciberamenazas en entornos críticos.\nLa solución será escalable en capacidades y alcance, acreditable en las partes que lo requieran y distribuida en varios niveles, de modo que permitirá a cada Ejército actuar en el ciberespacio de forma interoperable con el MCCE, así como con los sistemas desplegados en zonas de operaciones o en apoyo a la protección de infraestructuras críticas.\nEn el caso de la Armada, esta tecnología se integrará con otro proyecto también adjudicado recientemente a S2GRUPO, denominado iCIAR-EM, con una financiación de 1,6 millones de euros y plazo de ejecución hasta diciembre de 2026. Este sistema permitirá monitorizar y defender los sistemas a bordo de los buques de la Armada, tanto desde las propias plataformas navales como desde el Centro de Operaciones de Ciberseguridad de la Armada (COS-AR). Además, el sistema iCIAR posibilitará la escalada de ciberincidentes al Centro de Operaciones de Ciberseguridad del MCCE y a otros Centros de Operaciones de Ciberseguridad, que vigilan y protegen las redes del Ministerio de Defensa.\nAmbos proyectos se sustentan en tecnología soberana desarrollada en España, y constituyen el núcleo tecnológico del futuro Ciberescudo Nacional. Este escudo digital nace con un enfoque modular, escalable y acreditable, capaz de desplegarse en múltiples niveles y operar de forma interoperable con los sistemas de defensa nacionales e internacionales. Su diseño permitirá reforzar la libertad de maniobra de las Fuerzas Armadas en el ciberespacio y elevar la capacidad de prevención, vigilancia y respuesta ante amenazas cada vez más sofisticadas y persistentes.\nPara S2 Grupo, esta colaboración representa un avance firme en su compromiso con la soberanía tecnológica y la autonomía estratégica nacional. El desarrollo e implantación de soluciones ciber soberanas como GLORIA, junto con sistemas navales avanzados como iCIAR, consolidan un modelo de defensa digital basado en capacidades nacionales propias, que refuerza la resiliencia del Estado y protege los intereses esenciales de la nación.\nRafael Rosell, CRO de S2GRUPO, ha señalado: “La defensa del ciberespacio no es solo una cuestión tecnológica, sino una responsabilidad compartida que define nuestra capacidad para proteger la seguridad, los derechos y las libertades de todos los ciudadanos. La construcción del Ciberescudo Nacional es un hito que refuerza la autonomía tecnológica de España y demuestra que la colaboración entre Defensa e industria nacional es clave para garantizar la seguridad del Estado en la era digital.”\nAsí, con la construcción del Ciberescudo Nacional, España avanza hacia un modelo de ciberdefensa más autónomo, robusto y soberano, en el que la colaboración público-privada y la innovación tecnológica nacional se consolidan como los pilares de la seguridad y la libertad en el ciberespacio.",
      "enhanced_at": 1762514183.0534096,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:23.053751+00:00Z"
}