{
  "id": "cyberscoop-2025-11-06-a0f69b27",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86690",
  "title": "Agency that provides budget data to Congress hit with security incident",
  "url": "https://cyberscoop.com/congressional-budget-office-cybersecurity-incident/",
  "published_at": "2025-11-06T22:29:55+00:00",
  "fetched_at": "2025-11-07T11:14:24.157587+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A federal agency that supplies budget and economic information to Congress has suffered a cybersecurity incident, reportedly at the hands of a suspected foreign party. A spokesperson for the Congressional Budget Office (CBO) acknowledged the incident Thursday after The Washington Post reported that the office was hacked, with the attackers potentially accessing communications between lawmakers and researchers at the agency. “The Congressional Budget Office has identified the security incident, has taken immediate action to contain it, and has implemented additional monitoring and new security controls to further protect the agency’s systems going forward,” said the CBO spokesperson, Caitlin Emma.&nbsp; Congress established the office in 1974 to serve as a nonpartisan research organization for the legislative branch. Republicans took aim at the CBO this year when it assessed that a GOP tax and spending policy bill would add trillions to the national debt, prompting conservatives to criticize its conclusions. It’s not unprecedented for unauthorized parties to obtain access to sensitive information from congressional offices. Hackers who broke into the Library of Congress last year were able to read email correspondence with offices on Capitol Hill. And breach of a health insurance marketplace two years ago exposed the data of House staffers. The CBO says it has 275 staffers. It requested a budget of $76 million for fiscal 2026, an 8% increase. Nearly half of the increase would “address increased costs to enhance the agency’s cybersecurity and IT infrastructure; such improvements are critical to protecting sensitive data and improving the agency’s computing power for analyzing complex data sets,” according to that request. The Post reported that officials believe they caught the intrusion early. “The incident is being investigated and work for the Congress continues,” Emma said. “Like other government agencies and private sector entities, CBO occasionally faces threats to its network and continually monitors to address those threats.” Greg Otto contributed reporting to this story. The post Agency that provides budget data to Congress hit with security incident appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Agency that provides budget data to Congress hit with security incident\nA federal agency that supplies budget and economic information to Congress has suffered a cybersecurity incident, reportedly at the hands of a suspected foreign party.\nA spokesperson for the Congressional Budget Office (CBO) acknowledged the incident Thursday after The Washington Post reported that the office was hacked, with the attackers potentially accessing communications between lawmakers and researchers at the agency.\n“The Congressional Budget Office has identified the security incident, has taken immediate action to contain it, and has implemented additional monitoring and new security controls to further protect the agency’s systems going forward,” said the CBO spokesperson, Caitlin Emma.\nCongress established the office in 1974 to serve as a nonpartisan research organization for the legislative branch. Republicans took aim at the CBO this year when it assessed that a GOP tax and spending policy bill would add trillions to the national debt, prompting conservatives to criticize its conclusions.\nIt’s not unprecedented for unauthorized parties to obtain access to sensitive information from congressional offices. Hackers who broke into the Library of Congress last year were able to read email correspondence with offices on Capitol Hill. And breach of a health insurance marketplace two years ago exposed the data of House staffers.\nThe CBO says it has 275 staffers. It requested a budget of $76 million for fiscal 2026, an 8% increase. Nearly half of the increase would “address increased costs to enhance the agency’s cybersecurity and IT infrastructure; such improvements are critical to protecting sensitive data and improving the agency’s computing power for analyzing complex data sets,” according to that request.\nThe Post reported that officials believe they caught the intrusion early.\n“The incident is being investigated and work for the Congress continues,” Emma said. “Like other government agencies and private sector entities, CBO occasionally faces threats to its network and continually monitors to address those threats.”\nGreg Otto contributed reporting to this story.",
      "enhanced_at": 1762514174.919406,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:14.919728+00:00Z"
}