{
  "id": "infosecurity-magazine-2025-11-06-c81f883d",
  "source_id": "infosecurity-magazine",
  "guid": "https://www.infosecurity-magazine.com/news/i-paid-twice-phishing-campaign/",
  "title": "“I Paid Twice” Phishing Campaign Targets Booking.com",
  "url": "https://www.infosecurity-magazine.com/news/i-paid-twice-phishing-campaign/",
  "published_at": "2025-11-06T16:00:00+00:00",
  "fetched_at": "2025-11-07T11:13:19.425910+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Experts have uncovered large-scale phishing exploiting Booking.com, Airbnb and Expedia accounts, targeting hotels and customers",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "A large-scale phishing operation exploiting Booking.com partner accounts has been uncovered by cybersecurity experts\nThe latest Sekoia.io report, published today, detailed how cybercriminals compromised hotel systems and customer data through a sophisticated malware campaign active since at least April 2025.\nThe intrusion began when attackers sent malicious emails from legitimate hotel accounts or impersonated Booking.com. Each message contained a link leading victims through a redirection chain before launching the so-called ClickFix social engineering tactic.\nVictims were prompted to execute a PowerShell command that downloaded malware, ultimately infecting systems with the PureRAT remote access Trojan.\nPureRAT allows attackers to remotely control infected machines, steal credentials, capture screenshots and exfiltrate sensitive data. Its modular design enables the addition of plugins for expanded capabilities.\nAnalysts believe the malware initially targeted hotel staff to steal login credentials for booking platforms such as Booking.com, Airbnb and Expedia. These credentials were then either sold on cybercrime forums or used directly in fraudulent schemes.\nOnce in possession of partner credentials, threat actors contacted hotel guests via email or WhatsApp, claiming issues with banking verification.\nMessages included authentic booking details, increasing their credibility. Victims were directed to fake Booking.com pages designed to harvest payment information. These sites, hosted behind Cloudflare protection and linked to Russian infrastructure, mimicked legitimate layouts to avoid detection.\nSekoia.io analysts also observed an active trade in Booking.com credentials on Russian-language forums. Access details for these accounts (sold as authentication cookies or login pairs) ranged from $5 to $5,000, depending on value.\nOne user, “moderator_booking,” allegedly claimed over $20m in profits. Attackers have since expanded operations to include Agoda accounts.\nThe campaign demonstrates the growing professionalization of cybercrime targeting hospitality businesses.\n“We assess with high confidence that the client who fell victim to this fraudulent scheme paid twice for his reservation: once at the hotel and once to the cybercriminal,” Sekoia.io wrote.\n“Unveiling the adversary infrastructure revealed hundreds of malicious domains active for several months as of October 2025, demonstrating a resilient and likely profitable campaign.”\nThe firm added it continues to monitor adversary infrastructure and improve detection methods to help protect booking platforms and their customers.",
      "enhanced_at": 1762514224.836093,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:17:04.836400+00:00Z"
}