{
  "id": "latest-news-zdnet-com-2025-11-06-457c59b3",
  "source_id": "latest-news-zdnet-com",
  "guid": "0caaa7fa-d51f-4cfc-b08c-642cae0fa598",
  "title": "Can't wait for Spotify Wrapped? Now you get a weekly treat of listening stats",
  "url": "https://www.zdnet.com/article/cant-wait-for-spotify-wrapped-now-you-get-a-weekly-treat-of-listening-stats/",
  "published_at": "2025-11-06T20:19:00+00:00",
  "fetched_at": "2025-11-07T11:16:09.625926+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Spotify's newest feature gives you a mini 'Wrapped' every single week - including a custom playlist. Try it now.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Can't wait for Spotify Wrapped? Now you get a weekly treat of listening stats\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Spotify now offers a new weekly listening stats feature.\n- The feature is available for both free and Premium users.\n- You'll also receive a custom playlist tailored to your preferences.\nIf you're a fan of the annual Spotify Wrapped feature that gives you some insight into your listening habits, a new feature from the music streaming service will let you see your stats all year long.\nAlso: Spotify cracks down on AI 'slop' - these are the changes you'll see\nCalled \"listening stats,\" the feature lets you \"relive your week in music in a fun, shareable snapshot.\" It's essentially a mini version of the highly anticipated Wrapped feature that rolls around toward the end of every year, but as Spotify explains it, it gives you a snapshot of your current listening habits instead of your overall tastes.\nListening stats don't seem to be quite as in-depth as Wrapped. And, since it's very recent, you probably won't get the \"surprise\" element of the annual wrap-up, but it's still a fun glimpse into your favorite songs and artists.\nSpotify says that listening stats, available to both free and Premium users, not only show your top artists and songs from the past four weeks, but also allow you to build custom playlists inspired by what you listen to most. Additionally, every week's listening stats will include a special highlight that showcases what makes your listening unique -- a milestone such as listening minutes, a new discovery, or a fan moment.\nLike Wrapped, there's a social element as well, and you can share your stats or weekly highlights directly from the app with friends on Spotify through the new messaging feature or to Instagram, WhatsApp, and more.\nTo access your Spotify listening stats, tap your profile picture and look for the new tab. For me, it showed up under \"What's new\" and above \"Recents.\" There weren't any songs or podcasts in my stats yet, even though I've been listening, but I was encouraged to \"Listen to some tunes, then check back later for your stats.\"\nSpotify says the feature is rolling out today, so if you don't see it yet (it didn't show up for one of my coworkers), you should soon.\nAlso: The best live TV streaming services: Expert tested\nIn case you're worried, Spotify assures you that Wrapped isn't going anywhere.\nGet the morning's top stories in your inbox each day with our Tech Update newsletter.",
      "enhanced_at": 1762514197.4763982,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:37.476749+00:00Z"
}