{
  "id": "latest-news-zdnet-com-2025-11-06-db41dbdd",
  "source_id": "latest-news-zdnet-com",
  "guid": "7dfa21d9-8d4e-452d-a34d-edc3b10bf53e",
  "title": "Let Gemini make your next slide presentation for you - here's how",
  "url": "https://www.zdnet.com/article/let-gemini-make-your-next-slide-presentation-for-you-heres-how/",
  "published_at": "2025-11-06T20:46:00+00:00",
  "fetched_at": "2025-11-07T11:16:09.625444+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Struggling with your slides? Here's how Gemini's latest updates can help you polish your presentation, and who can access them.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Let Gemini make your next slide presentation for you - here's how\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Google's Canvas in Gemini can create presentations from a prompt.\n- Explain a topic or upload images for Gemini to use.\n- All Gemini users get Canvas; upgraded subscribers get more.\nIt's easy to spend more time than necessary on your Google Slides presentation's theme, images, and color schemes to make it visually appealing for your audience. If you want to save more time, Gemini Canvas's new feature allows you to input a topic or source, from which it can generate appropriate themes and images. Then, you can export the generated presentation to Google Slides.\nAlso: I let Gemini Deep Research dig through my Gmail and Drive - here's what it uncovered\nCanvas also now supports LaTeX rendering on the web. Users can prepare complex documents with tables, equations, or multi-column formats, preview them in Gemini, and download the documents as PDFs. Users can also edit LaTeX in Canvas without additional editing software.\nHow it works\nUsers can head to Gemini and select Canvas from the Tools section. Then, users can input their prompt and ask Gemini to create a deck of Google Slides. Gemini can build the slides with relevant text, color palettes, images, and themes. Users can edit the slides at any time.\nAlso: Want better ChatGPT responses? Try this surprising trick, researchers say\nUsers can also ask Canvas to create outlines, drafts, and talking points to include within a slide deck, eliminating the need to ponder over a presentation.\nGemini Canvas also offers use cases for students, employees, and casual users, and allows them to turn research reports, study guides, or Gemini-generated code into interactive games, quizzes, and infographics.\nAccording to Google, Gemini Canvas can help students personalize their learning experiences by uploading study guides and generating custom quizzes. For the workplace, Google said employees can upload meeting notes or project plans to create an action plan to fast-track project completion.\nHow to access it\nCanvas is available within Google's Gemini application. To find Canvas, open Gemini and select Canvas from the Tools section. According to Google, Gemini Canvas is already available to Pro subscribers, who can also access the tool powered by the latest Gemini 2.5 Pro model. Canvas will be available to free Gemini users in the coming weeks.",
      "enhanced_at": 1762514192.6793911,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:32.679713+00:00Z"
}