{
  "id": "latest-news-zdnet-com-2025-11-06-33d320aa",
  "source_id": "latest-news-zdnet-com",
  "guid": "6ab360b4-64e9-4d96-93ba-30d83de79684",
  "title": "Get 4 free iPhone 17 or Galaxy S25 phones from T-Mobile right now - here's how",
  "url": "https://www.zdnet.com/article/get-4-free-iphone-17-or-galaxy-s25-phones-from-t-mobile-right-now-heres-how/",
  "published_at": "2025-11-06T21:25:39+00:00",
  "fetched_at": "2025-11-07T11:16:09.625197+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Sign up for T-Mobile's Essentials plan for just $25 per line and get four free phones, with no trade-in required. Here are all the details.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nGet 4 free iPhone 17 or Galaxy S25 phones from T-Mobile right now - here's how\nFollow ZDNET: Add us as a preferred source on Google.\nIf you're a Verizon or AT&T customer looking to make a change, T-Mobile has an early holiday deal for you: New customers who make the switch can get four free iPhone 17 or Samsung Galaxy S25 phones with no trade-in required, with each line starting at $25 per month. That means a family of four would pay $100 per month for T-Mobile's service, with no cost for the phones themselves.\nAlso: The best Black Friday deals live now\nTo take advantage of this deal, you need to sign up for a T-Mobile Essentials plan (the lowest-tier plan offered) for $100 per month for the four phone lines (plus taxes and fees), with AutoPay turned on. The Essentials plan includes unlimited talk and text, and 50GB of premium data. There's also a device connection charge of up to $35 per line.\nThe good news is, if you're keeping your old phones, you can potentially sell those on your own to help defray those costs.\nT-Mobile is running several other early Black Friday offers, including getting a free iPhone 17 Pro (or up to $1,100 off any iPhone 17 model or iPhone Air) with an eligible trade-in on the Experience Beyond plan, $1,000 off any new iPhone with no trade-in when switching to the Experience Beyond plan, and a free iPhone 17 (or up to $830 off any new iPhone model) with trade-in on the Experience More plan.\nIf you're looking at new iPads or Apple Watches, T-Mobile is offering 50% off an iPad when you add a tablet line on a qualifying plan, or the Apple Watch SE 3 discounted to $99 or $300 off another Apple Watch when you add a watch line.\nDon't miss the chance to get four free iPhones or Galaxy S25 phones from T-Mobile right now.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.\nHow I rated this deal\nWhile deals for \"free\" phones are never completely free, this T-Mobile offer is a strong one -- getting four new phones without a trade-in required and no monthly fee outside of the service charge is a solid deal. If you've been thinking of moving your family over to T-Mobile and want to upgrade your phones, this is a great time to do so.\nWhen will this deal expire?\nT-Mobile doesn't have an end date for this offer listed, so we're expecting to see it likely through the holiday season. The site does specify that the offers are for a limited time and subject to change.\nDeals are subject to sell out or expire anytime, though ZDNET remains committed to finding, sharing, and updating the best product deals for you to score the best savings. Our team of experts regularly checks in on the deals we share to ensure they are still live and obtainable. We're sorry if you've missed out on this deal, but don't fret -- we're constantly finding new chances to save and sharing them with you at ZDNET.com.\nHow do we rate deals at ZDNET?\nWe aim to deliver the most accurate advice to help you shop smarter. ZDNET offers 33 years of experience, 30 hands-on product reviewers, and 10,000 square feet of lab space to ensure we bring you the best of tech.\nIn 2025, we refined our approach to deals, developing a measurable system for sharing savings with readers like you. Our editor's deal rating badges are affixed to most of our deal content, making it easy to interpret our expertise to help you make the best purchase decision.\nAt the core of this approach is a percentage-off-based system to classify savings offered on top-tech products, combined with a sliding-scale system based on our team members' expertise and several factors like frequency, brand or product recognition, and more. The result? Hand-crafted deals chosen specifically for ZDNET readers like you, fully backed by our experts.",
      "enhanced_at": 1762514188.2928283,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:28.293180+00:00Z"
}