{
  "id": "latest-news-zdnet-com-2025-11-06-60d22d65",
  "source_id": "latest-news-zdnet-com",
  "guid": "c0cc4799-57e0-47e0-b815-f6fd88f65621",
  "title": "Why even a US tech giant is launching 'sovereign support' for Europe now",
  "url": "https://www.zdnet.com/article/why-even-a-us-tech-giant-is-launching-sovereign-support-for-europe-now/",
  "published_at": "2025-11-06T20:23:00+00:00",
  "fetched_at": "2025-11-07T11:16:09.625686+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Red Hat's new offering comes in response to a broader trend sweeping Europe.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Why even a US tech giant is launching 'sovereign support' for Europe now\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- There's a growing push for digital sovereignty in Europe.\n- Red Hat has become the first US company to meet that need.\n- Its new \"Sovereign Support\" offering will be available in 2026.\nOver the past few months, digital sovereignty has become a significant concern for European organizations that are increasingly distrustful of American tech companies, particularly Microsoft. Proof-positive that this is now a big deal: Red Hat has become the first US company to announce its own EU-specific program, Red Hat Confirmed Sovereign Support (RHCSS). This initiative ensures critical IT operations remain under EU control.\nAlso: Europe's plan to ditch US tech giants is built on open source - and it's gaining steam\nRHCSS is designed to address the desire of European technology leaders to reduce their reliance on non-EU technology providers and strengthen control over data, technology, and operations. This localized model not only addresses regulatory compliance but also insulates organizations from shifting geopolitical pressures and enhances operational resilience.\nKey features of RHCSS include 24/7 in-region technical assistance, a verified EU-citizen support workforce, and a strong ecosystem of over 500 EU cloud partners. By anchoring its support structure within Europe, Red Hat aims to empower organizations to achieve greater autonomy, supply chain transparency, and jurisdictional security as they modernize their IT environments, including cloud and AI infrastructures, in accordance with strict EU regulations.\nMoreover, European-based managers will manage RHCSS technical support. Its technology platform will consist of Red Hat Enterprise Linux (RHEL) and its broader open hybrid cloud and AI portfolios. This will enable organizations to deploy, run, and maintain both current and future IT deployments independently across any sovereign cloud environment.\nAs Hans Roth, Red Hat's senior VP & general manager of EMEA, said, \"Red Hat is making a clear, demonstrable investment in European digital sovereignty. European organizations require control over their infrastructure, and that control must start with the people who support it. With Red Hat Confirmed Sovereign Support, we are directly addressing this demand by delivering an EU-citizen-driven support team and workflow for our enterprise open source solutions.\"\nAlso: Enterprises are not prepared for a world of malicious AI agents\nThe new service is in response to a broader trend. Rival Linux vendors such as SUSE have also introduced sovereign support offerings focused on EU-based personnel and infrastructure. This reflects consistent market feedback from regulated sectors, such as finance, telecommunications, and public agencies, which must meet new requirements under rules like the EU Artificial Intelligence Act, the Digital Services Act, and the Data Act.\nNumerous EU government agencies have switched from Microsoft software and services to open-source solutions in the last few months. This movement includes the German state of Schleswig-Holstein, which abandoned Exchange and Outlook for open-source programs. Other agencies that have taken the same path away from Microsoft include the Austrian military, Danish government organizations, and the French city of Lyon.\n\"The only credible path to digital sovereignty is through open source,\" said Chris Wright, Red Hat's CTO and senior vice president of global engineering, in a statement. \"Our new offering provides an open, transparent, and auditable foundation, paired with local expertise, to help customers control their technology destiny\".\nAlso: SUSE Enterprise Linux 16 is here, and its killer feature is digital sovereignty\nRed Hat confirmed Sovereign Support will become available in early 2026. The company notes that the move builds on its decade-plus experience delivering region-specific support solutions for customers in highly regulated sectors, underscoring a broader commitment to European digital autonomy and resilience.\nGet the morning's top stories in your inbox each day with our Tech Update newsletter.",
      "enhanced_at": 1762514195.64636,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:35.646690+00:00Z"
}