{
  "id": "latest-news-zdnet-com-2025-11-06-d9086c12",
  "source_id": "latest-news-zdnet-com",
  "guid": "94cd4675-19ab-4b6b-a343-a08de1c4fae7",
  "title": "One of the best Apple Watches you can buy isn't Apple's newest (but it's 30% off)",
  "url": "https://www.zdnet.com/article/one-of-the-best-apple-watches-you-can-buy-isnt-apples-newest-but-its-30-off/",
  "published_at": "2025-11-06T22:00:17+00:00",
  "fetched_at": "2025-11-07T11:16:09.624920+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Apple Watch Series 10 might be last year's model, but its specs prove it's basically as capable as the Series 11. The main difference? It's $120 off.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nOne of the best Apple Watches you can buy isn't Apple's newest (but it's 30% off)\nFollow ZDNET: Add us as a preferred source on Google.\nBack in September, Apple unveiled a new base model Series 11, the affordable SE 3, and a luxurious and rugged Ultra 3. While the Series 11 and Ultra 3 received standout features including Hypertension Detection, Emergency SOS via satellite, increased battery life, and Sleep Scores, older smartwatches also got a facelift following the new product debut.\nThanks to WatchOS 26, Apple Watches Series 9 and later and Ultra 2 and later got the same software as the latest lineup.\nAlso: Our favorite early Black Friday deals\nSo, what does that mean for you? It means that if you are eyeing a new Apple smartwatch this Black Friday, you might not actually have to buy the latest one at the highest price. In fact, Apple Watch Series 10, the one-year-old base model smartwatch is equally, if not better a buy than the SE 3 (or maybe even the Series 11). As early holiday deals begin to roll in, Amazon and other retailers might cut the price of the Series 10 down even further (it's on sale for $280 right now, down $120 from its original price), making an even greater case for buying this smartwatch over its newer siblings.\nLet's get into why.\nThe Series 11 and Series 10 are built with the same exact form factor. Apple told me that in creating the new Series 11, it used the same build as the Series 10. It's just as thin and light, and the case is exactly the same.\nAlso: The Apple Watch SE 3 just got its first discount - here's where to buy one\nThe Series 11 also has the same S10 chip as the Series 10, so you aren't getting any more advanced chip hardware when you opt for the newer device. The only real difference in hardware is the battery life -- the Series 11 gets six more hours than the Series 10, thanks to battery reconfiguration the Apple Watch team performed on the device.\nThat difference in battery life is the only real differentiator, in my eyes, between the Series 10 and Series 11. Of course, it's a great upgrade that Apple decided to make with its device, and people will surely buy the Series 11 over the 10 because of that. In fact, I've been loving my Series 11 because of how long its battery lasts (I wear it to sleep and throughout the day). But if you aren't someone who plans to wear their smartwatch 24/7 or if you are always on top of device charging, you might not need a 24-hour battery life. So, you should buy the Series 10. 100%.\nAlso: Which Apple Watch should you buy? I tested every model\nHere are a few new features the Series 10 gets, thanks to its software update (that the Series 11 already has). Apple's new FDA-cleared Hypertension Detection (that the new Apple Watch SE 3 doesn't have), Sleep Scores, Wrist Flick Gesture for declining messages or calls, and Workout Buddy on the Fitness app.\nWhen the three new watches came out, I wrote that I was impressed by the SE 3 simply because of its affordable existence. At $200 on sale right now, the SE 3 gets the S10 chip, Sleep Scores, and an 18-hour battery life. I also added that this spec lineup mirrored the Series 10 heavily. The difference between the Series 10, which is currently discounted at $280 and the SE 3 that's going for $200 out the gate, is that the Series 10 gets Hypertension Detection and the full suite of health features, including blood oxygen monitoring and ECG. The SE 3 doesn't.\nAlso: Which Apple Watch should you buy in 2025? My verdict on the most disputed model\nSo if you are buying a smartwatch for its slate of health-tracking features, especially if you are an older person looking to keep a careful eye on your health stats, I'm going to recommend the Series 10 over the SE 3, and the Series 11 over the Series 10 (only if you want more battery life).\nThe watch is also on sale at Walmart for $299. Best Buy's prices don't compete with either Amazon or Walmart at the moment.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.\nHow I rated this deal\nThe Apple Watch Series 10 is 30% off right now. It's becoming a rarer deal, so I'm rating this one a 5/5. Plus, as stock dwindles of this older model, it's a great time to scoop up this smart wearable with decent savings.\nWhen will this deal expire?\nDeals are subject to sell out or expire anytime, though ZDNET remains committed to finding, sharing, and updating the best product deals for you to score the best savings. Our team of experts regularly checks in on the deals we share to ensure they are still live and obtainable. We're sorry if you've missed out on this deal, but don't fret -- we're constantly finding new chances to save and sharing them with you at ZDNET.com.\nHow do we rate deals at ZDNET?\nWe aim to deliver the most accurate advice to help you shop smarter. ZDNET offers 33 years of experience, 30 hands-on product reviewers, and 10,000 square feet of lab space to ensure we bring you the best of tech.\nIn 2025, we refined our approach to deals, developing a measurable system for sharing savings with readers like you. Our editor's deal rating badges are affixed to most of our deal content, making it easy to interpret our expertise to help you make the best purchase decision.\nAt the core of this approach is a percentage-off-based system to classify savings offered on top-tech products, combined with a sliding-scale system based on our team members' expertise and several factors like frequency, brand or product recognition, and more. The result? Hand-crafted deals chosen specifically for ZDNET readers like you, fully backed by our experts.",
      "enhanced_at": 1762514180.0005934,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:20.000939+00:00Z"
}