{
  "id": "latest-news-zdnet-com-2025-11-06-6f00e3c8",
  "source_id": "latest-news-zdnet-com",
  "guid": "fe675e70-2f68-41cf-ae51-b7019c47c8e2",
  "title": "Verizon will give you a free Nintendo Switch right now - here's how",
  "url": "https://www.zdnet.com/article/verizon-will-give-you-a-free-nintendo-switch-right-now-heres-how/",
  "published_at": "2025-11-06T20:09:25+00:00",
  "fetched_at": "2025-11-07T11:16:09.626184+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Sign up for a Verizon internet plan and choose between a free Nintendo Switch, Samsung TV, or Samsung tablet with this early Black Friday deal.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nGet a free Nintendo Switch when you sign up for a Verizon home internet plan - here's how\nFollow ZDNET: Add us as a preferred source on Google.\nLooking to upgrade your home internet service? Right now, when you sign up for a Verizon Fios, 5G Home Ultimate, or LTE Home Plus internet plan, you'll get a free Nintendo Switch console and a five-year price lock guarantee. Already have one? You can also choose between a Samsung Galaxy Tab S10 FE 5G tablet or 43-inch Samsung Q7F TV.\nAlso: The best Nintendo Switch deals ahead of Black Friday\nVerizon's Fios home internet uses a fiber-optic cable network to provide fast and reliable service with plans ranging from 300 Mbps to 2 Gig download speeds. This means you'll be able to connect every device in your home for streaming, gaming, and browsing the web without the risk of causing a bottleneck or slowdown. The 5G Home Ultimate plan offers an unlimited data cap as well as the fastest 5G internet speeds in your area. If neither Fios nor the 5G services are available where you live, the 4G LTE Home Plus plan offers basic home internet with speeds up to 50 Mbps.\nAlso: The best Black Friday gaming PC deals live now\nTo get your free Nintendo Switch, new customers must select the a Fios, 5G Home Ultimate, or LTE Home Plus internet plan, which start at $35 per month. Accounts also have to be in good standing for at least 14 days, and Verizon reserves the right to charge the full retail price for the Switch console if the account is cancelled within 180 days.\nIf you already have a Nintendo Switch, or aren't a gamer, Verizon has options for a free Samsung Galaxy Tab S10 FE 5G tablet or 43-inch Samsung Q7F TV. With a limit of one console/tablet/TV per Verizon account as well as a limited supply of Nintendo Switch devices, you won't want to wait to take advantage of this deal.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.\nHow I rated this deal\nWith both a free Nintendo Switch console and up to a five-year price lock guarantee, this Verizon Fios home internet deal is one of the better bundles I've seen. Not only will you get one of the hottest gaming consoles ever released, but you'll also be able to lock in special pricing for up to 60 months. And if you already have a Nintendo Switch or aren't much of a gamer, you can choose either a free 43-inch Samsung Q7F TV or Samsung Galaxy Tab S10 FE 5G tablet.\nWhen will this deal expire?\nVerizon is offering a free Nintendo Switch console when you sign up for a Fios 2 Gig, Fios 1 Gig, 5G Home Ultimate, or LTE Home Plus service until Nov. 25, 2025. However, with such a popular gaming console, supplies may run out well before the official end date.\nHow do we rate deals at ZDNET?\nWe aim to deliver the most accurate advice to help you shop smarter. ZDNET offers 33 years of experience, 30 hands-on product reviewers, and 10,000 square feet of lab space to ensure we bring you the best of tech.\nIn 2025, we refined our approach to deals, developing a measurable system for sharing savings with readers like you. Our editor's deal rating badges are affixed to most of our deal content, making it easy to interpret our expertise to help you make the best purchase decision.\nAt the core of this approach is a percentage-off-based system to classify savings offered on top-tech products, combined with a sliding-scale system based on our team members' expertise and several factors like frequency, brand or product recognition, and more. The result? Hand-crafted deals chosen specifically for ZDNET readers like you, fully backed by our experts.",
      "enhanced_at": 1762514198.6136758,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:38.614079+00:00Z"
}