{
  "id": "tenable-blog-tenable-com-2025-11-06-970ee1cf",
  "source_id": "tenable-blog-tenable-com",
  "guid": "https://www.tenable.com/210507",
  "title": "What's New in Tenable Cloud Security: Enhanced Visibility, Prioritization, and Navigation",
  "url": "https://www.tenable.com/blog/whats-new-in-tenable-cloud-security-enhanced-visibility-prioritization-and-navigation",
  "published_at": "2025-11-06T16:00:00+00:00",
  "fetched_at": "2025-11-07T11:14:35.791702+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "We have enhanced our Tenable Cloud Security CNAPP product to give you greater visibility, smarter prioritization, and a more streamlined user experience.Key takeawaysTenable has improved our CNAPP by streamlining its navigation, making reports more customizable, and boosting visibility with a new \"TV mode\".&nbsp;Cloud workload protection has been enhanced with a more efficient Vulnerability Priority Rating (VPR) and granular Kubernetes vulnerability mapping.&nbsp;New identity and access management (IAM) features and just-in-time (JIT) updates simplify the enforcement of least-privilege policies.The Tenable Cloud Security team is always hard at work to ensure our cloud-native application protection platform (CNAPP) has all the capabilities you need to secure your multi-cloud environment.&nbsp;In this blog, we’ll outline our latest round of enhancements, focused on providing greater visibility, smarter prioritization, and a more streamlined user experience. Read on to get all the details.A more intuitive and efficient platformWe're excited to introduce these significant usability and reporting enhancements to the Tenable Cloud Security CNAPP:Streamlined console navigation: We've completely redesigned the console navigation menu for a more intuitive and efficient user experience. This major update helps you find the insights you need faster.Customizable inventory reports: You can now customize your inventory reports by selecting specific columns to include. This allows you to create more focused and efficient reports with just the information you need for expedited decision-making.&nbsp;&nbsp;TV mode: For continuous, real-time operational display and broad visibility of your security status, you can now view any dashboard in a full-screen, distraction-free \"TV mode.\"&nbsp;These updates are all about providing more context and value, allowing you to see and act on your security data more efficiently with intuitive navigation, tailored reports, and always-on visibility.Enhanced cloud workload protection (CWP)We've made significant strides in our cloud workload protection capabilities to provide you with more precise, risk-contextualized visibility and prioritization:Enhanced Vulnerability Priority Rating (VPR): Our enhanced VPR is now twice as efficient, enabling your teams to focus on the 1.6% of vulnerabilities that pose a real risk, sharpening your prioritization efforts.Improved coverage and accuracy: We've improved vulnerability detection accuracy by adding scoped npm packages for better visibility into workloads running Node.js and by no longer flagging unused kernel versions in Linux workloads.Granular Kubernetes vulnerability management: You can now directly map vulnerability findings in container images to specific Kubernetes workloads, which clarifies risk attribution and streamlines remediation.Advanced identity and access management (IAM)Identity-related issues are a top concern in cloud security. We're introducing new features to help you establish a pervasive and frictionless least-privilege posture:Configure trusted vendors: You can now mark external vendors as trusted users to reduce non-critical alerts about them. This helps focus your monitoring and toxic-combination analysis on truly risky identity exposures.Automated remediation of unused SSO permissions: You can now quickly identify and remove inactive single sign-on (SSO) groups or users with a single click to streamline your process of eliminating dormant roles and their permissions.Streamlined just-in-time (JIT) access: We’ve enhanced our Slack support with key actions from the JIT Portal, including self-revoking active sessions and submitting recurring access requests. These updates streamline the adoption of least-privilege policies.&nbsp;These new features in Tenable Cloud Security are designed to empower you to work faster and smarter. By providing a more intuitive platform, enhancing workload protection, and offering advanced IAM and JIT capabilities, we're helping you to stay ahead of evolving cloud threats and proactively secure your multi-cloud environment.New cloud security use cases and research from TenableCheck out these new cloud security resources we’ve recently published:&nbsp;Four common uses for Tenable Cloud Security:Ecosystem view of riskComplete cloud lifecycle visibilityCloud misconfiguration identification and remediationAchieve least privilegeRecent cloud security research:Gemini Trifecta: Read about the three (now-remediated) vulnerabilities Tenable Research discovered within Google’s Gemini AI assistant suite.A new insight brief: Explore key observations on complexity gleaned from our recent “State of the Cloud &amp; AI Security” report.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "What's New in Tenable Cloud Security: Enhanced Visibility, Prioritization, and Navigation\nWe have enhanced our Tenable Cloud Security CNAPP product to give you greater visibility, smarter prioritization, and a more streamlined user experience.\nKey takeaways\n- Tenable has improved our CNAPP by streamlining its navigation, making reports more customizable, and boosting visibility with a new \"TV mode\".\n- Cloud workload protection has been enhanced with a more efficient Vulnerability Priority Rating (VPR) and granular Kubernetes vulnerability mapping.\n- New identity and access management (IAM) features and just-in-time (JIT) updates simplify the enforcement of least-privilege policies.\nThe Tenable Cloud Security team is always hard at work to ensure our cloud-native application protection platform (CNAPP) has all the capabilities you need to secure your multi-cloud environment.\nIn this blog, we’ll outline our latest round of enhancements, focused on providing greater visibility, smarter prioritization, and a more streamlined user experience. Read on to get all the details.\nA more intuitive and efficient platform\nWe're excited to introduce these significant usability and reporting enhancements to the Tenable Cloud Security CNAPP:\n- Streamlined console navigation: We've completely redesigned the console navigation menu for a more intuitive and efficient user experience. This major update helps you find the insights you need faster.\n- Customizable inventory reports: You can now customize your inventory reports by selecting specific columns to include. This allows you to create more focused and efficient reports with just the information you need for expedited decision-making.\n- TV mode: For continuous, real-time operational display and broad visibility of your security status, you can now view any dashboard in a full-screen, distraction-free \"TV mode.\"\nThese updates are all about providing more context and value, allowing you to see and act on your security data more efficiently with intuitive navigation, tailored reports, and always-on visibility.\nEnhanced cloud workload protection (CWP)\nWe've made significant strides in our cloud workload protection capabilities to provide you with more precise, risk-contextualized visibility and prioritization:\n- Enhanced Vulnerability Priority Rating (VPR): Our enhanced VPR is now twice as efficient, enabling your teams to focus on the 1.6% of vulnerabilities that pose a real risk, sharpening your prioritization efforts.\n- Improved coverage and accuracy: We've improved vulnerability detection accuracy by adding scoped npm packages for better visibility into workloads running Node.js and by no longer flagging unused kernel versions in Linux workloads.\n- Granular Kubernetes vulnerability management: You can now directly map vulnerability findings in container images to specific Kubernetes workloads, which clarifies risk attribution and streamlines remediation.\nAdvanced identity and access management (IAM)\nIdentity-related issues are a top concern in cloud security. We're introducing new features to help you establish a pervasive and frictionless least-privilege posture:\n- Configure trusted vendors: You can now mark external vendors as trusted users to reduce non-critical alerts about them. This helps focus your monitoring and toxic-combination analysis on truly risky identity exposures.\n- Automated remediation of unused SSO permissions: You can now quickly identify and remove inactive single sign-on (SSO) groups or users with a single click to streamline your process of eliminating dormant roles and their permissions.\n- Streamlined just-in-time (JIT) access: We’ve enhanced our Slack support with key actions from the JIT Portal, including self-revoking active sessions and submitting recurring access requests. These updates streamline the adoption of least-privilege policies.\nThese new features in Tenable Cloud Security are designed to empower you to work faster and smarter. By providing a more intuitive platform, enhancing workload protection, and offering advanced IAM and JIT capabilities, we're helping you to stay ahead of evolving cloud threats and proactively secure your multi-cloud environment.\nNew cloud security use cases and research from Tenable\nCheck out these new cloud security resources we’ve recently published:\n- Four common uses for Tenable Cloud Security:\n- Recent cloud security research:\n- Gemini Trifecta: Read about the three (now-remediated) vulnerabilities Tenable Research discovered within Google’s Gemini AI assistant suite.\n- A new insight brief: Explore key observations on complexity gleaned from our recent “State of the Cloud & AI Security” report.\n- Cloud",
      "enhanced_at": 1762514221.927188,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:17:01.927532+00:00Z"
}