{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-06-8bbe9064",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/eu-parliament-committee-votes-europol-data-sharing-agreement",
  "title": "EU Parliament committee votes to advance controversial Europol data sharing proposal",
  "url": "https://therecord.media/eu-parliament-committee-votes-europol-data-sharing-agreement",
  "published_at": "2025-11-06T17:36:00+00:00",
  "fetched_at": "2025-11-07T11:15:09.851253+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Privacy and civil liberties advocates have decried the proposed expansion for how it will allegedly facilitate mass surveillance and large scale data privacy violations.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "EU Parliament committee votes to advance controversial Europol data sharing proposal\nLawmakers in the European Union's Parliament on Tuesday voted to greenlight a proposal which would allow Europol to expand data sharing and biometric data collection as part of its effort to fight human trafficking and migrant smuggling.\nParliament’s Civil Liberties Committee (LIBE), which approved the package, will now send the proposal to a full plenary vote to be held later this month.\nPrivacy and civil liberties advocates have decried the proposed expansion for how it will allegedly facilitate mass surveillance and large scale data privacy violations.\nThe proposal expands data sharing between national governments and Europol and allows for more substantial processing of biometric data.\n“By voting in favour of the Europol Regulation, Members of the LIBE Committee have greenlighted the European Commission’s long-term plan to turn Europe into a digital police state,” Caterina Rodelli, EU Policy Analyst at Access Now, said in a prepared statement.\nSuzanne Smalley\nis a reporter covering privacy, disinformation and cybersecurity policy for The Record. She was previously a cybersecurity reporter at CyberScoop and Reuters. Earlier in her career Suzanne covered the Boston Police Department for the Boston Globe and two presidential campaign cycles for Newsweek. She lives in Washington with her husband and three children.",
      "enhanced_at": 1762514212.5339801,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:52.534298+00:00Z"
}