{
  "id": "the-red-canary-blog-information-security-insights-redcanary-com-2025-11-06-5740d8aa",
  "source_id": "the-red-canary-blog-information-security-insights-redcanary-com",
  "guid": "https://redcanary.com/?p=42607",
  "title": "A defender’s guide to phishing",
  "url": "https://redcanary.com/blog/threat-detection/phishing-detection/",
  "published_at": "2025-11-06T14:36:01+00:00",
  "fetched_at": "2025-11-07T11:12:22.205484+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "In the latest Detection Series webinar, CrowdStrike’s Hari Pulapaka and Lauren Lusty from the MITRE ATT&CK® team joined Red Canary’s Brian Donohue and Alex Walston to explore one of the most common and hard-to-detect initial access techniques: phishing. From email to voice to just about any kind of -ishing you can think of, our panel covers detection, prevention, and insights on new evolutions in tradecraft, including AI.\nYou can watch the full recording here or check out the clips below.\nWhat exactly do we mean by “phishing?”\nLauren kicks things off by breaking down MITRE’s official definition of phishing as both a reconnaissance and an initial tactic, categorized under the following ATT&CK techniques:\n- T1598: Phishing for Information (Enterprise)\n- T1566: Phishing (Enterprise)\n- T1535: Internal Spearphishing (Enterprise)\n- T1660: Phishing (Mobile)\nHow prevalent is phishing in enterprise environments?\nBrian shares some high-level stats about the rise in phishing campaigns in the last year, as well as insights on user reporting from Red Canary’s investigations stemming from our Managed Phishing Response offering.\nWhat are some real-world examples of phishing campaigns?\nCiting recent research from Brian Krebs, Brian shines a light on how voice phishing, or “vishing,” has become more sophisticated with AI voice technology. He also touches on one-stop-shop phishing kits, showcasing Zphisher as an example.\nWhat are some of the latest trends in phishing tradecraft?\nAlex dives into six emerging phishing trends:\n- Phishing from legit domains, or “living off trusted sites” (LOTS)\n- Adversary-in-the-middle attacks to gather credentials\n- “Scareware” phishing\n- OAuth app-based phishing\n- Malicious AI prompts\nHow do I detect phishing campaigns in my environment?\nHari lays out a comprehensive detection strategy for phishing attacks, including how to responsibly layer AI into detecting every step of the intrusion chain.\nWhat’s new in ATT&CK version 18?\nLauren closes out the hour with a cherry on top for detection engineers: ATT&CK version 18 introduces a “detection strategies” section for every technique page, providing actionable insights into data sources and fine-tuning analytics.",
      "enhanced_at": 1762514239.094157,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:17:19.094492+00:00Z"
}