{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-06-47d4b77a",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/ed-tech-company-fined-5-million-data-breach-security-practices",
  "title": "Ed tech company fined $5.1 million for poor data security practices leading to hack",
  "url": "https://therecord.media/ed-tech-company-fined-5-million-data-breach-security-practices",
  "published_at": "2025-11-06T21:01:36+00:00",
  "fetched_at": "2025-11-07T11:15:09.850641+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The ed tech firm also allegedly failed to monitor its systems for suspicious activity and did not separately secure backup and active databases.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Ed tech company fined $5.1 million for poor data security practices leading to hack\nThree state attorneys general announced Thursday that the educational technology company Illuminate Education will pay a $5.1 million fine and agree to make changes to its business to settle allegations that shoddy security practices led to a 2021 data breach.\nThe data breach exposed student names, races, coded medical conditions and whether they received special education accommodations. It impacted students in 49 states and three million in California alone.\nSeveral security failings led to the breach, according to a press release from California Attorney General Rob Bonta.\nFor example, Illuminate allegedly failed to delete the login credentials of former employees, the press release said. The hacker who obtained the private data allegedly used a former Illuminate employee’s credentials to gain access to its network.\nThe ed tech firm also allegedly failed to monitor its systems for suspicious activity and did not separately secure backup and active databases. Because the databases were not separated, the press release said, the backup databases were also compromised when the active database was breached.\nIlluminate also allegedly made false statements in its privacy policy, which told users its practices “meet or exceed the requirements of applicable federal and state law.\"\nThe firm has agreed to bolster its access control and account management practices, do real time monitoring for suspicious activity and stop storing backup databases in the same network as active ones, the press release said.\nBonta brought the action alongside Connecticut Attorney General William Tong and New York Attorney General Letitia James.\nIlluminate did not immediately respond to a request for comment.\nSuzanne Smalley\nis a reporter covering privacy, disinformation and cybersecurity policy for The Record. She was previously a cybersecurity reporter at CyberScoop and Reuters. Earlier in her career Suzanne covered the Boston Police Department for the Boston Globe and two presidential campaign cycles for Newsweek. She lives in Washington with her husband and three children.",
      "enhanced_at": 1762514190.9247136,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:16:30.925060+00:00Z"
}