{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-06-d9725b29",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/russia-sandworm-grain-wipers",
  "title": "Russia’s Sandworm hackers deploying wipers against Ukraine’s grain industry",
  "url": "https://therecord.media/russia-sandworm-grain-wipers",
  "published_at": "2025-11-06T12:53:47+00:00",
  "fetched_at": "2025-11-07T11:15:09.851731+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Russian state-backed hacking unit Sandworm has been targeting Ukraine's grain industry with wiper malware amid Moscow's ongoing efforts to undermine Kyiv's wartime economy.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Russia’s Sandworm hackers deploying wipers against Ukraine’s grain industry\nUkraine’s grain industry has become the latest target of the notorious Russian state-backed hacking unit Sandworm, amid Moscow's ongoing efforts to undermine the country’s wartime economy.\nAccording to new research from the Slovak cybersecurity firm ESET, the Kremlin-linked group deployed multiple data-wiping malware strains against Ukrainian organizations in the grain, energy, logistics, and government sectors between June and September. While wiper attacks have frequently hit Ukrainian infrastructure since Russia’s invasion, the agricultural industry — a key source of the country’s export revenue — has rarely been targeted directly.\nSandworm, which Western intelligence agencies link to Russia’s military intelligence service (GRU), is behind some of the most damaging cyberattacks in Ukraine’s history — including the 2015 power grid blackout, the 2017 NotPetya malware outbreak, and last year’s hack of major telecom provider Kyivstar.\nESET said the recent operations included two wipers, Zerolot and Sting, deployed in April against a Ukrainian university, followed by additional waves against grain and energy firms. Wiper malware is designed to permanently erase data and disrupt operations.\nThe company also linked the attacks to another hacker group, known as UAC-0099, which allegedly carried out initial intrusions before passing access to Sandworm. UAC-0099 has been active since at least 2022, targeting Ukrainian government and defense institutions in espionage campaigns, according to Ukraine’s computer emergency response team (CERT-UA).\n“These destructive attacks by Sandworm are a reminder that wipers remain a frequent tool of Russia-aligned threat actors in Ukraine,” ESET said.\nAlthough some reports suggested a shift toward espionage activities by such groups in late 2024, researchers said Sandworm has continued to conduct wiper attacks against Ukrainian entities on a regular basis since early 2025.\nUkraine’s cyber authorities have repeatedly warned that Russian threat actors, including Sandworm, often coordinate such operations with missile and drone strikes to amplify their impact.\nBeyond Ukraine, ESET noted that Russian hacking groups including RomCom and Gamaredon continue targeting European Union member states, often focusing on entities linked to Ukraine’s defense or logistics networks.\n“Even non-Ukrainian targets often present some apparent links with Ukraine and its overall war effort,” the researchers wrote, “strongly suggesting that the conflict continues to mobilize most of Russia’s intelligence attention and resources.”\nDaryna Antoniuk\nis a reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.",
      "enhanced_at": 1762514253.8975914,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:17:33.897905+00:00Z"
}