{
  "id": "the-hacker-news-feeds-feedburner-com-2025-11-06-39b4bc90",
  "source_id": "the-hacker-news-feeds-feedburner-com",
  "guid": "https://thehackernews.com/2025/11/cisco-warns-of-new-firewall-attack.html",
  "title": "Cisco Warns of New Firewall Attack Exploiting CVE-2025-20333 and CVE-2025-20362",
  "url": "https://thehackernews.com/2025/11/cisco-warns-of-new-firewall-attack.html",
  "published_at": "2025-11-06T14:58:00+00:00",
  "fetched_at": "2025-11-07T11:12:49.349172+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Cisco on Wednesday disclosed that it became aware of a new attack variant that's designed to target devices running Cisco Secure Firewall Adaptive Security Appliance (ASA) Software and Cisco Secure Firewall Threat Defense (FTD) Software releases that are susceptible to CVE-2025-20333 and CVE-2025-20362. \"This attack can cause unpatched devices to unexpectedly reload, leading to denial-of-service",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Cisco on Wednesday disclosed that it became aware of a new attack variant that's designed to target devices running Cisco Secure Firewall Adaptive Security Appliance (ASA) Software and Cisco Secure Firewall Threat Defense (FTD) Software releases that are susceptible to CVE-2025-20333 and CVE-2025-20362.\n\"This attack can cause unpatched devices to unexpectedly reload, leading to denial-of-service (DoS) conditions,\" the company said in an updated advisory, urging customers to apply the updates as soon as possible.\nBoth vulnerabilities were disclosed in late September 2025, but not before they were exploited as zero-day vulnerabilities in attacks delivering malware such as RayInitiator and LINE VIPER, according to the U.K. National Cyber Security Centre (NCSC).\nWhile successful exploitation of CVE-2025-20333 allows an attacker to execute arbitrary code as root using crafted HTTP requests, CVE-2025-20362 makes it possible to access a restricted URL without authentication.\nThe update comes as Cisco addressed two critical security flaws in Unified Contact Center Express (Unified CCX) that could permit an unauthenticated, remote attacker to upload arbitrary files, bypass authentication, execute arbitrary commands, and elevate privileges to root.\nThe networking equipment major credited security researcher Jahmel Harris for discovering and reporting the shortcomings. The vulnerabilities are listed below -\n- CVE-2025-20354 (CVSS score: 9.8) - A vulnerability in the Java Remote Method Invocation (RMI) process of Unified CCX that allows an attacker to upload arbitrary files and execute arbitrary commands with root permissions on an affected system.\n- CVE-2025-20358 (CVSS score: 9.4) - A vulnerability in the Contact Center Express (CCX) Editor application of Unified CCX that allows an attacker to bypass authentication and obtain administrative permissions to create arbitrary scripts on the underlying operating system and execute them.\nThey have been addressed in the following versions -\n- Cisco Unified CCX Release 12.5 SU3 and earlier (Fixed in 12.5 SU3 ES07)\n- Cisco Unified CCX Release 15.0 (Fixed in 15.0 ES01)\nIn addition to the two vulnerabilities, Cisco has shipped patches for a high-severity DoS bug (CVE-2025-20343, CVSS score: 8.6) in Identity Services Engine (ISE) that could allow an unauthenticated, remote attacker to cause a susceptible device to restart unexpectedly.\n\"This vulnerability is due to a logic error when processing a RADIUS access request for a MAC address that is already a rejected endpoint,\" it said. \"An attacker could exploit this vulnerability by sending a specific sequence of multiple crafted RADIUS access request messages to Cisco ISE.\"\nWhile there is no evidence that any of the three security flaws have been exploited in the wild, it's essential that users apply the updates as soon as possible for optimal protection.",
      "enhanced_at": 1762514237.11646,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-07T11:17:17.116793+00:00Z"
}