{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-10-a436e792",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42301",
  "title": "IA generativa, datos en alza y riesgos internos ponen en jaque la seguridad",
  "url": "https://cybersecuritynews.es/ia-generativa-datos-en-alza-y-riesgos-internos-ponen-en-jaque-la-seguridad/",
  "published_at": "2025-11-10T22:00:00+00:00",
  "fetched_at": "2025-11-11T11:19:12.592552+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Proofpoint, empresa de ciberseguridad y cumplimiento normativo, ha publicado su segundo informe anual Data Security Landscape en el que revela que las organizaciones continúan enfrentándose a una pérdida generalizada de datos mientras luchan por proteger la información confidencial en medio del crecimiento explosivo de los datos, la adopción de la IA y la aparición de agentes de IA en el entorno laboral. Este informe se basa en las opiniones de 1.000 profesionales de seguridad de diez países, así como en los datos de la plataforma de Proofpoint, demostrando cómo la rápida adopción de herramientas de productividad impulsadas por IA y agentes autónomos que manejan datos confidenciales está agravando el riesgo para las organizaciones. Muchas carecen de la visibilidad y los controles necesarios para gestionar este emergente “espacio de trabajo interactivo”, donde humanos y sistemas de IA trabajan estrechamente. Mientras tanto, el creciente volumen de datos ejerce una presión aún mayor sobre unos equipos de seguridad que ya se encuentran sobrecargados. “Hemos entrado en una nueva era de la seguridad de los datos donde las amenazas internas, el crecimiento incesante de los datos y el cambio impulsado por la IA están poniendo a prueba los límites de las defensas tradicionales”, apunta&nbsp;Ryan Kalember, director de estrategia de Proofpoint.&nbsp;“Las herramientas fragmentadas y la visibilidad limitada dejan a las organizaciones expuestas. El futuro de la protección de datos depende de soluciones unificadas y potenciadas por la IA que comprendan el contenido y el contexto, se adapten en tiempo real y aseguren la información tanto en la actividad humana como en la de los agentes”. Estas son algunas de las principales conclusiones globales del informe de Proofpoint: ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Las personas siguen siendo la causa principal de los incidentes de pérdida de datos: Casi seis de cada diez (58%) organizaciones atribuyen sus incidentes de pérdida de datos más significativos a empleados negligentes o contratistas externos, mientras que el 42% menciona a usuarios con acceso comprometido y el 32% a empleados malintencionados. La telemetría de Proofpoint señala, no obstante, un desequilibrio: solamente el 1% de los usuarios es responsable del 76% de los incidentes de pérdida de datos, lo que subraya la importancia de las estrategias de seguridad adaptativas basadas en el comportamiento. La frecuencia de las pérdidas de datos también continúa alarmantemente alta: los encuestados informaron un promedio de 11 incidentes al año, y algunas organizaciones experimentan varios incidentes al mes. Estos sucesos pueden tardar semanas en resolverse, lo que deja expuesta información confidencial y sobrecarga a los equipos de seguridad. ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El crecimiento y la proliferación de datos agravan el problema: Los volúmenes de datos empresariales se disparan, llevando la visibilidad y el control al límite. Más de una cuarta parte (29%) de las organizaciones vio aumentar sus datos un 30% o más durante el último año. Entre las empresas con más de 10.000 empleados, el 41% gestiona más de un petabyte de datos. Esta expansión descontrolada tiene graves consecuencias: el 46% señala la proliferación de datos en la nube y en SaaS como uno de los principales desafíos, y el 31% afirma que los datos redundantes u obsoletos representan un riesgo significativo. Los datos de la plataforma de Proofpoint corroboran esta afirmación, mostrando que el 27% del almacenamiento en la nube está abandonado con datos sin usar que incrementan los costes y amplían la superficie de ataque. ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El auge del espacio de trabajo agéntico y los nuevos riesgos de datos: A medida que las organizaciones implementan rápidamente la IA en los flujos de trabajo empresariales, esta surge como una nueva clase de riesgo interno que rivaliza con el error humano. Dos de cada cinco organizaciones citan la pérdida de datos a través de herramientas de IA generativa públicas o empresariales como una de sus principales preocupaciones, mientras que más de un tercio se preocupa por el uso de datos sensibles en el entrenamiento de la IA. Los agentes de IA, que a menudo operan como superusuarios con altos privilegios, introducen un riesgo adicional, con el 32% de las organizaciones señalando el acceso no supervisado a datos por parte de los agentes como una amenaza crítica. Las lagunas en la supervisión amplifican estos riesgos: el 44% de las organizaciones carece de visibilidad y controles suficientes sobre las herramientas de IA generativa. ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Los equipos de seguridad están bajo presión en medio de conjuntos de herramientas fragmentados: Las arquitecturas de seguridad fragmentadas continúan obstaculizando la visibilidad, la respuesta y los esfuerzos de remediación. Más de una de cada cinco organizaciones (21%) indica que resolver un incidente de pérdida de datos puede llevar entre una y cuatro semanas. Con el 64% dependiendo de seis o más proveedores de seguridad de datos, la proliferación de herramientas resultante aumenta la complejidad y agota a los equipos de seguridad ya sobrecargados. ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Un llamamiento para contar con programas de seguridad de datos unificados e impulsados por IA: Los líderes de seguridad buscan cada vez más soluciones holísticas de seguridad de datos y de riesgo interno para reducir el riesgo de seguridad y simplificar las operaciones. Dos tercios de las organizaciones (65%) ya han implementado capacidades de seguridad de datos mejoradas con IA para clasificar datos. La mitad de los encuestados considera que el mayor beneficio de una solución unificada de seguridad de datos es permitir el uso seguro y productivo de la IA, mientras que el 55% cree que reducirá el riesgo de pérdida de datos. La entrada IA generativa, datos en alza y riesgos internos ponen en jaque la seguridad se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}