{
  "id": "cyberscoop-2025-11-10-823371ee",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86718",
  "title": "Cyber information sharing law would get extension under shutdown deal bill",
  "url": "https://cyberscoop.com/cisa-2015-shutdown-extension-continuing-resolution/",
  "published_at": "2025-11-10T12:09:50+00:00",
  "fetched_at": "2025-11-11T11:19:38.504663+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Legislation to end the federal government shutdown includes a provision that would extend an expired cybersecurity information sharing law through the end of January. Extension of the Cybersecurity Information Sharing Act of 2015 is something industry groups have coveted since even before its sunset at the end of September. Previous attempts to extend it fell short amid the political battle over government funding. Businesses and cyber experts say the law&#8217;s legal protections are vital to sharing threat data between companies, and between industry and the government. Now, with the extension language in the continuing resolution bill that also includes three short-term appropriations bills, Congress is poised to restore it to life, at least temporarily. The Senate voted 60-40 on Sunday night to advance the legislation. It still would have to get a successful House vote and a signature from President Donald Trump. If that bill becomes law, the House and Senate would have a short window to advance a more permanent solution. The respective leaders of the House Homeland Security Committee, Rep. Andrew Garbarino, R-N.Y., and Senate Homeland Security and Governmental Affairs panel, Rand Paul, R-Ky., have introduced bills that would take significantly different approaches to amending and extending the 2015 law. The Trump administration has pushed for a 10-year extension without any changes. Cyber observers say that a long-term lapse of the 2015 law could have dire consequences. But there&#8217;s been little sign thus far that its expiration in October has slowed threat information sharing. Paul could present a hurdle to the overall continuing resolution bill, still. The post Cyber information sharing law would get extension under shutdown deal bill appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}