{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-10-47ca426d",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42299",
  "title": "Los ciberataques aumentan un 67% durante el Black Friday, CyberMonday y Navidad",
  "url": "https://cybersecuritynews.es/los-ciberataques-aumentan-un-67-durante-el-black-friday-cybermonday-y-navidad/",
  "published_at": "2025-11-10T22:00:00+00:00",
  "fetched_at": "2025-11-11T11:19:12.592186+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Con la inminente de llegada de miles de ofertas por el Black Friday, el CyberMonday y la campaña de compras de Navidad, los comercios se preparan para dar el empujón final a las ventas del año. Gran parte de ellas serán online, un ámbito en el que se baten récord año tras año en España. De hecho, el comercio electrónico experimentó un aumento interanual del 15% en ventas durante el primer semestre de 2025, con un incremento en pedidos del 8%. En paralelo, las pymes españolas lideran un importante crecimiento en pedidos internacionales, que ya han alcanzado un incremento del 125%, según datos de Flowwow. El último tramo del año, con diferentes campañas encadenadas es un arma de doble filo, pues se produce un aumento muy significativo de las ventas vía e-commerce y esto se traduce en más ingresos, pero también es un periodo de gran vulnerabilidad para las empresas desde el punto de vista de la ciberseguridad. En este sentido, los ciberataques aumentan un 67% durante esta campaña, en la que miles de datos de millones de consumidores recorren la red. Como explican los profesionales de Cylum, la unidad de ciberseguridad como servicio de Factum para pequeñas y medianas empresas, esto es particularmente preocupante y no tomar precauciones puede salir muy caro a nivel económico, reputacional y, en ocasiones, puede implicar el cierre de un negocio. Concretamente 3 de cada 10 pymes reconocen que no podrían sobrevivir a un ciberataque serio. Por eso, Cylum insta a reforzar la seguridad de sus plataformas digitales para proteger sus tiendas online durante campañas críticas. Para sus expertos en el área de protección de la pyme, resulta esencial realizar auditorías previas de seguridad, que permitan anticiparse a posibles vulnerabilidades antes de los picos de tráfico. Otra medida fundamental es la protección de la información y de los sistemas de pago, con la implantación de copias de seguridad cifradas e inmutables, verificadas regularmente, para reducir el tiempo de recuperación en caso de incidente. Además, se debe garantizar la seguridad de las transacciones online mediante protocolos cifrados, cumplimiento de PCI-DSS y autenticación multifactor en accesos administrativos minimiza el riesgo de fraudes en momentos de alta demanda. Por último, la concienciación de los empleados y la monitorización continua son imprescindibles para detectar y responder de manera ágil a las amenazas. El 55% de las pymes españolas afirma no saber cómo protegerse frente a un ciberataque, lo que evidencia la necesidad de formación continua en phishing y fraudes digitales. “Complementar la capacitación con sistemas de detección y respuesta 24/7 puede marcar la diferencia entre una interrupción mínima y un colapso de la actividad, salvaguardando no solo la operativa sino también la reputación de las pymes en plena campaña de ventas”, concluye David López, director de operaciones de Factum. La entrada Los ciberataques aumentan un 67% durante el Black Friday, CyberMonday y Navidad se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}