{
  "id": "schneier-on-security-schneier-com-2025-11-10-5f7a9fa6",
  "source_id": "schneier-on-security-schneier-com",
  "guid": "https://www.schneier.com/?p=71121",
  "title": "New Attacks Against Secure Enclaves",
  "url": "https://www.schneier.com/blog/archives/2025/11/new-attacks-against-secure-enclaves.html",
  "published_at": "2025-11-10T12:04:55+00:00",
  "fetched_at": "2025-11-11T11:20:13.984323+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Encryption can protect data at rest and data in transit, but does nothing for data in use. What we have are secure enclaves. I&#8217;ve written about this before: Almost all cloud services have to perform some computation on our data. Even the simplest storage provider has code to copy bytes from an internal storage system and deliver them to the user. End-to-end encryption is sufficient in such a narrow context. But often we want our cloud providers to be able to perform computation on our raw data: search, analysis, AI model training or fine-tuning, and more. Without expensive, esoteric techniques, such as secure multiparty computation protocols or homomorphic encryption techniques that can perform calculations on encrypted data, cloud servers require access to the unencrypted data to do anything useful. Fortunately, the last few years have seen the advent of general-purpose, hardware-enabled secure computation. This is powered by special functionality on processors known as trusted execution environments (TEEs) or secure enclaves. TEEs decouple who runs the chip (a cloud provider, such as Microsoft Azure) from who secures the chip (a processor vendor, such as Intel) and from who controls the data being used in the computation (the customer or user). A TEE can keep the cloud provider from seeing what is being computed. The results of a computation are sent via a secure tunnel out of the enclave or encrypted and stored. A TEE can also generate a signed attestation that it actually ran the code that the customer wanted to run. Secure enclaves are critical in our modern cloud-based computing architectures. And, of course, they have vulnerabilities: The most recent attack, released Tuesday, is known as TEE.fail. It defeats the latest TEE protections from all three chipmakers. The low-cost, low-complexity attack works by placing a small piece of hardware between a single physical memory chip and the motherboard slot it plugs into. It also requires the attacker to compromise the operating system kernel. Once this three-minute attack is completed, Confidential Compute, SEV-SNP, and TDX/SDX can no longer be trusted. Unlike the Battering RAM and Wiretap attacks from last month&#8212;which worked only against CPUs using DDR4 memory&#8212;TEE.fail works against DDR5, allowing them to work against the latest TEEs. Yes, these attacks require physical access. But that&#8217;s exactly the threat model secure enclaves are supposed to secure against.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}