{
  "id": "security-affairs-securityaffairs-co-2025-11-10-7ec58a05",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184413",
  "title": "Agentic AI in Cybersecurity: Beyond Triage to Strategic Threat Hunting",
  "url": "https://securityaffairs.com/184413/uncategorized/agentic-ai-in-cybersecurity-beyond-triage-to-strategic-threat-hunting.html",
  "published_at": "2025-11-10T12:17:10+00:00",
  "fetched_at": "2025-11-11T11:21:02.686074+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "With a 4M cybersecurity worker shortage, agentic AI helps SOCs move beyond triage, enabling proactive security once thought impossible. With a deficit of 4 million cybersecurity workers worldwide, it’s no surprise that most SOCs are still stuck in triage mode. That’s why agentic AI is stepping in to fill the gap. And this boost to internal cybersecurity capabilities gives security teams the ability to do what was only a pipe dream before: engage in proactive security. In other words, agentic AI is taking low-level decisions off SOC’s plates, so they don’t have to spend their days playing a reactive game of cat-and-mouse. Using these new AI capabilities, they can move beyond emergency response and head into a more mature security stage of strategic threat hunting. Here’s how. The Sad Truth: Triage Doesn’t Work As Prophet Security, a leading provider of AI SOC solutions, explains, “There are two reasons most SOCs can’t get ahead of the vulnerability backlog. First, there are not enough skilled cybersecurity employees. And second, threats are coming in at an unprecedented pace (thanks to AI, AI-generated bots, and increasing automation).” Alert volumes are reaching the breaking point, with: Orgs handling 960 alerts per day. Large enterprises fielding alerts from over 30 different tools. It takes security teams an average of an hour and ten minutes to review each alert. At that pace, they might get to seven in an eight-hour workday; seven out of 960. At this pace, critical things are almost certain to be left behind. In fact, 81% of SOC staffers spend two whole hours a day just rifling through and triaging alerts. 62% of alerts are just ignored Despite dozens of tools and telemetries feeding into our SOCs, the bottleneck is with humans. When it comes to sifting through mounds of valuable data, we’re just no match for machines going at machine speed. The Challenge of Human Bottlenecks The problem isn’t getting enough data. It’s knowing what to do with it fast enough to make a difference. In other words, making sense of it before bad guys get away. This requires a fundamental paradigm shift: less throwing spaghetti at a wall, more picking and choosing which alerts to go after. But isn’t that what SOCs are already trying to do? Yes; we’re just slowing down at key points (which is exactly where agentic AI can help): Aggregating security alert telemetry (from 30+ sources) in one place Sorting through massive volumes of alerts for false positives Validating promising alerts with low-level investigations (takes time) Gathering context around an alert (corroborating with other sources and external threat data) Building a comprehensive attack story with clear marching orders for mitigation After completing these steps, SOCs must then follow validated leads through complex attack paths, making the requisite security adjustments along the way. Many teams lack the expertise to do this at scale, and nearly all lack the cycles. Agentic AI for Augmented Defense It’s not that there’s anything wrong with the process; people simply can’t do it fast enough or well enough given an overwhelming number of tools and an innumerable amount of places data can hide. This leaves SOCs stuck in the mire of reactive threat triage, rather than proactive threat hunting. And this is where agentic AI can help. What is Agentic AI? As Gartner explains, “Agentic AI is an approach to building AI solutions that use one or more software entities (called AI agents) to understand circumstances, make decisions, take actions, and achieve goals in their online or real-world environments, either on their own or with human help.” Agentic AI differs from “regular AI” or even generative AI in that it does more than super-automate or draw conclusions or even come up with answers. It thinks. What Is the Value of Agentic AI? AI SOC agents represent more than a productivity boost. Their true value lies in workforce augmentation, freeing security teams from repetitive, low-value tasks and empowering them to focus on strategic initiatives like threat hunting or detection engineering. Agentic AI, AI SOCs, and Proactive Threat Hunting When implemented in an AI SOC, agentic AI uses its decision-making capabilities to take a threat from its inception (an alert) to its ultimate conclusion (remediation), and all the steps in between. Here’s how agentic AI comes into play: Triage and Validate at Scale: Agentic AI filters through massive amounts of alerts while suppressing false positives, giving SOCs a vetted batch of prioritized (and validated) alerts to work with. Enrich Automatically: No more putting the pieces together (from dozens of tools and dashboards, by hand). Agentic AI automatically enriches alerts with related information from other telemetries and threat intelligence sources. SIEMs, cloud infrastructure, identity platforms, dark web, etc. Investigate Autonomously: Using the context gathered in the previous step, AI SOCs can perform basic Tier 1 and Tier 2 threat investigations, even doing perfunctory remediations like quarantining malicious processes and revoking access. Map Attack Paths: AI SOC agents proactively draw out possible attack paths based on alerts. This lets SOCs not only triage immediate dangers but strategically squelch new threats. Even junior analysts can navigate complex incidents with pre-constructed timelines and AI-suggested remediation steps. Human-Readable Communication: Agentic AI allows practitioners to ask otherwise complex queries using natural language (“How many agents are exposed to Log4j?”) and get answers in a narrative format, with options to double-click for details. Agents leverage machine learning to better conform with the organization’s security goals over time. While agentic AI agents do “think,” the extent of their thinking is devoted to the low-value security items that analysts don’t have time to do. They correlate detection and response across disparate tools and solutions, saving teams the trouble. Then they leave only the high-value tasks &#8211; like proactive threat hunting – for SOCs to close out. Bridging AI Reasoning and Human Intuition Agentic AI tees up human analysts to do what they do best; make key decisions given the right information. As noted in CSO, “Agentic AI brings together a set of tools, frameworks and patterns to automate end-to-end business process workflows that enable AI and humans to work together.” This AI-human interaction is key. Shared context between analysts and AI agents strengthens investigation loops, mixing machine-powered data analysis with human-centric reasoning. Does this work? The results speak for themselves: the top AI SOC analyst platforms can reduce mean-time-to-respond (MTTR) by up to 10X, proving what happens when teams leverage agentic AI for augmented defense. About the author: Katrina ThompsonAn ardent believer in personal data privacy and the technology behind it, Katrina Thompson is a freelance writer leaning into encryption, data privacy legislation, and the intersection of information technology and human rights. She has written for Bora, Venafi, Tripwire, and many other sites. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Agentic AI)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}