{
  "id": "security-affairs-securityaffairs-co-2025-11-10-f7560309",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184396",
  "title": "QNAP fixed multiple zero-days in its software demonstrated at Pwn2Own 2025",
  "url": "https://securityaffairs.com/184396/hacking/qnap-fixed-multiple-zero-days-in-its-software-demonstrated-at-pwn2own-2025.html",
  "published_at": "2025-11-10T00:01:33+00:00",
  "fetched_at": "2025-11-10T11:20:54.295513+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "QNAP patched seven zero-days used at Pwn2Own 2025 affecting QTS, QuTS hero, Hyper Data Protector, Malware Remover, and HBS 3. Taiwanese vendor QNAP patched seven zero-day vulnerabilities exploited at Pwn2Own Ireland 2025. The flaws affected QTS, QuTS hero, Hyper Data Protector, Malware Remover, and HBS 3 Hybrid Backup Sync. The vulnerabilities addressed by the company are: CVE-2025-62847 &#8211; CVE-2025-62848 &#8211; CVE-2025-62849 in QNAP&#8217;s QTS and QuTS hero operating systems; CVE-2025-11837 in Malware Remover; CVE-2025-59389 in Hyper Data Protector; CVE-2025-62840 &#8211; CVE-2025-62842 in HBS 3 Hybrid Backup Sync software. The vendor recommends that customers update the software to the latest version. &#8220;To secure your device, we recommend regularly updating your system to the latest version to benefit from vulnerability fixes.&#8221; reads the advisory published by the company. Below are the software versions that fix these vulnerabilities: Hyper Data Protector 2.2.4.1 and later Malware Remover 6.6.8.20251023 and later HBS 3 Hybrid Backup Sync 26.2.0.938 and later QTS 5.2.7.3297 build 20251024 and later QuTS hero h5.2.7.3297 build 20251024 and later QuTS hero h5.3.1.3292 build 20251024 and later White-hat hackers of Summoning Team, DEVCORE, Team DDOS, and a CyCraft technology intern demonstrated the above vulnerabilities during the last Pwn2Own 2025 hacking competition. In October 2024, QNAP addressed two vulnerabilities, tracked as CVE-2024-50388 and CVE-2024-50387, demonstrated at the Pwn2Own Ireland 2024. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Pwn2Own)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}