{
  "id": "tenable-blog-tenable-com-2025-11-10-4494e302",
  "source_id": "tenable-blog-tenable-com",
  "guid": "https://www.tenable.com/210398",
  "title": "Tenable Is a Leader in the First-Ever Gartner® Magic Quadrant™ for Exposure Assessment Platforms",
  "url": "https://www.tenable.com/blog/tenable-is-a-leader-in-the-first-ever-gartner-magic-quadrant-for-exposure-assessment",
  "published_at": "2025-11-10T21:15:00+00:00",
  "fetched_at": "2025-11-11T11:19:50.147444+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Our customers are proving what exposure management can do. Thank you for trusting us to be part of your mission.Key takeawaysTenable believes our evolution of exposure management and our strong, mature partner ecosystem contributed to our position as a Leader in the 2025 Gartner® Magic Quadrant™ for Exposure Assessment Platforms.&nbsp;Tenable is positioned furthest right for Completeness of Vision and highest in Ability to Execute among all vendors evaluated.&nbsp;We see this recognition as validation of the trust our customers have in Tenable as we work side-by-side to solve one of the greatest challenges facing organizations today: reducing cyber exposure.What we do matters. That’s more than a core value here at Tenable, it’s our guiding principle.What matters most to us? Our customers. So, with gratitude to our customers worldwide, I’m thrilled to share the news of Tenable’s placement as a Leader in the first-ever Gartner® Magic Quadrant™ for Exposure Assessment Platforms.Tenable is positioned furthest right for Completeness of Vision and highest in Ability to Execute among all vendors evaluated.We see this recognition as validation of the path we've forged together with our customers to solve one of the greatest challenges facing organizations today: reducing cyber exposure.As the size and complexity of the attack surface grew, we worked with you to solve each new challenge. You helped us see how your security teams were burning out in the struggle to assess a cacophony of alerts from siloed security tools. You taught us about the conflicting priorities of your security, IT, development and business teams — and how these conflicts were creating friction and getting in the way of effective remediation. You showed us how attackers were viewing your environment as an interconnected ecosystem of exposures they could exploit to move between traditional IT, identities, cloud, operational technology and containers.In 2017, we recognized that big changes needed to happen in how the industry at large was approaching cybersecurity. As the attack surface grew, stretching into cloud, OT and identity, we moved with the market when customers needed us there, and we led the market with exposure management, and now AI, when customers needed to see what was next. That combination of anticipating change and shaping it has made Tenable a trusted partner for decades.That evolution led to Tenable One, the industry’s first exposure management platform. Tenable One delivers the most complete view of risk across the modern attack surface. It shows where you’re most exposed — identifying the signal from the noise — and how to close those gaps fast. It transcends the limits of point solutions so you can take control of cyber risk.We’re proud that Gartner has recognized us as a Leader. We understand that exposure assessment platforms are crucial to what Gartner calls a Continuous Threat Exposure Management (CTEM) program. Exposure assessment platforms continuously identify and prioritize exposures across a wide range of asset classes.Solving real-world cybersecurity challenges is in our DNABy listening to the challenges our customers face, we shape how we design, build and deliver security solutions that truly matter. It’s what drove the creation of Nessus, the most widely used vulnerability assessment product in the industry. It’s how we evolved into the industry leader in vulnerability management, giving our customers unmatched visibility into assets and vulnerabilities across IT environments. It’s why we recognized the need to build on our vulnerability management expertise through innovation and acquisitions to create Tenable One. And it’s what you’ll see as we continue to expand our offerings, not only helping you solve your AI security challenges but also leveraging AI to power our offerings.The mission to thwart cyber attackers is one we pursue together. Your insights from the front lines guide our strategy. Your collaboration shapes the Tenable One platform. We’re here to support your work by providing the clarity, tools and confidence you need to proactively reduce cyber exposures. Together, we’re setting the standard for exposure management.Source: 2025 Gartner® Magic Quadrant™ for Exposure Assessment Platforms, Mitchell Schneider, et al, September 25, 2025GARTNER is a registered trademark and service mark of Gartner, Inc. and/or its affiliates in the U.S. and internationally, Magic Quadrant is a registered trademark of Gartner, Inc. and/or its affiliates and is used herein with permission. All rights reserved.Gartner does not endorse any vendor, product or service depicted in its research publications and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner’s Research &amp; Advisory organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}