{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-24-da2d665d",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42360",
  "title": "Iberia denuncia un acceso externo no autorizado que expone datos personales de clientes",
  "url": "https://cybersecuritynews.es/iberia-denuncia-un-acceso-externo-no-autorizado-que-expone-datos-personales-de-clientes/",
  "published_at": "2025-11-24T06:41:26+00:00",
  "fetched_at": "2025-11-24T11:19:49.710449+00:00Z",
  "status": "processed",
  "content": {
    "raw": "La aerolínea Iberia ha denunciado ante la Unidad Central Operativa (UCO) de la Guardia Civil, la Agencia Española de Protección de Datos (AEPD) y el Instituto Nacional de Ciberseguridad (INCIBE) un acceso externo no autorizado a un repositorio de comunicación alojado y gestionado por un proveedor externo. El incidente ha comprometido la confidencialidad de ciertos datos personales de sus clientes, aunque la aerolínea recalca que en ningún caso se ha puesto en riesgo la seguridad de los vuelos. Según explicó la compañía en un comunicado, el sistema afectado es un repositorio de intercambio de información “limitado y no operacional”. La investigación preliminar apunta a que los datos extraídos incluyen nombre y apellidos, direcciones de correo electrónico y, en algunos casos, números de teléfono y el identificador de la tarjeta de fidelización Iberia Club. Iberia subraya que los atacantes no han accedido a datos completos ni utilizables de medios de pago, ni a claves de acceso a las cuentas de usuario. No obstante, la aerolínea reconoce que se han obtenido algunos códigos de reserva correspondientes a vuelos futuros, si bien hasta la fecha no existe evidencia de un uso fraudulento de esta información. Tras detectar la intrusión, Iberia ha iniciado la notificación individual a los clientes afectados y ha activado medidas de protección adicionales, entre ellas la implantación de un sistema de autenticación en dos pasos para evitar cualquier modificación indebida de reservas o gestiones asociadas. La compañía ha recomendado a los usuarios que extremen la precaución ante posibles comunicaciones que aparenten proceder de Iberia y que pudieran ser utilizadas para intentos de suplantación de identidad. Además, ha pedido disculpas por las molestias ocasionadas y asegura estar “poniendo todos los medios a su alcance para mitigar los efectos del incidente y evitar que pueda repetirse en el futuro”. La entrada Iberia denuncia un acceso externo no autorizado que expone datos personales de clientes se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": 65,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": [],
    "processed_at": "2025-11-24"
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updated_at": "2025-11-24T11:22:58.039008+00:00Z"
}