{
  "id": "cyberscoop-2025-11-24-237cb672",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86915",
  "title": "When trust turns toxic: Lessons from the Salesloft Drift incident",
  "url": "https://cyberscoop.com/saas-ai-integration-breaches-identity-trust-insane-risks-op-ed/",
  "published_at": "2025-11-24T11:00:00+00:00",
  "fetched_at": "2025-11-24T11:20:14.016867+00:00Z",
  "status": "processed",
  "content": {
    "raw": "The recent Salesloft Drift breach offered a sobering reminder of how easily trust can be weaponized in today’s SaaS and AI-integrated environments. In this incident, hackers exploited the Drift chatbot, stole OAuth tokens, and used them to obtain data from CRM systems before the tokens could be revoked. In the wake of the incident, many deemed the weak spot to be the tokens, but they are missing the bigger issue. Namely, identity and permission sprawl, and a misuse of excessive trust. Inside the Salesloft Drift Attack With Drift, attackers used OAuth tokens to make legitimate API calls against CRM environments, and since the tokens were valid, the fraudulent activity didn’t raise any flags. In the eyes of all, it was simply business as usual. Organizations later confirmed that data was stolen before tokens could be revoked. This includes sensitive business records, contact information, support data, and, in some cases, embedded credentials across more than 700 organizations using the compromised integration with Salesforce.&nbsp; And while those impacted have traced the chain of compromise, the next step is to address the larger underlying problem of the chatbots and the excessive scopes they are given.&nbsp; Consider the following: Exceedingly Broad Scopes: The chatbots don’t just have access to what they need; they have access to everything, including users’ credentials. Ongoing Authorization: Chatbot credentials often remain valid indefinitely in the name of speed, in essence creating a permanent open door. Standing Privileges: Permanent credentials mean chatbots stay connected even when not in use, making them targets ready to be exploited at any time. Add it all up, and you can see how a single compromised credential can create significant exposure. And the risk is only growing, thanks to SaaS and AI-powered integrations that are creating an unimaginable number of vulnerabilities. Still, businesses treat integrations and agents as background utilities that have no ownership, governance, or lifecycle management. Ironically, it’s the absence of these controls that gives them greater operating privileges and reach than any human would ever be granted, while making them ideal targets for attackers. The identity and access wake-up call Whether or not an organization was impacted by Drift, it’s time to reassess all SaaS and AI integration footprints. This includes verifying every connected app, API bridge, and automation workflow.&nbsp; Start with addressing hygiene, including the following: Remove and rotate any old tokens, as well as those with excessive permissions, especially those connected to third-party integrations. Where possible, static tokens should be eliminated entirely in favor of short-lived tokens with a narrow window of operation. Replace blanket-scoped permissions with narrowly defined access that is tied to specific roles and actions. Audit logs and event data for unusual exports, API surges, or unexpected user agents. These actions can help surface silent compromises before they grow. This tactical cleanup is not a one-time exercise. Everything must be re-evaluated on an ongoing basis. Even then, your work is not done.&nbsp; From static access to runtime authorization The next generation of security requires using adaptive access models such as Zero Standing Privileges (ZSP), where “always-on” automation is replaced by dynamic, ephemeral identities and permissions that are enforceable at runtime.&nbsp; With ZSP, every integration or AI agent receives temporary, just-in-time access that is created at runtime, bound by clear time-to-live parameters and contextual conditions. When the task ends, the permission disappears. Because these are enabled through runtime authorization, businesses can easily verify not only who or what is making a request, but also why, for how long, and under what conditions. When paired with continuous monitoring, organizations can quickly spot anomalous activities and revoke privileges instantly when behavior deviates from policy. Treat all integrations as identities Another key to success is treating all integrations, whether they are human, machine, agentic AI, or AI-driven assistants, equally. Each of these should have a distinct identity, a defined purpose, ownership, and lifecycle stages. These controls provide teams with critical visibility across all identities and, when irregular activities are spotted, the answers to critical questions—who had access, what they did, and for how long? Pay special attention to AI-driven tools, ensuring that agents operating on behalf of humans only act within the parameters set by their sponsor. Helpful tools here include allowlisting and runtime guardrails that can keep agents in their assigned lane and, in doing so, prevent them from veering off and initiating unauthorized actions. This includes those that have been compromised or manipulated through prompt injection. The bigger picture: trust as a dynamic perimeter The Drift incident wasn’t an anomaly—it was a preview. As AI-driven automations and SaaS integrations multiply, every organization will face the same question: can you truly see, control, and verify who or what has access to your data at any given moment? Security can no longer depend on static controls or the assumption that trusted systems will stay trustworthy. The future belongs to those who treat identity as the new perimeter and access as a living, breathing condition—not a one-time approval. When every token, credential, and agent is governed by context, time, and intent, trust becomes measurable—and defensible. Because in a world where automation never sleeps, trust can’t either.Art Poghosyan is the CEO of Britive, a cloud privileged access management software company.&nbsp; The post When trust turns toxic: Lessons from the Salesloft Drift incident appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": 90,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": [],
    "processed_at": "2025-11-24"
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updated_at": "2025-11-24T11:22:02.030376+00:00Z"
}