{
  "id": "security-affairs-securityaffairs-co-2025-11-24-66cc04f7",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=185000",
  "title": "Scattered Spider alleged members deny TfL charges",
  "url": "https://securityaffairs.com/185000/hacking/scattered-spider-alleged-members-deny-tfl-charges.html",
  "published_at": "2025-11-24T08:24:35+00:00",
  "fetched_at": "2025-11-24T11:21:33.736447+00:00Z",
  "status": "processed",
  "content": {
    "raw": "Two UK teens linked to Scattered Spider pleaded not guilty to charges over last year’s TfL cyberattack at a Southwark Crown Court hearing. Two British teens accused of Computer Misuse Act offenses for a cyberattack on Transport for London pleaded not guilty in court. Thalha Jubair (aka EarthtoStar, Brad, Austin, and @autistic), 19, and Owen Flowers, 18, were arrested in September by the NCA at their homes in East London and Walsall. Both appeared at Southwark Crown Court on Friday to formally deny the charges. &#8220;Both have appeared before Southwark Crown Court and entered not guilty pleas to charges of conspiring together to commit unauthorised acts against Transport for London (TfL).&#8221; reported Sky News. &#8220;They stood in the dock together and spoke only to confirm their names and enter not guilty pleas.&#8221; In September, U.K. law enforcement authorities arrested the two teenagers who are members of the notorious Scattered Spider hacking group in connection with their role in the cyber attack that hit Transport for London (TfL). Transport for London (TfL) is a local government body responsible for most of the transport network in London, United Kingdom. In August 2024, a cyber attack hit the organization. Both were charged with conspiring together to commit unauthorised acts against TfL, under the Computer Misuse Act. On 6 September 2024, UK authorities initially charged Flowers for conspiring to attack US healthcare networks, while Jubair was also charged with conspiring with others to infiltrate and damage the networks of SSM Health Care Corporation and attempting to do the same to Sutter Health’s networks, both based in the US. The DOJ announced that Jubair faces charges in New Jersey for conspiracies to commit computer fraud, wire fraud, and money laundering, linked to at least 120 network intrusions and extortion targeting 47 U.S. entities. Victims reportedly paid over $115 million in ransom. Jubair allegedly acted with the Scattered Spider group, executing sophisticated attacks that disrupted businesses, critical infrastructure, and federal courts. The NCA said evidence found after Flowers’ 2024 arrest links him to alleged attacks on U.S. healthcare firms. He’s also charged with conspiring to breach SSM Health and attempting to target Sutter Health. Flowers pleaded not guilty to all charges. Flowers and Jubair face some of the harshest cybercrime charges in English law, including conspiracy to commit unauthorized computer acts risking serious harm, with life imprisonment possible. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Scattered Spider)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": 80,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": [],
    "processed_at": "2025-11-24"
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updated_at": "2025-11-24T11:22:47.758589+00:00Z"
}