{
  "id": "cyberscoop-2025-11-11-1fa9e9a9",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86739",
  "title": "Amazon rolls out AI bug bounty program",
  "url": "https://cyberscoop.com/amazon-bug-bounty-program-ai-nova/",
  "published_at": "2025-11-11T20:12:30+00:00",
  "fetched_at": "2025-11-12T11:19:35.245968+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Amazon became the latest company to open its large language models to outside security researchers, announcing the creation of a new bug bounty program for the tech giant’s AI tools. The program will allow select third-party researchers and academic teams to prod NOVA, Amazon’s suite of foundational AI models and receive compensation for their findings. It will cover a range of common vulnerabilities that affect most generative AI systems: prompt injection, jailbreaking and vulnerabilities within the model that have “real-world exploitation potential.” Researchers will also look at how the models could be manipulated to assist in the production of chemical, biological, radiological and nuclear weapons.“Security researchers are the ultimate real-world validators that our AI models and applications are holding up under creative scrutiny,” Hudson Thrift, CISO of Amazon Stores, said in a statement Tuesday. Participants will be selected next year by Amazon through an invite-only system, meaning the company will still retain influence over which security researchers get access to their technology. According to the company, it has paid out more than $55,000 to researchers for 30 validated AI-related vulnerabilities under its broader public bug bounty program. Amazon has bet big on generative AI, developing its own family of commercial large language models (NOVA) while also providing services like Amazon Bedrock that allow customers to access models from other companies like Anthropic, Mistral AI and others. But as these products have become increasingly integrated within Amazon and user organizations, their safety and security has come with higher stakes and larger potential downstream effects. “As Nova models power a growing ecosystem across Alexa, AWS customers through Amazon Bedrock, and other Amazon products, ensuring their security remains an essential focus,” Amazon wrote in the announcement, adding “By creating opportunities for hands-on learning and discovery, Amazon is helping raise a new generation of researchers equipped to secure the systems that will define the next era of AI.” Earlier this year, Amazon held a tournament between 10 university research teams to find bugs and vulnerabilities in Amazon’s coding AI models. Each team received $250,000 and AWS credits upfront to conduct their work, while winners pulled in an additional $700,000 in reward money, according to the company.Their findings included novel bugs and methods for jailbreaking, safety alignment, data poisoning attacks and discovered a number of tradeoffs between security and functionality within Amazon’s NOVA models. The post Amazon rolls out AI bug bounty program appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}