{
  "id": "cyberscoop-2025-11-11-9e7ca404",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86731",
  "title": "BigBear.ai to buy Ask Sage, strengthening security-centric AI for federal agencies",
  "url": "https://cyberscoop.com/big-bear-ai-ask-sage-acquisition-agentic-ai/",
  "published_at": "2025-11-11T15:02:52+00:00",
  "fetched_at": "2025-11-12T11:19:35.246619+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Virginia-based BigBear.ai announced Monday it will acquire Ask Sage, a generative artificial intelligence platform specializing in secure deployment of AI models and agentic systems across defense and other regulated sectors, in a deal valued at about $250 million. Ask Sage focuses on safety and security in the growing field of agentic AI, or systems capable of independent reasoning and task execution. Designed to serve organizations handling classified and sensitive information, Ask Sage offers a model-agnostic framework and holds a FedRAMP High accreditation, a top-tier government certification for cloud security. The emphasis on secure, compliant AI drew specific mention from BigBear.ai CEO Kevin McAleenan on an earnings call Monday, who characterized the acquisition as a direct fit with the company’s strategy of pursuing “disruptive AI mission solutions for national security.”&nbsp; McAleenan pointed out that safeguarding information, assuring compliance, and enabling scalable AI deployment have become central requirements in defense and intelligence markets as organizations seek to harness the abilities of increasingly autonomous AI agents. Nicolas Chaillan, founder of Ask Sage and former chief software officer for the U.S. Air Force and Space Force, will join BigBear.ai as chief technology officer as part of the agreement. Chaillan’s background includes shaping cybersecurity and software development policy at the Department of Defense and the Department of Homeland Security, where he advocated for the adoption of secure, iterative technology practices across federal agencies. BigBear.ai plans to integrate Ask Sage’s security-focused capabilities throughout its portfolio, cross-sell to its existing client base, and leverage the Ask Sage marketplace as a new distribution channel for compliant AI solutions. The company aims to address growing demands among government and regulated industry clients for artificial intelligence that meets increasingly complex standards for data protection and operational assurance. The transaction highlights broader trends in the AI sector as providers — especially those serving national security and critical infrastructure — race to build tools that balance innovation with the safety and security requirements of highly regulated environments.&nbsp; The acquisition is expected to close late in the fourth quarter of 2025 or early in the first quarter of 2026. The post BigBear.ai to buy Ask Sage, strengthening security-centric AI for federal agencies appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}