{
  "id": "news-the-citizen-lab-citizenlab-org-2025-11-11-59a64987",
  "source_id": "news-the-citizen-lab-citizenlab-org",
  "guid": "https://citizenlab.ca/?p=82857",
  "title": "Nov 26 | Women, Technology, and Peacemaking Webinar: 25 Years After UNSCR 1325",
  "url": "https://citizenlab.ca/2025/11/webinar-women-technology-and-peacemaking/",
  "published_at": "2025-11-11T17:23:50+00:00",
  "fetched_at": "2025-11-12T11:20:06.652627+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Hosted by the Citizen Lab Date: November 26, 2025 Time: 9:30 am &ndash; 11 am ET Location: Online (Zoom webinar) Register now This year marks the 25th anniversary of UN Security Council Resolution 1325, a milestone recognizing women&rsquo;s essential roles in peacemaking, conflict prevention, and post-conflict recovery. Yet, as the world celebrates this legacy, new realities challenge its celebration. Join us on November 26, 2025, for a timely conversation on how digital repression and surveillance are reshaping women&rsquo;s participation in peacebuilding and the Women, Peace and Security (WPS) agenda. This webinar brings together Citizen Lab researchers with policy advisors, WPS experts, and human rights defenders to reflect on 25 years of the WPS agenda in the age of digital repression. The discussion will explore how gender, technology, and authoritarianism intersect to shape women&rsquo;s participation in peace and security, and how targets of gendered digital attacks and feminist movements are building resilience and reimagining women&rsquo;s digital security for the next 25 years. Register here &nbsp; Meet the Speakers Noura Aljizawi is a senior researcher at the Citizen Lab. Her research focuses on digital authoritarianism, disinformation, and digital transnational repression, informed by her background in human rights activism during the Syrian uprising. Aljizawi holds a Master&rsquo;s degree in Global Affairs from the University of Toronto and has been recognized for her work in online safety and digital security. Siena Anstis is a senior legal advisor at the Citizen Lab. Prior to joining Citizen Lab, she worked as a litigation associate at Morrison &amp; Foerster in New York City and clerked for the Hon. Justice Cromwell at the Supreme Court of Canada and at the Court of Appeal for Ontario. Anstis holds a B.A. in Journalism and Anthropology from Concordia University, a Bachelor of Laws/Bachelor of Civil Law from McGill University, and a Master of Laws from the University of Cambridge. Natalia Arno is the founder and president of Free Russia Foundation. In 2004, she joined the International Republican Institute, leading its Russia programs in civic education, grassroots organizing, party building, women and youth leadership, civil society development, and local governance. In 2012, Arno was forced to leave Russia by the Putin administration due to her pro-democracy work. Not demoralized but galvanized by the loss of her homeland, she set out to build an organization that would unite and support all individuals and forces working toward a free, peaceful and prosperous Russia.&nbsp; Sreshtha Das is a queer feminist disabled non-binary activist and works as a gender advisor and researcher at Amnesty International. Das has a Masters in Gender, Violence and Conflict from the University of Sussex and is exploring how gender and sexual identities are created and employed during periods of conflict and instability. Urooj Mian (Moderator) holds a Master in Law (LL.M) in International Crime and Justice from the United Nations Interregional Crime Research Institute (UNICRI) and University of Torino, a Master in Social Science (M.Sc) in Peace and Conflict Research, from Uppsala University in Sweden, and a Bachelor of Public Affairs in Policy Management (B.PAPM) specializing in Human Rights and Law from Carleton University. She is respected as a gender, peace and security expert internationally and regularly works with human rights defenders.&nbsp; She holds a combination of experience as a life-long activist, a policy-maker, and a founding executive director of a national advocacy-focussed not-for-profit forwarding the Women Peace and Security agenda. Urooj is currently the CEO at Sustainable Human Empowerment (SHE) Associates. A boutique consulting firm headquartered in Canada with a mission to empower sustainable impact and enable transformative change in the areas of gender equality, peace and justice worldwide. Marcus Michaelsen is a senior researcher at the Citizen Lab focusing on digital threats against exiles and diaspora communities. Previously, he was a senior post-doctoral researcher in the research group on Law, Science, Technology and Society at Vrije Universiteit Brussel. He has also held a senior information controls fellowship with the Open Technology Fund, and has worked as a lecturer and postdoc researcher in the Political Science Department of the University of Amsterdam. He holds a PhD in Media and Communication Studies from the University of Erfurt in Germany. Lara Scarpitta is the OSCE Senior Advisor on Gender Issues and Head of the Gender Issues Programme in the Office of the Secretary General; Senior Advisor and former Political Advisor on Peace, Mediation and Gender at the EU Delegation to the United Nations in Geneva. Xeenarh Mohammed is the co-lead of the global Digital Defenders Partnership program, an international program that contributes to strengthening the resilience of human rights defenders. She is a lawyer, activist, community organiser and holistic security trainer with over a decade of experience working on human rights issues across sectors in Nigeria and beyond. In the last few years, she has worked with organisations such as the Open Technology Fund, the Love Nigeria Foundation and the Heinrich B&ouml;ll Foundation, and has freelanced for many other organisations on issues relating to human rights, gender and social development. About UNSCR 1325 The United Nations Security Council (UNSC) adopted resolution (S/RES/1325) on women, peace and security on October 31, 2000. UNSCR 1325 calls for women&rsquo;s meaningful participation in peace and security processes; however, 25 years later, the world faces new and complex realities that challenge the spirit of this resolution. Digital technologies have introduced new forms of communication and alternative public spaces. They have also become tools of surveillance, control, harassment, and violence in the hands of patriarchal, authoritarian, and militarized powers.&nbsp; The widespread use of mercenary spyware, targeted digital surveillance, online harassment, and disinformation campaigns has created an environment in which women journalists, human rights defenders, and peacemakers are systematically targeted. These technologies enable state and non-state actors to extend gender-based violence beyond physical spaces and into the digital sphere. Even when women are in exile, digital technology enables harmful actors to threaten and silence women from afar. While the international community celebrates the progress made on the WPS agenda, women who engage in peacebuilding and human rights work still face multi-layered forms of violence that are simultaneously gendered, political, and technological.This webinar situates these realities within an intersectional feminist framework, recognizing that women from marginalized communities, including those defined by race, ethnicity, sexuality, class, religion, or migration status, experience compounded forms of exclusion and vulnerability. Understanding how these intersecting systems of power operate in digital environments is essential to advancing an inclusive and transformative WPS agenda for the next 25 years.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}