{
  "id": "qualys-security-blog-2025-11-11-e3569e4e",
  "source_id": "qualys-security-blog",
  "guid": "https://blog.qualys.com/?p=39086",
  "title": "Microsoft Patch Tuesday, November 2025 Security Update Review",
  "url": "https://blog.qualys.com/category/vulnerabilities-threat-research",
  "published_at": "2025-11-11T19:47:18+00:00",
  "fetched_at": "2025-11-12T11:19:49.591908+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Microsoft released its November Patch Tuesday Security Updates. Here&#8217;s a quick breakdown of what you need to know. Microsoft Patch Tuesday for November 2025 This month&#8217;s release addresses 68 vulnerabilities, including five critical and 59 important-severity vulnerabilities. In this month&#8217;s updates, Microsoft has addressed a zero-day vulnerability that was being exploited in the wild. Microsoft has addressed five vulnerabilities in Microsoft Edge (Chromium-based) in this month&#8217;s updates. Microsoft Patch Tuesday, November edition, includes updates for vulnerabilities in&nbsp;SQL Server, Windows Hyper-V, Visual Studio, Windows Kernel, Windows WLAN Service, Customer Experience Improvement Program (CEIP), and more. From elevation of privilege flaws to remote code execution risks, this month&#8217;s patches are essential for organizations aiming to maintain a robust security posture. The November 2025 Microsoft vulnerabilities are classified as follows: Vulnerability CategoryQuantitySeveritiesSpoofing Vulnerability2Important: 2Denial of Service Vulnerability3Important: 3Elevation of Privilege Vulnerability29Critical: 1Important: 28Security Feature Bypass Vulnerability2Important: 2Information Disclosure Vulnerability11Critical: 1Important: 10Remote Code Execution Vulnerability16Critical: 3Important: 13 Zero-day Vulnerabilities Patched in November Patch Tuesday Edition CVE-2025-62215: Windows Kernel Elevation of Privilege Vulnerability Successful exploitation of the vulnerability may allow an authenticated attacker to gain SYSTEM privileges.&nbsp;An attacker must win a race condition to exploit the vulnerability. Critical Severity Vulnerabilities Patched in November Patch Tuesday Edition CVE-2025-60724: GDI+ Remote Code Execution Vulnerability A heap-based buffer overflow flaw in the Microsoft Graphics Component may allow an unauthenticated attacker to execute code over a network. An attacker could exploit this vulnerability by convincing a user to download and open a document containing a specially crafted metafile. CVE-2025-62199: Microsoft Office Remote Code Execution Vulnerability A use-after-free vulnerability in Microsoft Office may allow an unauthenticated attacker to execute code locally. For successful exploitation of the vulnerability, an attacker must send the user a malicious file and convince them to open it. CVE-2025-60716: DirectX Graphics Kernel Elevation of Privilege Vulnerability A use-after-free vulnerability in Windows DirectX may allow an authenticated attacker to elevate their local privileges. An attacker must win a race condition to exploit the vulnerability. Upon successful exploitation, an attacker could gain SYSTEM privileges. CVE-2025-62214: Visual Studio Remote Code Execution Vulnerability A command injection vulnerability in Visual Studio may allow an authenticated attacker to execute code locally. CVE-2025-30398: Nuance PowerScribe 360 Information Disclosure Vulnerability Missing authorization in Nuance PowerScribe may allow an unauthenticated attacker to disclose information over a network. An unauthenticated attacker could exploit this vulnerability by making an API call to a specific endpoint. The attacker could then use the data to gain access to sensitive information on the server. Other Microsoft Vulnerability Highlights CVE-2025-59512 is an elevation of privilege vulnerability in the Customer Experience Improvement Program (CEIP). An improper access control flaw may allow an authenticated attacker to gain SYSTEM privileges. CVE-2025-60705 is an elevation of privilege vulnerability in the Windows Client-Side Caching. An improper access control flaw may allow an authenticated attacker to gain administrator privileges. CVE-2025-60719 is an elevation of privilege vulnerability in the Windows Ancillary Function Driver for WinSock. Successful exploitation of the vulnerability may allow an attacker to gain SYSTEM privileges. CVE-2025-62217 is an elevation of privilege vulnerability in the Windows Ancillary Function Driver for WinSock. Successful exploitation of the vulnerability may allow an attacker to gain SYSTEM privileges. CVE-2025-62213 is an elevation of privilege vulnerability in the Windows Ancillary Function Driver for WinSock. Successful exploitation of the vulnerability may allow an attacker to gain SYSTEM privileges. Microsoft Release Summary This month&#8217;s release notes cover multiple Microsoft product families and products/versions affected, including, but not limited to, Nuance PowerScribe, Microsoft Configuration Manager, Microsoft Office Excel, Azure Monitor Agent, Windows Smart Card, Windows DirectX, Windows Speech, Windows Routing and Remote Access Service (RRAS), Windows Bluetooth RFCOM Protocol Driver, Microsoft Streaming Service, Windows Broadcast DVR User Service, Windows Remote Desktop, Windows Kerberos, Windows Client-Side Caching (CSC) Service, Multimedia Class Scheduler Service (MMCSS), Storvsp.sys Driver, Windows Common Log File System Driver, Host Process for Windows Tasks, Windows OLE, Windows Administrator Protection, Windows Ancillary Function Driver for WinSock, Windows TDX.sys, OneDrive for Android, Microsoft Graphics Component, Microsoft Office, Microsoft Office SharePoint, Microsoft Office Word, Microsoft Dynamics 365 (on-premises), Windows License Manager, Dynamics 365 Field Service (online), Microsoft Wireless Provisioning System, Windows Subsystem for Linux GUI, Visual Studio Code CoPilot Chat Extension, GitHub Copilot and Visual Studio Code, and Microsoft Edge (Chromium-based).&nbsp; The next Patch Tuesday falls on December 9, and we will be back with details and patch analysis. Until next Patch Tuesday, stay safe and secure. Be sure to subscribe to &#8216;This Month in Vulnerabilities and Patch&#8217;s webinar.&#8217; Qualys Monthly Webinar Series The Qualys Research team hosts a monthly webinar series to help our existing customers leverage the seamless integration between Qualys Vulnerability Management Detection Response (VMDR) and Qualys Patch Management. Combining these two solutions can reduce the median time to remediate critical vulnerabilities. During the webcast, we will discuss this month&#8217;s high-impact vulnerabilities, including those that are a part of this month&#8217;s Patch Tuesday alert. We will walk you through the necessary steps to address the key vulnerabilities using Qualys VMDR and Qualys Patch Management. Join the webinar This Month in Vulnerabilities &amp; Patches Register Now",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}