{
  "id": "security-affairs-securityaffairs-co-2025-11-11-743047fb",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184500",
  "title": "SAP fixed a maximum severity flaw in SQL Anywhere Monitor",
  "url": "https://securityaffairs.com/184500/security/sap-fixed-a-maximum-severity-flaw-in-sql-anywhere-monitor.html",
  "published_at": "2025-11-11T21:02:24+00:00",
  "fetched_at": "2025-11-12T11:21:05.059738+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "SAP fixed 19 security issues, including a critical flaw in SQL Anywhere Monitor with hardcoded credentials that could enable remote code execution. SAP addressed 19 security vulnerabilities, including a critical flaw in SQL Anywhere Monitor, with the release of November 2025 notes. The vulnerability, tracked as CVE-2025-42890 (CVSS score of 10/10), is an insecure key &amp; Secret Management vulnerability in SQL Anywhere Monitor (Non-Gui). According to the advsory, hardcoded credentials in SQL Anywhere Monitor allow arbitrary code execution, threatening system confidentiality, integrity, and availability. &#8220;SQL Anywhere Monitor (Non-GUI) baked credentials into the code, exposing the resources or functionality to unintended users and providing attackers with the possibility of arbitrary code execution.&#8221; reads the advisory. &#8220;This could cause high impact on confidentiality integrity and availability of the system.&#8221; Experts advise discontinuing the use of SQL Anywhere Monitor and deleting all existing monitor database instances as a temporary workaround. SAP also addressed a critical code injection vulnerability, tracked as CVE-2025-42887 (CVSS score of 9.9), in SAP Solution Manager. The flaw is due to missing input sanitation, an attacker can trigger the flaw to insert malicious code when calling a remote-enabled function module. &#8220;Due to missing input sanitation, SAP Solution Manager allows an authenticated attacker to insert malicious code when calling a remote-enabled function module.&#8221; reads the advisory. &#8220;This could provide the attacker with full control of the system hence leading to high impact on confidentiality, integrity and availability of the system.&#8221; SAP also released an update to the Security Note released on October 2025 Patch Day that addressed a critical security hardening for insecure deserialization in SAP NetWeaver AS Java tracked as CVE-2025-42944. It is unclear if any of the security flaws addressed by the company this month have been actively exploited in attacks in the wild. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, SQL Anywhere Monitor)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}