{
  "id": "ciberseguridad-latam-ciberseguridadlatam-com-2025-11-12-e2fa76f4",
  "source_id": "ciberseguridad-latam-ciberseguridadlatam-com",
  "guid": "https://ciberseguridadlatam.com/?p=19718",
  "title": "Hacia un marco normativo actualizado en protección de datos personales como base para una regulación responsable de la inteligencia artificial",
  "url": "https://ciberseguridadlatam.com/hacia-un-marco-normativo-actualizado-en-proteccion-de-datos-personales-como-base-para-una-regulacion-responsable-de-la-inteligencia-artificial/",
  "published_at": "2025-11-12T20:57:38+00:00",
  "fetched_at": "2025-11-13T11:20:06.197274+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Por Facundo Malaureille &#8211; Socio en www.datagovernancelatam.com La acelerada expansión de la inteligencia artificial (IA) en todos los ámbitos de la vida social, económica y estatal plantea desafíos sin precedentes para la protección de los derechos fundamentales. Entre ellos, el derecho a la privacidad y a la protección de los datos personales ocupa un lugar central. En este contexto, resulta indispensable contar con un marco normativo actualizado, sólido y coherente en materia de datos personales, como condición previa para avanzar hacia una regulación específica de la IA. La experiencia europea ofrece una referencia clara en este sentido. La Unión Europea consolidó primero un régimen integral de protección de datos a través del Reglamento General de Protección de Datos (RGPD), que estableció principios, derechos y obligaciones aplicables tanto al sector público como al privado. Este marco no solo fortaleció la confianza de los ciudadanos en el tratamiento de sus datos, sino que también generó seguridad jurídica para las empresas e instituciones que desarrollan o utilizan tecnologías digitales. Sobre esa base, la Unión Europea pudo avanzar en una regulación específica de la inteligencia artificial —el Reglamento de IA (AI Act)—, que reconoce distintos niveles de riesgo y establece obligaciones proporcionadas según el impacto de cada sistema. La existencia previa de un régimen robusto de protección de datos personales fue clave para definir las garantías, responsabilidades y mecanismos de control del uso de la IA, evitando contradicciones normativas y asegurando coherencia en la protección de derechos. En Argentina, la Ley 25.326 de Protección de los Datos Personales, sancionada en el año 2000, fue pionera en la región, pero hoy muestra signos claros de desactualización frente al nuevo ecosistema digital. Conceptos como la toma de decisiones automatizadas, la portabilidad de datos, el tratamiento masivo en entornos de IA o la supervisión algorítmica no cuentan con una regulación específica ni con salvaguardas suficientes. Por ello, actualizar la legislación de protección de datos personales debe ser un paso prioritario y urgente, no solo para alinearnos con estándares internacionales como el RGPD, sino también para sentar las bases jurídicas y éticas que permitan luego abordar, con rigor y legitimidad, una ley específica sobre inteligencia artificial. Un marco moderno de protección de datos permitirá:• Asegurar la transparencia, explicabilidad y rendición de cuentas en los sistemas de IA.• Proteger los derechos de los ciudadanos frente a decisiones automatizadas o perfiles algorítmicos.• Fomentar la innovación responsable, garantizando un entorno de confianza.• Fortalecer el rol de la autoridad de control, dotándola de herramientas efectivas de supervisión. La inteligencia artificial ofrece oportunidades extraordinarias, pero también exige un andamiaje normativo progresivo y coherente. Primero, debemos garantizar que los datos sobre los cuales se entrena y opera la IA sean tratados bajo estándares actualizados de protección y ética. Solo así podremos avanzar hacia una regulación de la IA que sea eficaz, legítima y centrada en las personas.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}