{
  "id": "cyberscoop-2025-11-12-df89e3bf",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86779",
  "title": "Congressional Dems press governors to block feds from accessing state DMV data",
  "url": "https://cyberscoop.com/congressional-dems-press-governors-to-block-feds-from-accessing-state-dmv-data/",
  "published_at": "2025-11-12T21:25:39+00:00",
  "fetched_at": "2025-11-13T11:20:21.255178+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Forty Democratic members of the House and Senate issued a joint letter Wednesday to 19 states led by Democratic governors, urging them to block Immigrations and Customs Enforcement and other federal agencies from accessing driver’s license and registration data in their states. The letter, led by Senator Ron Wyden, D-Ore., and Rep. Adriano Espaillat, D-N.Y., to follow the lead of states like New York, Illinois, Massachusetts, Minnesota and Washington in pulling out of data sharing agreements with a state-led consortium known as The International Justice and Public Safety Network (NIets), a nonprofit that shares state data with police agencies. &nbsp;Doing so, the members argued, will protect citizens of their states from federal overreach by “federal agencies that are now acting as Trump’s shock troops.”“This common sense step will improve public safety and guard against Trump officials using your state’s data for unjustified, politicized actions, while still allowing continued collaboration on serious crimes,” the congressional Democrats’ wrote. Citing data provided to Congress by NIets, between Oct. 1, 2024 and Oct. 1 2025, the consortium processed over 290 million requests for state DMV data across 18,000 federal, state, local, tribal and territorial governments in the US and Canada. Those requests included nearly 300,000 from ICE and another 605,000 by Homeland Security Investigations (HSI), an agency housed within the Department of Homeland Security. While states can choose what data they share with NIets, the letter claims that the Arizona Department of Public Safety “provides law enforcement agencies outside your state with real time access to your state Department of Motor Vehicles (DMV) database, which includes driver’s licenses and other state issued ID cards” through NIets. This effectively means that whatever states share with Arizona are subsequently sent to law enforcement agencies around the country. ““To be clear, blocking agencies’ unfettered access to your state’s data through Nlets will not prevent federal law enforcement from obtaining information needed to investigate serious crimes, but taking these measures will significantly increase accountability and reduce abuse by permitting your state employees to review data requests from blocked agencies first,” the members wrote. When reached for comment, a spokesperson for the Arizona Department of Public Safety referred CyberScoop to the Arizona Department of Transportation, which manages the state&#8217;s Motor Vehicles Division. While all 50 states and Washington D.C. allow law enforcement to look up DMV data using a driver’s license number, at least 20 states and D.C. allow searches by name and date of birth, something congressional Democrats warned could facilitate broader dragnet-style surveillance. Additionally, 41 states share driver’s license photos with law enforcement upon request, something that could feed facial recognition software programs around the country. Agencies like ICE have developed massive facial recognition databases that play a central role in immigration enforcement and citizenship validation, according to 404 Media, though it’s not clear if that database includes driver’s license photos. Officials at DHS and the Department of Government Efficiency also made numerous technical updates this year to another federal database, the Systemic Alien Verification System (SAVE), to check the citizenship of voters. The database was altered to allow states to run bulk searches and merged with Social Security data, and the federal government has spent the past year collecting or demanding more state-level data on voters, including DMV information. The letter urges Democratic governors to consult with their state NIets coordinator, stating the belief that due to technical complexities with how the system works and how requests are processed, many states may not even be aware of what they’re doing. “Because of the technical complexity of Nlets’ system, few state government officials understand how their state is sharing their residents’ data with federal and out-of-state agencies,” they wrote. “Critically, it seems apparent that elected officials accountable to voters, including governors, attorneys general, and legislators have not been fully briefed on the current scale of state information sharing with ICE and other federal agencies, nor the availability of technical controls to restrict data sharing with these federal agencies.” The post Congressional Dems press governors to block feds from accessing state DMV data appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}