{
  "id": "cyberscoop-2025-11-12-64f89b3f",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86747",
  "title": "Maryland man faces federal charges for crimes allegedly linked to 764",
  "url": "https://cyberscoop.com/erik-lee-madison-alleged-764-member-arrested/",
  "published_at": "2025-11-12T16:37:32+00:00",
  "fetched_at": "2025-11-13T11:20:21.257059+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A 20-year-old Maryland man allegedly associated with violent extremist group 764 is in federal custody, facing charges for sexual exploitation of children, online coercement and enticement, and cyberstalking.&nbsp; Erik Lee Madison, of Halethorpe, Maryland, is accused of victimizing at least five children this fall, including one as young as 13 at the time. His alleged criminality dates back to 2020 when he was a minor. Madison’s alleged association with 764, an offshoot of The Com, and the crimes he’s accused of follow a common thread of nihilistic violent extremism. Members of the loose-knit collective and associated groups, which spans thousands of people, typically between 11 and 25 years old, commit financially motivated, sexual and violent crimes, according to the FBI. Prosecutors accuse Madison of targeting, stalking and coercing his victims on Discord, Roblox, Instagram, Snapchat and Telegram. Authorities have warned that 764 members use these services to target minors. Some of these platforms sent tips to authorities to report on Madison’s alleged crimes.&nbsp; Investigators found multiple pieces of evidence linking Madison to these alleged crimes on his iCloud accounts. The FBI, pursuant to a warrant, searched Madison’s residence Nov. 6 and found multiple accounts and files on his phone linking him to his alleged crimes, according to an affidavit filed in the U.S. District Court for the District of Maryland.&nbsp; Madison’s mother provided authorities with the password to his phone. Prosecutors accuse Madison of coercing his victims to create child sexual abuse material and commit self harm and animal torture under threat of harm to the victims, their families and friends.&nbsp; Madison’s arrest comes amid a heightened period of law enforcement activity targeting alleged 764 members and leaders. Baron Cain Martin, 21, of Tucson, Arizona, allegedly joined the child sextortion ring as early as 2019, eventually acting as a leader until his arrest late last year. Martin faces 29 charges and, if convicted, up to life in prison. Tony Christopher Long, a 19-year-old California man, pleaded not guilty last month to multiple charges carrying a maximum penalty up to 69 years in prison related to his alleged involvement in the nihilistic violent extremist group.&nbsp; Two alleged leaders of 764, Leonidas Varagiannis and Prasan Nepal, were arrested and charged for directing and distributing CSAM in April. The two men are accused of exploiting at least eight minor victims, some as young as 13 years old, and face charges that carry a maximum penalty of life in prison. “We are now seeing the fruits of the government recognizing this as a priority,” Allison Nixon, chief research officer at Unit 221B, told CyberScoop. “Law enforcement has learned a lot in the past few years about these emerging groups and what to look for. The nature of law enforcement will always be reactive, but they are reacting.” Madison was known to authorities for years and had multiple run-ins with law enforcement while he was a minor.&nbsp; Baltimore County Police investigated Madison in May 2020, acting on a tip from Instagram. Madison admitted to a detective that he sent an image depicting child sexual abuse material to another user. The case was closed after the detective explained laws, appropriate internet behavior and proper supervision of teenagers online, according to court records. In February 2022, the FBI got involved after one of his alleged victim’s parents reported to law enforcement that Madison possessed CSAM and was stalking their child. When an FBI agent interviewed Madison at his residence with his mother’s consent, he admitted to communicating with the girl on Instagram and Snapchat. The FBI agent, at the time, advised Madison to cease all communications with the child and informed him about the legal consequences of his actions. A few months later, in June 2022, Madison posted a video of himself sexually abusing his dog, according to court records. When law enforcement seized his phone and conducted forensics, investigators found CSAM. Madison was charged as a minor with animal abuse and possession of CSAM.&nbsp; Madison’s alleged yearslong criminality underscores the persistent cycle of hate and violent crime that 764 engenders among its members. The FBI previously said members of 764 and related groups are driven by a range of personal motives, including notoriety, sexual gratification or a sense of belonging.&nbsp; Martin wasn’t prominent in 764, but many members blend together in their attempt to achieve infamy, according to Nixon.&nbsp; “The problem is complicated by how many of them start before 18. When both sides in an incident are underage, it falls on law enforcement to exercise discretion,” she said. “His 2020 and 2022 interactions with law enforcement had red flags showing it wasn’t a normal teenager relationship.” Knowledge of 764 wasn’t widespread at that time. “I think if a detective in 2025 was working the same set of facts, they would have reacted more forcefully,” Nixon said.&nbsp; She also questioned what resources or type of rehabilitation program could help in cases linked to 764.&nbsp; “I don’t think a good program exists that can break the intense human relationships that bond members of violent internet street gangs,” Nixon said. “It’s a huge factor in reoffending.” You can read the full affidavit below. ErikLeeMadison-affidavit-filedNov72025Download The post Maryland man faces federal charges for crimes allegedly linked to 764 appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}