{
  "id": "schneier-on-security-2025-11-12-fd1f7486",
  "source_id": "schneier-on-security",
  "guid": "https://www.schneier.com/?p=71128",
  "title": "On Hacking Back",
  "url": "https://www.schneier.com/blog/archives/2025/11/on-hacking-back.html",
  "published_at": "2025-11-12T12:01:53+00:00",
  "fetched_at": "2025-11-13T11:18:14.821635+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Former DoJ attorney John Carlin writes about hackback, which he defines thus: &#8220;A hack back is a type of cyber response that incorporates a counterattack designed to proactively engage with, disable, or collect evidence about an attacker. Although hack backs can take on various forms, they are&#8212;­by definition­&#8212;not passive defensive measures.&#8221; His conclusion: As the law currently stands, specific forms of purely defense measures are authorized so long as they affect only the victim’s system or data. At the other end of the spectrum, offensive measures that involve accessing or otherwise causing damage or loss to the hacker’s systems are likely prohibited, absent government oversight or authorization. And even then parties should proceed with caution in light of the heightened risks of misattribution, collateral damage, and retaliation. As for the broad range of other hack back tactics that fall in the middle of active defense and offensive measures, private parties should continue to engage in these tactics only with government oversight or authorization. These measures exist within a legal gray area and would likely benefit from amendments to the CFAA and CISA that clarify and carve out the parameters of authorization for specific self-defense measures. But in the absence of amendments or clarification on the scope of those laws, private actors can seek governmental authorization through an array of channels, whether they be partnering with law enforcement or seeking authorization to engage in more offensive tactics from the courts in connection with private litigation.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}