{
  "id": "security-affairs-securityaffairs-co-2025-11-12-908cb98e",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184507",
  "title": "Microsoft Patch Tuesday security updates for November 2025 fixed an actively exploited Windows Kernel bug",
  "url": "https://securityaffairs.com/184507/security/microsoft-patch-tuesday-updates-for-november-2025-fixed-an-actively-exploited-windows-kernel-bug.html",
  "published_at": "2025-11-12T06:14:09+00:00",
  "fetched_at": "2025-11-12T11:21:05.059436+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Microsoft fixed over 60 flaws, including an actively exploited Windows kernel zero-day, in its latest Patch Tuesday updates. Microsoft’s Patch Tuesday security updates for November 2025 addressed 63 vulnerabilities impacting Windows and Windows Components, Office and Office Components, Microsoft Edge (Chromium-based), Azure Monitor Agent, Dynamics 365, Hyper-V, SQL Server, and the Windows Subsystem for Linux GUI. Four of these vulnerabilities are rated as Critical and 59 are rated Important in severity. None of the vulnerabilities addressed this month was publicly known at the time of release. &#8220;This release is a far cry from the 177 CVEs we saw last month, although I don’t think anyone will complain.&#8221; reads the post published by ZDI. &#8220;This drop could also be due to the fact that this is the first month where Windows 10 is not receiving updates. We will see what December brings and how close we end up to the record total of CVEs set back in 2020. &#8220; Microsoft warns that a Windows Kernel Elevation of Privilege Vulnerability, tracked as CVE-2025-62215 (CVSS score of 7), has been under active attack. &#8220;Concurrent execution using shared resource with improper synchronization (&#8216;race condition&#8217;) in Windows Kernel allows an authorized attacker to elevate privileges locally.&#8221; reads the advisory. &#8220;Successful exploitation of this vulnerability requires an attacker to win a race condition. An attacker who successfully exploited this vulnerability could gain SYSTEM privileges.&#8221; Microsoft also addressed an Office Remote Code Execution Vulnerability tracked as CVE-2025-62199. The issue is a use after free in Microsoft Office that allows an unauthorized attacker to execute code locally. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Patch Tuesday)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}