{
  "id": "security-affairs-securityaffairs-co-2025-11-12-e5a3dc45",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184548",
  "title": "New Danabot Windows version appears in the threat landscape after May disruption",
  "url": "https://securityaffairs.com/184548/malware/new-danabot-windows-version-appears-in-the-threat-landscape-after-may-disruption.html",
  "published_at": "2025-11-12T19:18:29+00:00",
  "fetched_at": "2025-11-13T11:21:56.152084+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "DanaBot returns after 6 months with a new Windows variant (v669), marking its comeback after being disrupted by Operation Endgame in May. DanaBot has resurfaced with a new variant (version 669) targeting Windows systems, six months after Operation Endgame disrupted its activity in May, according to Zscaler ThreatLabz. The researchers identified a set of command and control servers used in the latest campaign, along with wallet addresses used by its operators. Danabot has resurfaced with version 669 after nearly a 6 month hiatus following the Operation Endgame law enforcement actions in May. The current C2s are the following:62.60.226[.]146:44362.60.226[.]154:44380.64.19[.]39:443… pic.twitter.com/B8ABhP17eV&mdash; Zscaler ThreatLabz (@Threatlabz) November 10, 2025 DanaBot is a multi-stage modular banking Trojan written in Delphi that first appeared on the threat landscape in 2018. The malware implements a modular structure that allows operators to support new functionalities by adding new plug-ins. The malicious code is offered through a malware-as-a-service (MaaS) model, crooks pay a subscription fee to rent it. The DanaBot banking Trojan initially targeted Australia and Poland users, then it has expanded in other countries, including Italy, Germany, Austria, and as of September 2018, Ukraine. The malicious code continues to evolve, experts observed several campaigns targeting users in Australia, North America, and Europe. In May, an international law enforcement operation, called Operation Endgame targeted initial access malware used by threat actors to infiltrate systems prior to ransomware deployment. Neutralized strains include Bumblebee, Lactrodectus, Qakbot, Hijackloader, DanaBot, Trickbot, and Warmcookie, all commonly used in ransomware-as-a-service schemes. Authorities also issued 20 international arrest warrants for key operators. The joint actions were carried out by authorities in the Netherlands, Germany, France, Denmark, United States, and the United Kingdom with support from Europol and Eurojust. In addition, with the cooperation of the aforementioned authorities, there have also been police actions in Ukraine, Switzerland, Armenia, Portugal, Romania, Canada, Lithuania and Bulgaria for the arrest or interrogation of suspects, searches or the seizure and downing of servers. Zscaler shared indicators of compromise (IoCs) associated with the latest campaign. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, malware)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}