{
  "id": "security-affairs-securityaffairs-co-2025-11-12-b031845b",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184521",
  "title": "$7.3B crypto laundering: ‘Bitcoin Queen’ sentenced to 11 Years in UK",
  "url": "https://securityaffairs.com/184521/cyber-crime/7-3b-crypto-laundering-bitcoin-queen-sentenced-to-11-years-in-uk.html",
  "published_at": "2025-11-12T07:42:07+00:00",
  "fetched_at": "2025-11-12T11:21:05.059079+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "“Bitcoin Queen” Zhimin Qian gets 11 years in London for laundering $7.3B from a crypto scam that defrauded 128K victims in China. A British court sentenced a Chinese woman, Zhimin Qian (47), also known as the &#8220;Bitcoin Queen,&#8221; to 11 years and eight months in jail for laundering $7.3B from a crypto scam that defrauded 128K victims in China. In September, UK authorities raided the London home of Chinese national Zhimin Qian, also known as Yadi Zhang, and confiscated £5.5 billion (about $7.39 billion) in cryptocurrency, totaling 61,000 Bitcoin. Police described it as the largest such seizure worldwide. Qian admitted at Southwark Crown Court to offenses related to the acquisition and possession of illicit cryptocurrency. “The Met Police has made what is believed to be the single largest cryptocurrency seizure in the world, worth, at this time, more than £5.5 billion.”&nbsp;reported the Metropolitan Police. “It follows a seven-year ongoing investigation by the Met’s Economic Crime team into international money laundering, which today has seen the leading figure convicted for her crimes.” The Metropolitan Police announced the £5.5B crypto seizure stemmed from a 2018 probe into Zhang’s fraud in China (2014–2017) that duped 128,000 victims, mostly aged between 50 and 75, with false investment promises. Zhang, arrested in April 2024, lured victims with daily dividends and guaranteed profits, then converted proceeds into Bitcoin. After fleeing China with false documents, Zhang entered the U.K. in 2018 and tried to launder fraud proceeds by buying property with the help of an assailant, Jian Wen. Wen aided in moving a wallet holding 150 Bitcoin, then worth £1.7M, and received a six-year, eight-month sentence in May. In January, a court ordered her to repay over £3.1M or face extra prison time. The case highlights the scale of illicit crypto laundering linked to Zhang’s massive fraud scheme. UK is clashing with China over this record crypto fraud fortune, London is counting on the seized billions for budget plans. An accomplice, Seng Hok Ling (47), was sentenced to nearly five years for transferring illicit cryptocurrency under the Proceeds of Crime Act. &#8220;A landmark Met investigation involving the single largest confirmed cryptocurrency seizure in the world – affecting thousands of victims – has seen two more people sentenced for their crimes. It follows a seven-year investigation by the Met’s Economic Crime team into international money laundering.&#8221; reads the press release published by Met Police. &#8220;Zhimin Qian, 47 (04.09.78), of no fixed address was sentenced to 11 years and eight months imprisonment for one charge of possessing and one charge of transferring criminal property, namely crypto-currency, under the Proceeds of Crime Act (2002). Seng Hok Ling, 47 (06.03.78) of Morningside Walk, Matlock, Derbyshire, was handed a four years and 11 month sentence for transferring criminal property, namely cryptocurrency, under the Proceeds of Crime Act (2002).&#8221; Met&#8217;s Head of Economic and Cybercrime Command Will Lyne said the case was among their largest economic crime probes, stressing that crypto crimes leave traces that help track offenders. “Money laundering isn’t just against the law; it puts real people at risk and lines the pockets of criminals.&#8221; said Security Minister, Dan Jarvis. “This tough prison sentence should make anyone thinking of getting involved in these crimes think twice. My thanks go to the Metropolitan Police and CPS for their vital work ensuring justice was served. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Bitcoin Queen)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}