{
  "id": "security-affairs-securityaffairs-co-2025-11-12-781e2085",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184557",
  "title": "Google sues cybercriminal group Smishing Triad",
  "url": "https://securityaffairs.com/184557/cyber-crime/google-sues-cybercriminal-group-smishing-triad.html",
  "published_at": "2025-11-12T20:25:09+00:00",
  "fetched_at": "2025-11-13T11:21:56.151801+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Google sues China-based group using “Lighthouse” phishing kit in large-scale smishing attacks to steal victims’ financial data. Google filed a lawsuit against a cybercriminal group largely based in China that is behind a massive text message phishing operation, or “smishing.” The organization uses a phishing-as-a-service kit named “Lighthouse” to steal sensitive financial information by sending fraudulent text messages. The tech giant has filed claims under the Racketeer Influenced and Corrupt Organizations (RICO) Act, the Lanham Act, and the Computer Fraud and Abuse (CFAA) Act. First detailed in August 2023 by Resecurity, a California-based cybersecurity company protecting Fortune 100 companies and governments worldwide, Smishing Triad’s activity affected consumers across the globe, including Australia, Austria, France, Greece, Germany, Italy, the U.S., the U.K., the Kingdom of Saudi Arabia, the UAE, and New Zealand. According to Resecurity, the “LightHouse” kit distribution was organized through Telegram. The identified templates include fake pages impersonating UPS, USPS, the UK government, and various telecoms. According to Google, the Smishing Triad’s operations have comprised between 12.7 million and 115 million credit cards in the U.S. alone, with victims spanning across 120 countries. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, malware)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}