{
  "id": "daily-dark-web-rss-app-2025-11-21-429361a3",
  "source_id": "daily-dark-web-rss-app",
  "guid": "463595e5dfa431f428c9a88b85e5059d",
  "title": "National Telecom Public Company Limited Data Breach Exposes 1.2M Records",
  "url": "https://dailydarkweb.net/national-telecom-public-company-limited-data-breach-exposes-1-2m-records/",
  "published_at": "2025-11-21T09:07:31+00:00",
  "fetched_at": "2025-11-21T11:17:06.156817+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "National Telecom Public Company Limited Data Breach Exposes 1.2M Records Discover the latest security threats and database leaks, including unauthorized VPN access and email breaches, in the cyber underground world.Stay informed about emerging cyber threats, such as unauthorized access to databases and sensitive information leaks, affecting global companies and organizations.Learn about the latest cyber incidents, including DDoS attacks and malware threats targeting cryptocurrency wallets and financial institutions.",
    "full": "A threat actor claims to have compromised the systems of National Telecom Public Company Limited (NT), Thailand’s state-owned telecommunications enterprise. established in 2021 through the merger of CAT Telecom and TOT Public Company Limited, NT provides fixed-line telephony, mobile services, and international telecommunications infrastructure. The actor is currently offering the alleged dataset for sale on a dark web forum for a price of $300.\nAccording to the actor, the breach encompasses approximately 1,197,636 lines of data. A sample provided by the seller suggests the stolen database contains highly detailed customer and technical service logs.\nThe allegedly compromised data includes:\n-\nCustomer Personal Information: Full names, usernames, addresses, and mobile phone numbers.\n-\nService Details: Tariff plans, internet speeds, offer IDs, and payment dates.\n-\nTechnical Geolocation Data: Connection locations (latitude/longitude coordinates) and wire distances.\n-\nHardware Information: Connection devices, device serial numbers, and OLT (Optical Line Terminal) IP addresses.\n-\nInstallation Data: Circuit IDs, installation costs, and technician notes.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-22T15:00:18.309565+00:00Z"
}