{
  "id": "the-hacker-news-feeds-feedburner-com-2025-11-21-ad4eeb0d",
  "source_id": "the-hacker-news-feeds-feedburner-com",
  "guid": "https://thehackernews.com/2025/11/sec-drops-solarwinds-case-after-years.html",
  "title": "SEC Drops SolarWinds Case After Years of High-Stakes Cybersecurity Scrutiny",
  "url": "https://thehackernews.com/2025/11/sec-drops-solarwinds-case-after-years.html",
  "published_at": "2025-11-21T08:05:00+00:00",
  "fetched_at": "2025-11-21T11:17:15.097904+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The U.S. Securities and Exchange Commission (SEC) has abandoned its lawsuit against SolarWinds and its chief information security officer, alleging that the company had misled investors about the security practices that led to the 2020 supply chain attack. In a joint motion filed November 20, 2025, the SEC, along with SolarWinds and its CISO Timothy G. Brown, asked the court to voluntarily",
    "full": "The U.S. Securities and Exchange Commission (SEC) has abandoned its lawsuit against SolarWinds and its chief information security officer, alleging that the company had misled investors about the security practices that led to the 2020 supply chain attack.\nIn a joint motion filed November 20, 2025, the SEC, along with SolarWinds and its CISO Timothy G. Brown, asked the court to voluntarily dismiss the case.\nThe SEC said its decision to seek dismissal \"does not necessarily reflect the Commission's position on any other case.\"\nSolarWinds and Brown were accused by the SEC in October 2023 of \"fraud and internal control failures\" and that the company defrauded investors by overstating its cybersecurity practices and understating or failing to disclose known risks.\nThe agency also said both SolarWinds and Brown ignored \"repeated red flags\" and failed to adequately protect its assets, ultimately leading to the supply chain compromise that came to light in late 2020. The attack was attributed to a Russian state-sponsored threat actor known as APT29.\n\"Brown was aware of SolarWinds' cybersecurity risks and vulnerabilities but failed to resolve the issues or, at times, sufficiently raise them further within the company,\" the SEC alleged at the time.\nHowever, in July 2024, many of these allegations were thrown out by the U.S. District Court for the Southern District of New York (SDNY), stating \"these do not plausibly plead actionable deficiencies in the company's reporting of the cybersecurity hack\" and that they \"impermissibly rely on hindsight and speculation.\"\nSubsequently, the SEC also charged Avaya, Check Point, Mimecast, and Unisys for making \"materially misleading disclosures\" related to the large-scale cyber attack that stemmed from the SolarWinds hack.\nIn a statement, SolarWinds CEO Sudhakar Ramakrishna said the latest development marks the end of an era that challenged the company, and emphasized \"we emerge stronger, more secure, and better prepared than ever for what lies ahead.\"",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-22T15:00:19.159365+00:00Z"
}