{
  "id": "bellingcat-bellingcat-com-2025-11-05-0309e8e7",
  "source_id": "bellingcat-bellingcat-com",
  "guid": "https://www.bellingcat.com/?p=50155",
  "title": "Geolocating Darfur Killings of Those Escaping Al Fashir",
  "url": "https://www.bellingcat.com/news/2025/11/05/geolocating-darfur-killings-of-those-escaping-al-fashir/",
  "published_at": "2025-11-05T13:35:27+00:00",
  "fetched_at": "2025-11-06T11:14:22.166902+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Warning: Contains written descriptions of extreme violence including murder. All graphic footage has been omitted. A Bellingcat investigation has identified and verified the exact location of a mass killing of more than 80 people that took place near Al Fashir during the recent siege and takeover of the Sudanese city by the paramilitary Rapid Support Forces (RSF). More than a dozen videos which have emerged online since Oct. 27 were analysed, some filmed by fighters wearing what appears to be RSF insignia, showing the events and their aftermath. RSF fighter filming himself at the scene with visible shoulder-patch insignia. Bellingcat blurred the face and bodies in the background. Credit: X/Himma0099 Al Fashir, the capital of North Darfur, was the last major stronghold of the Sudanese military in the region and a refuge for people fleeing nearby villages and towns. The city, considered a strategic military location near the southwestern border leading to Chad and South Sudan, fell last week after more than 500 days under RSF siege. The RSF, which has been fighting Sudan’s military for control over the country, killed at least 1,500 people during the takeover, according to the Sudan Doctors Network. A Mass Killing Outside the City Open source evidence reviewed by Bellingcat showed that people attempting to flee Al Fashir were killed by men, some of whom appeared to be wearing RSF uniforms. The RSF had earlier pledged to remain “firmly committed to protect the civilians” and “not tolerate any attempts to exploit their lives or tamper with their security.” Footage posted on social media showed a mass killing more than seven kilometres outside the city, where the fleeing convoy had encountered an earthen berm encircling Al Fashir. The berm and an accompanying trench were built by the RSF during the siege. Satellite imagery indicates that the section to the north-west of the city, where the mass killing took place, was constructed throughout August. Satellite imagery of Oct. 27, showing the berm and trench dug around Al Fashir, checkpoints for roads leaving the city and the location of the mass killing. Satellite image credit: Planet Labs PBC Bellingcat analysed more than a dozen videos. Given the extreme violence visible in much of the footage, only material that was not explicitly graphic has been included in this report. Some of the videos filmed at this location have also been geolocated by the Centre for Information Resilience and others. Cross-referencing the different camera angles in the videos made it possible to map the exact location of the killings to a single location: 13.71340, 25.27854. In satellite imagery, clusters of dark shapes around the vehicles north of the berm correspond to the locations of bodies identified in verified videos from the scene. Satellite imagery showing the convoy of burned vehicles and clusters of bodies by the berm, with corresponding screengrabs of videos geolocated to locations around the site. Satellite image credit: Vantor In total, the video footage showed more than 80 bodies lying beside damaged and burning vehicles along the berm, inside the adjacent trench and across the surrounding area. More than two dozen destroyed vehicles were also identified. Support Bellingcat Your donations directly contribute to our ability to publish groundbreaking investigations and uncover wrongdoing around the world. Donate In one video, filmed early on in the attack, fighters in what appear to be RSF uniforms are seen taking cover behind a vehicle as gunfire is heard. One fighter can be seen closing in on the burning convoy and aiming his weapon.&nbsp; However, in later videos filmed by the fighters showing the aftermath of the attack, none of the casualties visible appeared to be in possession of weapons; almost all appeared to be dressed in civilian clothing and several were women. Of the more than 80 casualties visible in various videos, a couple can be seen wearing what appears to be dark, military-style clothing, and one can be seen lying next to a belt of ammunition. Although, it is unclear who the belt belonged to. The arrangement of destroyed vehicles and groups of bodies in the videos matched what was visible in satellite imagery. Moreover, tyre tracks visible in the sand appeared to link the mass killing site with the checkpoints along the sand berm. Fresh marks appeared on satellite images after Oct. 27., the day of the RSF’s complete takeover of Al Fashir. Panorama of video footage taken at the site. The burnt vehicles in the background could also be identified on satellite imagery. Video: x.com/hodajannat24 A RSF commander known as Abu Lulu, identified in the videos by his distinctive white scarf, appeared in at least three videos from the scene. The commander has previously been featured in social media footage from the conflict. On Oct. 31, TikTok removed a profile believed to be linked to him. In one video, geolocated by Bellingcat to the far side of the berm, the commander can be seen and heard taunting a group of 10 male captives sitting lined up on the ground, forcing them to praise the RSF and denigrate the military before they are shot. Screenshots of the video showing RSF commander Abu Lulu talking to the 10 male captives before they were shot. Distinct features in the background of the video allowed geolocation of the scene. Satellite image credit: Vantor Video credit: X/Sudan_tweet In another video filmed to the west of the convoy, Abu Lulu can be heard questioning a wounded man lying on the ground, threatening sexual violence before shooting him at point-blank range. In a third video filmed meters away, the same commander can be seen standing among a number of motionless bodies as he repeatedly fires into them. In several other videos, one fleeing vehicle appears to have crossed the berm before becoming stuck in the trench on the far side. In one of these videos, filmed from inside the trench, a fighter can be seen firing into a group of motionless bodies on the ground next to the car, while others film and celebrate. UN Investigation Points to a Pattern Morris Tidball-Binz, the UN Special Rapporteur on extrajudicial, summary or arbitrary executions, told Bellingcat that “if the images were genuine”, these were “unlawful killings under International Human Rights Law, International Humanitarian Law (IHL) and International Criminal Law.” “Under the former they correspond to extrajudicial or arbitrary executions; under IHL they correspond to war crimes and under the latter they may amount to crimes against humanity in view of the number of victims and the seemingly planned and systematic nature of the killings,” he said. Subscribe to the Bellingcat newsletter Subscribe to our newsletter for first access to our published content and events that our staff and contributors are involved with, including interviews and training workshops. Tidball-Binz added that he was not aware of any steps taken by RSF command or relevant authorities to investigate these incidents or hold those responsible accountable. “So far impunity has prevailed,” he stated via email. Footage from Oct. 30. shows Abu Lulu in RSF custody, being transported under heavy guard and later incarcerated in Shala Prison on the western edge of the city. The RSF announced an investigation into “violations” committed by fighters following the capture of Al Fashir. Other open source data also documented evidence of atrocities within the city itself. In a chapter of a detailed report entitled “evidence of mass killings”, satellite imagery analysis by Yale’s Humanitarian Research Lab from Oct. 27 found what it said were “objects consistent with the size of human bodies on the ground near RSF vehicles” and “instances of reddish earth discoloration”. The UN Security Council condemned the assault by the RSF on Al Fashir and “its devastating impact on the civilian population.” The UN Fact-Finding Mission on Sudan expressed “grave alarm at escalating atrocities” detailing “a devastating pattern of atrocities by both warring parties” that include “war crimes of violence to life and person”. The mission’s initial findings pointed to “a deliberate pattern of ethnically targeted executions of unarmed civilians, assaults, sexual violence, widespread looting and destruction of vital infrastructure, and mass forced displacement”. The RSF now controls the entire Darfur region. Carlos Gonzales, Jake Godin and Logan Williams contributed to this report. Bellingcat is a non-profit and the ability to carry out our work is dependent on the kind support of individual donors. If you would like to support our work, you can do so here. You can also subscribe to our Patreon channel here. Subscribe to our Newsletter and follow us on Bluesky here and Mastodon here. The post Geolocating Darfur Killings of Those Escaping Al Fashir appeared first on bellingcat.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Geolocating Darfur Killings of Those Escaping Al Fashir\nWarning: Contains written descriptions of extreme violence including murder. All graphic footage has been omitted.\nA Bellingcat investigation has identified and verified the exact location of a mass killing of more than 80 people that took place near Al Fashir during the recent siege and takeover of the Sudanese city by the paramilitary Rapid Support Forces (RSF). More than a dozen videos which have emerged online since Oct. 27 were analysed, some filmed by fighters wearing what appears to be RSF insignia, showing the events and their aftermath.\nAl Fashir, the capital of North Darfur, was the last major stronghold of the Sudanese military in the region and a refuge for people fleeing nearby villages and towns. The city, considered a strategic military location near the southwestern border leading to Chad and South Sudan, fell last week after more than 500 days under RSF siege. The RSF, which has been fighting Sudan’s military for control over the country, killed at least 1,500 people during the takeover, according to the Sudan Doctors Network.\nA Mass Killing Outside the City\nOpen source evidence reviewed by Bellingcat showed that people attempting to flee Al Fashir were killed by men, some of whom appeared to be wearing RSF uniforms. The RSF had earlier pledged to remain “firmly committed to protect the civilians” and “not tolerate any attempts to exploit their lives or tamper with their security.”\nFootage posted on social media showed a mass killing more than seven kilometres outside the city, where the fleeing convoy had encountered an earthen berm encircling Al Fashir. The berm and an accompanying trench were built by the RSF during the siege. Satellite imagery indicates that the section to the north-west of the city, where the mass killing took place, was constructed throughout August.\nBellingcat analysed more than a dozen videos. Given the extreme violence visible in much of the footage, only material that was not explicitly graphic has been included in this report. Some of the videos filmed at this location have also been geolocated by the Centre for Information Resilience and others.\nCross-referencing the different camera angles in the videos made it possible to map the exact location of the killings to a single location: 13.71340, 25.27854. In satellite imagery, clusters of dark shapes around the vehicles north of the berm correspond to the locations of bodies identified in verified videos from the scene.\nIn total, the video footage showed more than 80 bodies lying beside damaged and burning vehicles along the berm, inside the adjacent trench and across the surrounding area. More than two dozen destroyed vehicles were also identified.\nSupport Bellingcat\nYour donations directly contribute to our ability to publish groundbreaking investigations and uncover wrongdoing around the world.\nIn one video, filmed early on in the attack, fighters in what appear to be RSF uniforms are seen taking cover behind a vehicle as gunfire is heard. One fighter can be seen closing in on the burning convoy and aiming his weapon.\nHowever, in later videos filmed by the fighters showing the aftermath of the attack, none of the casualties visible appeared to be in possession of weapons; almost all appeared to be dressed in civilian clothing and several were women. Of the more than 80 casualties visible in various videos, a couple can be seen wearing what appears to be dark, military-style clothing, and one can be seen lying next to a belt of ammunition. Although, it is unclear who the belt belonged to.\nThe arrangement of destroyed vehicles and groups of bodies in the videos matched what was visible in satellite imagery. Moreover, tyre tracks visible in the sand appeared to link the mass killing site with the checkpoints along the sand berm. Fresh marks appeared on satellite images after Oct. 27., the day of the RSF’s complete takeover of Al Fashir.\nA RSF commander known as Abu Lulu, identified in the videos by his distinctive white scarf, appeared in at least three videos from the scene. The commander has previously been featured in social media footage from the conflict. On Oct. 31, TikTok removed a profile believed to be linked to him.\nIn one video, geolocated by Bellingcat to the far side of the berm, the commander can be seen and heard taunting a group of 10 male captives sitting lined up on the ground, forcing them to praise the RSF and denigrate the military before they are shot.\nIn another video filmed to the west of the convoy, Abu Lulu can be heard questioning a wounded man lying on the ground, threatening sexual violence before shooting him at point-blank range. In a third video filmed meters away, the same commander can be seen standing among a number of motionless bodies as he repeatedly fires into them.\nIn several other videos, one fleeing vehicle appears to have crossed the berm before becoming stuck in the trench on the far side. In one of these videos, filmed from inside the trench, a fighter can be seen firing into a group of motionless bodies on the ground next to the car, while others film and celebrate.\nUN Investigation Points to a Pattern\nMorris Tidball-Binz, the UN Special Rapporteur on extrajudicial, summary or arbitrary executions, told Bellingcat that “if the images were genuine”, these were “unlawful killings under International Human Rights Law, International Humanitarian Law (IHL) and International Criminal Law.”\n“Under the former they correspond to extrajudicial or arbitrary executions; under IHL they correspond to war crimes and under the latter they may amount to crimes against humanity in view of the number of victims and the seemingly planned and systematic nature of the killings,” he said.\nSubscribe to the Bellingcat newsletter\nSubscribe to our newsletter for first access to our published content and events that our staff and contributors are involved with, including interviews and training workshops.\nTidball-Binz added that he was not aware of any steps taken by RSF command or relevant authorities to investigate these incidents or hold those responsible accountable. “So far impunity has prevailed,” he stated via email.\nFootage from Oct. 30. shows Abu Lulu in RSF custody, being transported under heavy guard and later incarcerated in Shala Prison on the western edge of the city. The RSF announced an investigation into “violations” committed by fighters following the capture of Al Fashir.\nOther open source data also documented evidence of atrocities within the city itself. In a chapter of a detailed report entitled “evidence of mass killings”, satellite imagery analysis by Yale’s Humanitarian Research Lab from Oct. 27 found what it said were “objects consistent with the size of human bodies on the ground near RSF vehicles” and “instances of reddish earth discoloration”.\nThe UN Security Council condemned the assault by the RSF on Al Fashir and “its devastating impact on the civilian population.”\nThe UN Fact-Finding Mission on Sudan expressed “grave alarm at escalating atrocities” detailing “a devastating pattern of atrocities by both warring parties” that include “war crimes of violence to life and person”. The mission’s initial findings pointed to “a deliberate pattern of ethnically targeted executions of unarmed civilians, assaults, sexual violence, widespread looting and destruction of vital infrastructure, and mass forced displacement”.\nThe RSF now controls the entire Darfur region.\nCarlos Gonzales, Jake Godin and Logan Williams contributed to this report.\nBellingcat is a non-profit and the ability to carry out our work is dependent on the kind support of individual donors. If you would like to support our work, you can do so here. You can also subscribe to our Patreon channel here. Subscribe to our Newsletter and follow us on Bluesky here and Mastodon here.",
      "enhanced_at": 1762427894.1181777,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:18:14.118533+00:00Z"
}