{
  "id": "bleeping-computer-2025-11-05-a0953b82",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-confirms-data-stolen-in-cyberattack/",
  "title": "University of Pennsylvania confirms data stolen in cyberattack",
  "url": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-confirms-data-stolen-in-cyberattack/",
  "published_at": "2025-11-05T16:04:50+00:00",
  "fetched_at": "2025-11-06T11:12:59.689250+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The University of Pennsylvania has confirmed that a hacker breached numerous internal systems related to the university's development and alumni activities and stole data in a cyberattack. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The University of Pennsylvania has confirmed that a hacker breached numerous internal systems related to the university's development and alumni activities and stole data in a cyberattack.\nIn a new statement, Penn confirmed BleepingComputer's reporting that the hackers breached its systems using compromised credentials, stating they were stolen in a social engineering attack.\n\"On October 31, Penn discovered that a select group of information systems related to Penn's development and alumni activities had been compromised,\" reads a new Penn statement.\n\"Penn employs a robust information security program; however, access to these systems occurred due to a sophisticated identity impersonation commonly known as social engineering.\"\n\"Penn's staff rapidly locked down the systems and prevented further unauthorized access; however, not before an offensive and fraudulent email was sent to our community and information was taken by the attacker. Penn is still investigating the nature of the information that was obtained during this time.\"\nThe University of Pennsylvania says it has notified the FBI of the breach and is working with CrowdStrike to investigate the security incident.\nAs first reported by BleepingComputer, the threat actor breached Penn's systems on October 30 using an employee's PennKey SSO account that provided access to the university's Salesforce instance, Qlik analytics platform, SAP business intelligence system, and SharePoint files.\nUsing this access, the threat actors stole 1.71 GB of internal documents from the university's SharePoint and Box storage platforms, including spreadsheets, documents, financial information, and alumni marketing materials.\nThe hackers also told BleepingComputer that they stole Penn's Salesforce donor marketing database, containing 1.2 million records with a wide variety of donor information.\nA sample of this data includes 158 distinct fields, which contain the following sensitive information:\n- Personally Identifiable Information (PII): full name, birthdate, gender, home and mailing addresses, phone numbers, and email addresses.\n- Financial and donor data: gift histories, wealth ratings, and lifetime commitment amounts.\n- Employment and affiliation details: employer, job title, and academic affiliations.\nAfter discovering their access had been revoked, the hacker said they still had access to Penn's Salesforce Marketing Cloud account and used it to send an offensive mass email to 700,000 recipients.\nIn a post on a hacking forum, the attackers say they are not currently leaking the data records but may do so in a month or two.\nWhile the hackers claimed the attack wasn't politically motivated and said their goal was Penn's \"vast, wonderfully wealthy donor database,\" both their emails and a post on a hacking forum were laced with sharp criticism of the university's alleged DEI practices, admissions policies, and \"love of nepobabies.\"\nThe University of Pennsylvania says it is taking steps to increase security on its systems, including employee training on social engineering attacks and enhanced monitoring and security measures.\nAfter the investigation is complete, Penn says it will notify those affected by the data breach.\nThe university is also warning Penn students and alumni to be wary of suspicious calls or emails that could be phishing attempts or social engineering attacks.\nSecrets Security Cheat Sheet: From Sprawl to Control\nWhether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start.\nGet the cheat sheet and take the guesswork out of secrets management.",
      "enhanced_at": 1762427862.712661,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:42.712983+00:00Z"
}