{
  "id": "bleeping-computer-2025-11-05-6dde8bc3",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/uk-carriers-to-block-spoofed-phone-numbers-in-fraud-crackdown/",
  "title": "UK carriers to block spoofed phone numbers in fraud crackdown",
  "url": "https://www.bleepingcomputer.com/news/security/uk-carriers-to-block-spoofed-phone-numbers-in-fraud-crackdown/",
  "published_at": "2025-11-05T16:33:51+00:00",
  "fetched_at": "2025-11-06T11:12:59.689011+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Under a new partnership with the government aimed at combating fraud, Britain's largest mobile carriers have committed to upgrading their networks to eliminate scammers' ability to spoof phone numbers within a year. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Under a new partnership with the government aimed at combating fraud, Britain's largest mobile carriers have committed to upgrading their networks to eliminate scammers' ability to spoof phone numbers within a year.\nThis agreement is part of the new Telecoms Charter, which brings together law enforcement, government agencies, and Britain's top mobile networks, including BT EE, Virgin Media O2, Vodafone Three, Tesco Mobile, TalkTalk, and Sky.\nIt requires carriers to upgrade their networks to indicate when calls originate from abroad, preventing fraudsters from impersonating banks, government agencies, and other trusted organizations.\n\"Advanced call tracing technology will also be rolled out across mobile networks to give police the intelligence to track down scammers operating across the country and dismantle their operations,\" the UK Home Office said in a Wednesday press release.\n\"New commitments to boost data sharing with the police will shine a light on the mobile networks that let scam calls slip through the net, empowering customers and making it harder for scams to go undetected.\"\nThe signatories have also committed to improving support for scam victims, reducing response times to two weeks, and establishing measurable goals for prompt fraud assistance.\nMurray Mackenzie (director of fraud prevention at Virgin Media O2) said the company has already blocked over 1 billion scam texts and flags 50 million suspicious calls monthly using AI, while Rachel Andrews (corporate security and fraud director at Vodafone Three) reported blocking millions of fraudulent calls and scam texts daily.\nAccording to data shared by the UK government today, 96% of mobile users check caller ID before answering, with three-quarters blocking calls from unknown international numbers, a trend exploited by scammers who spoof UK numbers to appear local and trustworthy.\n\"Spoofed calls allow scammers to deceive the public with fake identities and false promises. In a major upgrade of our mobile network, call spoofing will be eliminated within a year - stripping away the tools scammers use to cheat people out of their hard-earned cash,\" said Minister for Fraud Lord Hanson.\n\"We're stepping up our defences to protect victims and make sure the UK is the hardest place in the world for scammers to operate.\"\nDeputy Commissioner Nik Adams of the City of London Police also welcomed today's announcement, noting that fraud accounts for 50% of all crime in the United Kingdom.\nThe 2026 CISO Budget Benchmark\nIt's budget season! Over 300 CISOs and security leaders have shared how they're planning, spending, and prioritizing for the year ahead. This report compiles their insights, allowing readers to benchmark strategies, identify emerging trends, and compare their priorities as they head into 2026.\nLearn how top leaders are turning investment into measurable impact.",
      "enhanced_at": 1762427858.4105356,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:38.410857+00:00Z"
}