{
  "id": "bleeping-computer-2025-11-05-1db77be5",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/microsoft/windows-11-store-gets-ninite-style-multi-app-installer-feature/",
  "title": "Windows 11 Store gets Ninite-style multi-app installer feature",
  "url": "https://www.bleepingcomputer.com/news/microsoft/windows-11-store-gets-ninite-style-multi-app-installer-feature/",
  "published_at": "2025-11-05T17:28:34+00:00",
  "fetched_at": "2025-11-06T11:12:59.688517+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Microsoft Store on the web now lets you create a multi-app install package on Windows 11 that installs multiple applications from a single installer. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The Microsoft Store on the web now lets you create a multi-app install package on Windows 11 that installs multiple applications from a single installer.\nThis means you can now install multiple apps simultaneously without having to download each one manually.\nThe experience is similar to that of the third-party app Ninite, a package manager that lets you install multiple apps at once.\nHow does Microsoft Store's multi-app install work?\nPreviously, if you opened the Store on the web or in Windows 11, you had to go to the product page for each app to start the installation.\nWhile that works, it's not the best experience when you're setting up a new PC.\nWith multi-app install support, you can now head to the Store on the web, select the apps you need, and create a package that downloads and installs the selected apps from the Store.\nAs spotted on X, this feature quietly went live for the Microsoft Store web earlier this week.\nTo use Store multi-app install, open the Store web, select apps, and click on \"Install selected.\" Only 16 apps can be downloaded at once to avoid overwhelming the Store servers.\nAfter selecting \"Install selected\", the Store web will download an executable that installs all your apps in the background.\nIn our tests, we observed that it doesn't work in the Store app on Windows 11, but only in the Store on the web.\nAlso, the multi-app install feature is not yet ready for the masses, because we noticed that you could only select from a list of 64 curated apps.\nBleepingComputer contacted Microsoft to see if they plan to extend this feature to allow selecting any app from the Microsoft Store.\nThe 2026 CISO Budget Benchmark\nIt's budget season! Over 300 CISOs and security leaders have shared how they're planning, spending, and prioritizing for the year ahead. This report compiles their insights, allowing readers to benchmark strategies, identify emerging trends, and compare their priorities as they head into 2026.\nLearn how top leaders are turning investment into measurable impact.",
      "enhanced_at": 1762427845.5004358,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:25.500773+00:00Z"
}