{
  "id": "bleeping-computer-2025-11-05-b2fe4045",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/gootloader-malware-is-back-with-new-tricks-after-7-month-break/",
  "title": "Gootloader malware is back with new tricks after 7-month break",
  "url": "https://www.bleepingcomputer.com/news/security/gootloader-malware-is-back-with-new-tricks-after-7-month-break/",
  "published_at": "2025-11-05T21:52:45+00:00",
  "fetched_at": "2025-11-06T11:12:59.687680+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Gootloader malware loader operation has returned after a 7-month absence and is once again performing SEO poisoning to promote fake websites that distribute the malware. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The Gootloader malware loader operation has returned after a 7-month absence and is once again performing SEO poisoning to promote fake websites that distribute the malware.\nGootloader is a JavaScript-based malware loader spread through compromised or attacker-controlled websites, used to trick users into downloading malicious documents.\nThe websites are promoted in search engines either via ads or through search engine optimization (SEO) poisoning, which ranks a website higher in the results for a particular keyword, like legal documents and agreements.\nIn the past, these websites would display fake message boards that pretended to discuss users' query, with some posts recommending (malicious) document templates that could be downloaded. The SEO campaigns later switched to using websites that pretend to offer free templates for various legal documents.\nWhen a visitor clicked the \"Get Document\" button, the site checked if they were a legitimate user and, if so, downloaded an archive containing a malicious document with a .js extension. For example, the archive could include a file named mutual_non_disclosure_agreement.js.\nGootloader would execute when launching the document and downloaded additional malware payloads onto the device, including Cobalt Strike, backdoors, and bots that provided initial access to corporate networks. Other threat actors then used this access to deploy ransomware or conduct other attacks.\nGootloader returns\nA cybersecurity researcher operating under the pseudonym \"Gootloader\" has been tracking and actively disrupting the malware operation for years by filing abuse reports with ISPs and hosting platforms to take down attacker-controlled infrastructure.\nThe researcher told BleepingComputer that his activities led to the Gootloader operation suddenly ceasing on March 31st, 2025.\nThe researcher and Anna Pham of Huntress Labs now report that Gootloader has returned in a new campaign that once again impersonates legal documents.\n\"In this latest campaign, we've observed thousands of unique keywords spread over 100 websites,\" reads a new blog post by the Gootloader researcher. \"The ultimate goal remains the same: convince victims to download a malicious ZIP archive containing a JScript (.JS) file that establishes initial access for follow-on activity — usually leading to ransomware deployment.\"\nHowever, the researchers say this new variant uses a few techniques to evade automated analysis tools and security researchers.\nHuntress found that the JavaScript added to malicious websites hides the real filenames by using a special web font that replaces letters with look-alike symbols.\nIn the HTML source, you see nonsense text, but when the page is rendered, the font's swapped glyph shapes display normal words, making it harder for security software and researchers to find keywords like \"invoice\" or \"contract\" in the source code.\n\"Rather than using OpenType substitution features or character mapping tables, the loader swaps what each glyph actually displays. The font's metadata appears completely legitimate—the character \"O\" maps to a glyph named \"O\", the character \"a\" maps to a glyph named \"a\", and so forth,\" explains Huntress.\n\"However, the actual vector paths that define these glyphs have been swapped. When the browser requests the shape for glyph \"O\", the font provides the vector coordinates that draw the letter \"F\" instead. Similarly, \"a\" draws \"l\", \"9\" draws \"o\", and special Unicode characters like \"±\" draw \"i\". The gibberish string Oa9Z±h• in the source code renders as \"Florida\" on screen.\"\nResearchers from the DFIR Report also discovered that Gootloader is using malformed Zip archives to distribute Gootloader scripts from attacker-controlled websites.\nThese archives are crafted so that when the downloaded ZIP file is extracted with Windows Explorer, the malicious JavaScript file, Review_Hearings_Manual_2025.js, is extracted.\nHowever, that same archive, when extracted within VirusTotal, Python's zip utilities, or 7-Zip, will unpack a harmless text file named Review_Hearings_Manual_202.txt.\nAs you can see in the image below of 010 Editor, the archive contains both files but is malformed, causing it to be extracted differently depending on the tool used.\nIt's unclear whether this is the same concatenation trick described in 2024 or if they are using a new technique to get Windows to extract the JS file.\nFinally, the campaign is dropping the Supper SOCKS5 backdoor on devices, which is used to gain remote access to the network.\nThe Supper backdoor is malware that provides remote access to infected devices and is known to be used by a ransomware affiliate tracked as Vanilla Tempest.\nThis threat actor has a long history of conducting ransomware attacks and is believed to have been an affiliate of Inc, BlackCat, Quantum Locker, Zeppelin, and Rhysida.\nIn the attacks observed by Huntress, the threat actor moved fast once a device was infected, performing reconnaissance within 20 minutes and ultimately compromising the Domain Controller within 17 hours.\nWith Gootloader now back in operation, consumers and corporate users need to be careful about searching for and downloading legal agreements and templates from the web.\nUnless the website is known for offering these types of templates, it should be treated with suspicion and avoided.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
      "enhanced_at": 1762427823.0716386,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:03.071957+00:00Z"
}