{
  "id": "bleeping-computer-2025-11-05-9277d225",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/sonicwall-says-state-sponsored-hackers-behind-security-breach-in-september/",
  "title": "SonicWall says state-sponsored hackers behind September security breach",
  "url": "https://www.bleepingcomputer.com/news/security/sonicwall-says-state-sponsored-hackers-behind-security-breach-in-september/",
  "published_at": "2025-11-05T17:13:07+00:00",
  "fetched_at": "2025-11-06T11:12:59.688758+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "SonicWall's investigation into the September security breach that exposed customers' firewall configuration backup files concludes that state-sponsored hackers were behind the attack. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "SonicWall's investigation into the September security breach that exposed customers' firewall configuration backup files concludes that state-sponsored hackers were behind the attack.\nThe network security company says that incident responders from Mandiant confirmed that the malicious activity had no impact on SonicWall's products, firmware, systems, tools, source code, or customer networks.\n“The Mandiant investigation is now complete. Their findings confirm that the malicious activity – carried out by a state-sponsored threat actor - was isolated to the unauthorized access of cloud backup files from a specific cloud environment using an API call,” SonicWall states.\n“The incident did not impact SonicWall products or firmware. No other SonicWall systems or tools, source code, or customer networks were disrupted or compromised,” the vendor says.\nOn September 17, the American company disclosed \"an incident that exposed firewall configuration backup files stored in certain MySonicWall accounts.\"\nAn attacker could extract from these files sensitive information, like access credentials and tokens, that could make it \"significantly easier\" for them to exploit a customer's firewalls.\nThe company immediately advised customers to reset their MySonicWall account credentials, temporary access codes, passwords for LDAP, RADIUS, or TACACS+ servers, passwords for L2TP/PPPoE/PPTP WAN interfaces, and shared secrets in IPSec site-to-site and GroupVPN policies.\nIn an update on October 9, SonicWall stated that the security breach affected all customers who used the company’s cloud backup service to store firewall configuration files.\nThe investigation is now complete,, and the network security vendor states that the breach was contained to a specific part of its environment and did not impact the safety of its products.\nFurthermore, the company assured that the investigated nation-state activity has no connection with attacks from the Akira ransomware gang that targeted MFA-protected SonicWall VPN accounts in late September.\nMore recently, on October 13, Huntress reported seeing elevated malicious activity targeting SonicWall SSLVPN accounts and successfully compromising over a hundred of them using valid credentials.\nHuntress did not find any evidence connecting these attacks to the September firewall configuration files exposure, and SonicWall did not respond to our requests regarding the matter.\nSecrets Security Cheat Sheet: From Sprawl to Control\nWhether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start.\nGet the cheat sheet and take the guesswork out of secrets management.",
      "enhanced_at": 1762427850.537285,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:30.537600+00:00Z"
}