{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-05-939cef8a",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42280",
  "title": "Proofpoint, líder por segundo año en el Cuadrante Mágico de Gartner 2025",
  "url": "https://cybersecuritynews.es/proofpoint-lider-por-segundo-ano-en-el-cuadrante-magico-de-gartner-2025/",
  "published_at": "2025-11-05T22:00:00+00:00",
  "fetched_at": "2025-11-06T11:14:33.687318+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Proofpoint, empresa de ciberseguridad y cumplimiento normativo, ha anunciado su nombramiento como líder por segunda vez consecutiva en el Cuadrante Mágico de Gartner de 2025 dentro de la categoría de soluciones de gobernanza y archivado de comunicaciones digitales. Gartner ha evaluado a 14 proveedores en su informe de octubre de 2025 y ha reconocido a Proofpoint como líder por su capacidad de ejecución e integridad de visión. “Creemos que nuestro reconocimiento consecutivo este año como líder en los Cuadrantes Mágicos subraya nuestro liderazgo continuo, la solidez de nuestra visión y nuestro constante ritmo de innovación”, afirma&nbsp;Harry Labana, vicepresidente sénior y director general de la unidad de negocio DCG de Proofpoint.&nbsp;“Con nuestra plataforma de gobernanza para las comunicaciones digitales de última generación y la primera solución de IA agéntica del sector para inteligencia de las comunicaciones humanas, estamos capturando inteligencia de las comunicaciones en tiempo real y redefiniendo la forma en que las organizaciones gestionan el riesgo, pasando del cumplimiento reactivo a una gobernanza proactiva basada en inteligencia y diseñada para la era de la IA”. La oferta de Gobernanza de Comunicaciones Digitales (DCG) de Proofpoint proporciona un enfoque unificado e inteligente para el cumplimiento, la supervisión y la gestión de riesgos mediante Inteligencia de Comunicaciones Humanas (HCI), impulsada por la IA agéntica. Aprovechando la tecnología de Nuclei propiedad de Proofpoint, HCI interpreta la intención humana, capturando y contextualizando las comunicaciones en más de 80 canales en tiempo real. Los agentes inteligentes evalúan las conversaciones de forma autónoma, identifican los riesgos a medida que surgen y ofrecen un razonamiento transparente para cada acción. Las señales generadas por los agentes de inteligencia de comunicaciones humanas de Proofpoint se integran directamente con la gestión de amenazas internas (ITM) de Proofpoint, correlacionando los indicadores de riesgo basados en las comunicaciones con la actividad de los usuarios en los endpoints. Esta potente integración revela los motivos, los medios y los modos de riesgo en la matriz de amenazas internas y permite a las organizaciones actuar antes de que el comportamiento derive en infracciones de cumplimiento, infracciones o litigios. A 15 de octubre de 2025, Proofpoint tiene una calificación general de 4,8 sobre 5 en el mercado de archivado de información empresarial, según 114 reseñas en Gartner Peer Insights™, dentro de la categoría de soluciones de gobernanza y archivado de comunicaciones digitales. La entrada Proofpoint, líder por segundo año en el Cuadrante Mágico de Gartner 2025 se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Proofpoint, empresa de ciberseguridad y cumplimiento normativo, ha anunciado su nombramiento como líder por segunda vez consecutiva en el Cuadrante Mágico de Gartner de 2025 dentro de la categoría de soluciones de gobernanza y archivado de comunicaciones digitales.\nGartner ha evaluado a 14 proveedores en su informe de octubre de 2025 y ha reconocido a Proofpoint como líder por su capacidad de ejecución e integridad de visión.\n“Creemos que nuestro reconocimiento consecutivo este año como líder en los Cuadrantes Mágicos subraya nuestro liderazgo continuo, la solidez de nuestra visión y nuestro constante ritmo de innovación”, afirma Harry Labana, vicepresidente sénior y director general de la unidad de negocio DCG de Proofpoint. “Con nuestra plataforma de gobernanza para las comunicaciones digitales de última generación y la primera solución de IA agéntica del sector para inteligencia de las comunicaciones humanas, estamos capturando inteligencia de las comunicaciones en tiempo real y redefiniendo la forma en que las organizaciones gestionan el riesgo, pasando del cumplimiento reactivo a una gobernanza proactiva basada en inteligencia y diseñada para la era de la IA”.\nLa oferta de Gobernanza de Comunicaciones Digitales (DCG) de Proofpoint proporciona un enfoque unificado e inteligente para el cumplimiento, la supervisión y la gestión de riesgos mediante Inteligencia de Comunicaciones Humanas (HCI), impulsada por la IA agéntica. Aprovechando la tecnología de Nuclei propiedad de Proofpoint, HCI interpreta la intención humana, capturando y contextualizando las comunicaciones en más de 80 canales en tiempo real. Los agentes inteligentes evalúan las conversaciones de forma autónoma, identifican los riesgos a medida que surgen y ofrecen un razonamiento transparente para cada acción. Las señales generadas por los agentes de inteligencia de comunicaciones humanas de Proofpoint se integran directamente con la gestión de amenazas internas (ITM) de Proofpoint, correlacionando los indicadores de riesgo basados en las comunicaciones con la actividad de los usuarios en los endpoints. Esta potente integración revela los motivos, los medios y los modos de riesgo en la matriz de amenazas internas y permite a las organizaciones actuar antes de que el comportamiento derive en infracciones de cumplimiento, infracciones o litigios.\nA 15 de octubre de 2025, Proofpoint tiene una calificación general de 4,8 sobre 5 en el mercado de archivado de información empresarial, según 114 reseñas en Gartner Peer Insights™, dentro de la categoría de soluciones de gobernanza y archivado de comunicaciones digitales.",
      "enhanced_at": 1762427814.568266,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:16:54.568605+00:00Z"
}