{
  "id": "cyberscoop-2025-11-05-591fca4b",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86651",
  "title": "Congressional leaders want an executive branch strategy on China 6G, tech supply chain",
  "url": "https://cyberscoop.com/exclusive-china-6g-letter-krishnamoorthi-congress-state-commerce-letters/",
  "published_at": "2025-11-05T20:05:30+00:00",
  "fetched_at": "2025-11-06T11:14:59.765390+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Congressional leaders are pressing federal agencies to provide more information on their plans to compete with China on a range of tech and cybersecurity issues, including a strategy for promoting American 6G telecommunications infrastructure and limiting Chinese tech in US supply chains. Representative Raja Krishnamoorthi, D-Ill., ranking member on the House Select Committee on the Chinese Communist Party, wrote to Secretary of State Marco Rubio last week asking for an update on the department’s work building international coalitions around 6G. In the letter, dated Oct. 30 and shared exclusively with CyberScoop, he called for the department to share details on how its is fighting to shape international norms, global technical standards and supply chains in favor of U.S. and non-Chinese companies and technologies, saying “diplomacy can, and must, play a key role in this strategy.” “While it remains essential that we continue to address the threats posed by the Chinese Communist Party’s efforts to dominate 5G, we must also look forward to how we can outcompete the CCP in the next frontier of wireless competition,” he wrote. In an interview with CyberScoop, Krishnamoorthi called on Rubio to build on the work that prior administrations have done marshalling international consensus around 5G security and technical standards, while also learning from past mistakes, which allowed Chinese telecom companies like Huawei and ZTE to gain significant global influence.&nbsp; “We have underestimated the impact of 5G and didn’t invest enough in our own innovative capacity, or push for domestic and trusted partners to produce that technology and be able to purchase from them,” he said. Further, he said the U.S. failed to match Chinese efforts to shape international technical standards around 5G implementation, which allowed China to increase&nbsp; its global influence and set technology standards that benefit its own industries. The country is already laying a similar groundwork to influence the 6G space: Krishnamoorthi noted that a group promoting Chinese technical standards has already signed an agreement with European industry associations to research 6G networks and services, while this past May an annual 6G global summit was, for the first time, hosted in China and sponsored by major Chinese entities like China Mobile, ZTE and the Hong Kong Communications Authority. With 5G, “we didn’t recognize the power of…taking leadership in organizations that set standards with regard to our technology,” he said, something the U.S. can’t afford to repeat with 6G. Further, Krishamoorthi said Congress was able to come to a consensus on banning Chinese the use of tech from Huawei, ZTE and other Chinese telecoms in U.S. networks, but criticized the body for failing to properly set aside fund the replacement of that equipment, which Chinese companies often sold at far cheaper prices than domestic alternatives. The U.S. government created a regulatory environment where they “allowed everyone to buy whatever the heck they wanted to buy,” which often led US networks to opt for much cheaper Chinese equipment. “We came back and said you have to rip it all out, and we, the federal government, will try to provide resources to replace it,” he said. “We never came up with the resources to replace it, they ended up having to rip it out and now there are patches to the country without access to the type of broadband coverage that they deserve.” Last year, Congress did approve $3 billion to fund rip-and-replacement of Chinese technologies, but industry groups have long complained that the government’s initial tranche of funding for the initiative was insufficient. Under the Biden administration, the U.S. reached international agreements with nine other countries – The United Kingdom, Australia, Canada, Czechia, France, Japan, South Korea, Sweden and Finland – on a set of principles for “Secure, Open and Resilient by Design” technologies and infrastructure around 6G. The National Telecommunications and Information Administration also invited experts from the public to help map out a long-term strategy to support U.S. advancements in 6G telecommunications infrastructure. The responses from industry, academia and tech experts emphasized the importance of fostering US growth in Open Radio Access Network technologies, a critical gap in U.S. and western supply chains, robust security and privacy frameworks and AI-integration. &nbsp;Congressional Republicans are also scrutinizing how federal agencies are accounting for Chinese technology lobbying efforts on the world stage. A joint letter Wednesday from House Republican leaders on the House Homeland Security, CCP, Foreign Affairs and Intelligence Committees requested a briefing with Secretary of Commerce Howard Lutnick and pressed the department to “investigate and restrict adversary products in other critical and emerging industries to protect the U.S. market from technology threats,” particularly from China. The members wrote that connected critical infrastructure has “whittled away geographic borders” and created new threats of foreign sabotage or control that US policy must account for, including Chinese made technologies in artificial intelligence, automated machinery and robotics, IOT devices, semiconductor cores and industrial SCADA software. “We have already seen through a variety of cyber-attacks against the United States that China views information technology as a battlefield,” wrote Reps. Andrew Garbarino, R-N.Y., John Moolenaar, R-Mich., Bill Huzienga, R-Mich., Rick Crawford, R-La., and Brian Mast, R-Fl. “A compromised power grid, an infiltrated telecommunications network, or a manipulated industrial control system can pose as great a threat as a kinetic military strike.” The post Congressional leaders want an executive branch strategy on China 6G, tech supply chain appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Congressional leaders want an executive branch strategy on China 6G, tech supply chain\nCongressional leaders are pressing federal agencies to provide more information on their plans to compete with China on a range of tech and cybersecurity issues, including a strategy for promoting American 6G telecommunications infrastructure and limiting Chinese tech in US supply chains.\nRepresentative Raja Krishnamoorthi, D-Ill., ranking member on the House Select Committee on the Chinese Communist Party, wrote to Secretary of State Marco Rubio last week asking for an update on the department’s work building international coalitions around 6G.\nIn the letter, dated Oct. 30 and shared exclusively with CyberScoop, he called for the department to share details on how its is fighting to shape international norms, global technical standards and supply chains in favor of U.S. and non-Chinese companies and technologies, saying “diplomacy can, and must, play a key role in this strategy.”\n“While it remains essential that we continue to address the threats posed by the Chinese Communist Party’s efforts to dominate 5G, we must also look forward to how we can outcompete the CCP in the next frontier of wireless competition,” he wrote.\nIn an interview with CyberScoop, Krishnamoorthi called on Rubio to build on the work that prior administrations have done marshalling international consensus around 5G security and technical standards, while also learning from past mistakes, which allowed Chinese telecom companies like Huawei and ZTE to gain significant global influence.\n“We have underestimated the impact of 5G and didn’t invest enough in our own innovative capacity, or push for domestic and trusted partners to produce that technology and be able to purchase from them,” he said.\nFurther, he said the U.S. failed to match Chinese efforts to shape international technical standards around 5G implementation, which allowed China to increase its global influence and set technology standards that benefit its own industries.\nThe country is already laying a similar groundwork to influence the 6G space: Krishnamoorthi noted that a group promoting Chinese technical standards has already signed an agreement with European industry associations to research 6G networks and services, while this past May an annual 6G global summit was, for the first time, hosted in China and sponsored by major Chinese entities like China Mobile, ZTE and the Hong Kong Communications Authority.\nWith 5G, “we didn’t recognize the power of…taking leadership in organizations that set standards with regard to our technology,” he said, something the U.S. can’t afford to repeat with 6G.\nFurther, Krishamoorthi said Congress was able to come to a consensus on banning Chinese the use of tech from Huawei, ZTE and other Chinese telecoms in U.S. networks, but criticized the body for failing to properly set aside fund the replacement of that equipment, which Chinese companies often sold at far cheaper prices than domestic alternatives.\nThe U.S. government created a regulatory environment where they “allowed everyone to buy whatever the heck they wanted to buy,” which often led US networks to opt for much cheaper Chinese equipment.\n“We came back and said you have to rip it all out, and we, the federal government, will try to provide resources to replace it,” he said. “We never came up with the resources to replace it, they ended up having to rip it out and now there are patches to the country without access to the type of broadband coverage that they deserve.”\nLast year, Congress did approve $3 billion to fund rip-and-replacement of Chinese technologies, but industry groups have long complained that the government’s initial tranche of funding for the initiative was insufficient.\nUnder the Biden administration, the U.S. reached international agreements with nine other countries – The United Kingdom, Australia, Canada, Czechia, France, Japan, South Korea, Sweden and Finland – on a set of principles for “Secure, Open and Resilient by Design” technologies and infrastructure around 6G.\nThe National Telecommunications and Information Administration also invited experts from the public to help map out a long-term strategy to support U.S. advancements in 6G telecommunications infrastructure.\nThe responses from industry, academia and tech experts emphasized the importance of fostering US growth in Open Radio Access Network technologies, a critical gap in U.S. and western supply chains, robust security and privacy frameworks and AI-integration.\nCongressional Republicans are also scrutinizing how federal agencies are accounting for Chinese technology lobbying efforts on the world stage. A joint letter Wednesday from House Republican leaders on the House Homeland Security, CCP, Foreign Affairs and Intelligence Committees requested a briefing with Secretary of Commerce Howard Lutnick and pressed the department to “investigate and restrict adversary products in other critical and emerging industries to protect the U.S. market from technology threats,” particularly from China.\nThe members wrote that connected critical infrastructure has “whittled away geographic borders” and created new threats of foreign sabotage or control that US policy must account for, including Chinese made technologies in artificial intelligence, automated machinery and robotics, IOT devices, semiconductor cores and industrial SCADA software.\n“We have already seen through a variety of cyber-attacks against the United States that China views information technology as a battlefield,” wrote Reps. Andrew Garbarino, R-N.Y., John Moolenaar, R-Mich., Bill Huzienga, R-Mich., Rick Crawford, R-La., and Brian Mast, R-Fl. “A compromised power grid, an infiltrated telecommunications network, or a manipulated industrial control system can pose as great a threat as a kinetic military strike.”",
      "enhanced_at": 1762427836.4533374,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:16.453673+00:00Z"
}