{
  "id": "cyberscoop-2025-11-05-105d30eb",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86648",
  "title": "House GOP leaders seek government probe, restrictions on Chinese-made tech",
  "url": "https://cyberscoop.com/house-gop-leaders-seek-government-probe-restrictions-on-chinese-made-tech/",
  "published_at": "2025-11-05T18:50:30+00:00",
  "fetched_at": "2025-11-06T11:14:59.765733+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A Commerce Department office should investigate Chinese government-connected products in more than a dozen emerging industries for security threats, a group of House GOP committee leaders said in a letter they released Wednesday. In the missive, the lawmakers said the Office of Information and Communications Technology and Services has the power to both investigate and restrict those products in areas like artificial intelligence and energy generation. China, they wrote, has already demonstrated that it views information technology as a battlefield with its cyberattacks on the United States. “A compromised power grid, an infiltrated telecommunications network, or a manipulated industrial control system can pose as great a threat as a kinetic military strike,” the House members said. “The fusion of digital capabilities with critical infrastructure has whittled away geographic borders, as connected infrastructure or products can be controlled or updated by entities in another country. “Without a concerted effort to create a secure technology ecosystem from the very beginning of each supply chain, our adversaries will continue to exploit our dependence on their technology to undermine U.S. economic and military stability,” they continued. The lawmakers signing the letter were House Homeland Security Chairman Andrew Garbarino of New York; Committee on China Chairman John Moolenaar of Michigan; Foreign Affairs Chairman Brian Mast of Florida, Intelligence Chairman Rick Crawford of Arkansas; and Bill Huizenga of Michigan, who chairs the Foreign Affairs Subcommittee on South and Central Asia. Some of the industries and companies on the lawmakers’ list have already drawn attention from the U.S. government, including from the Commerce Department. For instance, the departments of Commerce, Defense and Justice reportedly opened investigations last year into the router-manufacturer TP-Link of China. More than a half-dozen agencies are said to support a ban on TP-Link Systems of Irvine, Calif., spun off from the Chinese company. TP-Link Systems disputes allegations that it poses a national security threat. Other products mentioned in the GOP members’ letter include industrial control systems, robotics, cameras, chip design software, drones and tools necessary for semiconductor production. The Commerce Department did not immediately respond to requests for comment on the GOP letter. The government shutdown has led some agencies to stop responding to emails. The Trump administration is in the midst of a prolonged and wide-ranging battle over trade with Beijing, one that includes potential curbs on exports to China made with U.S. software and Nvidia’s most advanced chips. Chinese-made products and their potential impacts on cybersecurity have sparked widespread concerns. The post House GOP leaders seek government probe, restrictions on Chinese-made tech appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "House GOP leaders seek government probe, restrictions on Chinese-made tech\nA Commerce Department office should investigate Chinese government-connected products in more than a dozen emerging industries for security threats, a group of House GOP committee leaders said in a letter they released Wednesday.\nIn the missive, the lawmakers said the Office of Information and Communications Technology and Services has the power to both investigate and restrict those products in areas like artificial intelligence and energy generation.\nChina, they wrote, has already demonstrated that it views information technology as a battlefield with its cyberattacks on the United States.\n“A compromised power grid, an infiltrated telecommunications network, or a manipulated industrial control system can pose as great a threat as a kinetic military strike,” the House members said. “The fusion of digital capabilities with critical infrastructure has whittled away geographic borders, as connected infrastructure or products can be controlled or updated by entities in another country.\n“Without a concerted effort to create a secure technology ecosystem from the very beginning of each supply chain, our adversaries will continue to exploit our dependence on their technology to undermine U.S. economic and military stability,” they continued.\nThe lawmakers signing the letter were House Homeland Security Chairman Andrew Garbarino of New York; Committee on China Chairman John Moolenaar of Michigan; Foreign Affairs Chairman Brian Mast of Florida, Intelligence Chairman Rick Crawford of Arkansas; and Bill Huizenga of Michigan, who chairs the Foreign Affairs Subcommittee on South and Central Asia.\nSome of the industries and companies on the lawmakers’ list have already drawn attention from the U.S. government, including from the Commerce Department. For instance, the departments of Commerce, Defense and Justice reportedly opened investigations last year into the router-manufacturer TP-Link of China. More than a half-dozen agencies are said to support a ban on TP-Link Systems of Irvine, Calif., spun off from the Chinese company.\nTP-Link Systems disputes allegations that it poses a national security threat.\nOther products mentioned in the GOP members’ letter include industrial control systems, robotics, cameras, chip design software, drones and tools necessary for semiconductor production.\nThe Commerce Department did not immediately respond to requests for comment on the GOP letter. The government shutdown has led some agencies to stop responding to emails.\nThe Trump administration is in the midst of a prolonged and wide-ranging battle over trade with Beijing, one that includes potential curbs on exports to China made with U.S. software and Nvidia’s most advanced chips. Chinese-made products and their potential impacts on cybersecurity have sparked widespread concerns.",
      "enhanced_at": 1762427839.818772,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:19.819106+00:00Z"
}