{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-05-1cb7bdb7",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42282",
  "title": "Las empresas deberán proteger con ciberseguridad los registros de jornada laboral",
  "url": "https://cybersecuritynews.es/las-empresas-deberan-proteger-con-ciberseguridad-los-registros-de-jornada-laboral/",
  "published_at": "2025-11-05T22:00:00+00:00",
  "fetched_at": "2025-11-06T11:14:33.687731+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "El Gobierno de España prepara una nueva regulación para garantizar que todas las horas, incluidas las extraordinarias, queden registradas. Este cambio responde a la necesidad de reforzar la fiabilidad de los sistemas actuales de registro, que en muchos casos no garantizan un control exhaustivo de las horas trabajadas ni la desconexión digital. Según la Encuesta de Población Activa (EPA) se calcula que más de 400.000 trabajadores realizan semanalmente unas 2,8 millones de horas extra no remuneradas. En el Artículo 35.3 del Estatuto de los Trabajadores en 2019, se establece un máximo de 80 horas extraordinarias anuales. Con la nueva propuesta, este límite no se modifica, pero se refuerza el control mediante sistemas digitales obligatorios que aseguren el registro y trazabilidad de cada hora trabajada. “La implementación de soluciones de control horario más precisa facilitará el cumplimiento de la ley y ayudará a las empresas a evitar sanciones, que bajo la nueva normativa podrán ser más estrictas y calcularse por trabajador”, explica Marcelo Dos Reis, CEO de Grupo SPEC, empresa especializada en soluciones de control horario y de accesos. Desde 2019, el registro horario permitía formatos manuales como papel, excel o aplicaciones, con acceso de inspección bajo petición de la empresa, limitado de pausas y horas extraordinarias. La nueva normativa 2025-2026 obliga a un registro digital completo, con acceso remoto en tiempo real a los inspectores y detalles ampliados de la jornada laboral, incluyendo pausas, horas extra, guardias y jornadas flexibles. Además, los trabajadores tendrán acceso inmediato e individual desde cualquier dispositivo, garantizando transparencia y control de sus propias horas. “Con este cambio, se refuerza la trazabilidad de la jornada laboral y se protege mejor al empleado, asegurando que todas las horas queden registradas correctamente”, añade Dos Reis. Con la nueva legislación, todas las empresas, independientemente de su tamaño o sector, deberán implantar sistemas digitales que registren la jornada laboral y garanticen la protección de los datos personales. Estos sistemas tendrán que contar con certificaciones como la ISO/IEC 27001, que avala la gestión segura de información, y el Esquema Nacional de Seguridad (ENS), que establece los requisitos para proteger los entornos digitales vinculados a la Administración Pública. Además de cumplir con estas certificaciones, los sistemas deberán respetar el Reglamento General de Protección de Datos (RGPD) y la Ley de control horario, asegurando que solo el personal autorizado pueda acceder a la información, protegiéndola de posibles ciberataques y garantizando su integridad. Gracias a estas funcionalidades, las empresas pueden automatizar la gestión del tiempo, generar informes detallados sobre la plantilla, y a la vez,ofrecer a los trabajadores un acceso transparente y seguro a sus propias horas registradas. La entrada Las empresas deberán proteger con ciberseguridad los registros de jornada laboral se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "El Gobierno de España prepara una nueva regulación para garantizar que todas las horas, incluidas las extraordinarias, queden registradas. Este cambio responde a la necesidad de reforzar la fiabilidad de los sistemas actuales de registro, que en muchos casos no garantizan un control exhaustivo de las horas trabajadas ni la desconexión digital. Según la Encuesta de Población Activa (EPA) se calcula que más de 400.000 trabajadores realizan semanalmente unas 2,8 millones de horas extra no remuneradas.\nEn el Artículo 35.3 del Estatuto de los Trabajadores en 2019, se establece un máximo de 80 horas extraordinarias anuales. Con la nueva propuesta, este límite no se modifica, pero se refuerza el control mediante sistemas digitales obligatorios que aseguren el registro y trazabilidad de cada hora trabajada. “La implementación de soluciones de control horario más precisa facilitará el cumplimiento de la ley y ayudará a las empresas a evitar sanciones, que bajo la nueva normativa podrán ser más estrictas y calcularse por trabajador”, explica Marcelo Dos Reis, CEO de Grupo SPEC, empresa especializada en soluciones de control horario y de accesos.\nDesde 2019, el registro horario permitía formatos manuales como papel, excel o aplicaciones, con acceso de inspección bajo petición de la empresa, limitado de pausas y horas extraordinarias. La nueva normativa 2025-2026 obliga a un registro digital completo, con acceso remoto en tiempo real a los inspectores y detalles ampliados de la jornada laboral, incluyendo pausas, horas extra, guardias y jornadas flexibles. Además, los trabajadores tendrán acceso inmediato e individual desde cualquier dispositivo, garantizando transparencia y control de sus propias horas. “Con este cambio, se refuerza la trazabilidad de la jornada laboral y se protege mejor al empleado, asegurando que todas las horas queden registradas correctamente”, añade Dos Reis.\nCon la nueva legislación, todas las empresas, independientemente de su tamaño o sector, deberán implantar sistemas digitales que registren la jornada laboral y garanticen la protección de los datos personales. Estos sistemas tendrán que contar con certificaciones como la ISO/IEC 27001, que avala la gestión segura de información, y el Esquema Nacional de Seguridad (ENS), que establece los requisitos para proteger los entornos digitales vinculados a la Administración Pública.\nAdemás de cumplir con estas certificaciones, los sistemas deberán respetar el Reglamento General de Protección de Datos (RGPD) y la Ley de control horario, asegurando que solo el personal autorizado pueda acceder a la información, protegiéndola de posibles ciberataques y garantizando su integridad. Gracias a estas funcionalidades, las empresas pueden automatizar la gestión del tiempo, generar informes detallados sobre la plantilla, y a la vez,ofrecer a los trabajadores un acceso transparente y seguro a sus propias horas registradas.",
      "enhanced_at": 1762427815.2383354,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:16:55.238683+00:00Z"
}