{
  "id": "cyberscoop-2025-11-05-a39a3c69",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86660",
  "title": "Court reimposes original sentence for Capital One hacker",
  "url": "https://cyberscoop.com/court-reimposes-original-sentence-for-capital-one-hacker/",
  "published_at": "2025-11-05T20:43:06+00:00",
  "fetched_at": "2025-11-06T11:14:59.764549+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A federal judge has reimposed a sentence on Paige Thompson, the former Amazon Web Services engineer convicted in the 2019 Capital One data breach that compromised the personal information of more than 100 million people. U.S. District Judge Robert Lasnik sentenced Thompson to time served, plus five years of supervised release with three years of home confinement, and 250 hours of community service. The judge also maintained the original $40.7 million restitution order. The resentencing, issued last week, follows a Ninth Circuit Court of Appeals decision that vacated Thompson&#8217;s original 2022 sentence after prosecutors appealed the original sentence as too lenient. Lasnik acknowledged his &#8220;poor job of articulating the reasons&#8221; for the original sentence but maintained that imprisonment would be &#8220;greater-than-necessary punishment&#8221; after analyzing all legally required sentencing factors. The court determined that Thompson&#8217;s three years under supervision since the original sentencing demonstrated that non-custodial punishment adequately &#8220;reflects the seriousness of the offense, promotes respect for the law, provides just punishment, affords adequate specific deterrence, and protects the public.&#8221; Thompson, now 39, was convicted of wire fraud and computer intrusions after exploiting vulnerabilities in Capital One&#8217;s cloud computing systems. The breach affected approximately 106 million Americans, with damages estimated at over $40 million. In weighing factors that justified a significant downward departure from federal sentencing guidelines of 135-168 months, Lasnik cited Thompson&#8217;s mental health challenges, gender transition difficulties, acceptance of responsibility, and poor performance but ultimate compliance on probation. The court also expressed concerns about the current administration&#8217;s executive order regarding transgender inmates in federal prisons, noting uncertainty about whether Thompson would receive appropriate medical care while incarcerated. &#8220;The Court cannot find that a term of imprisonment would meet the need for any sentence to provide the defendant with needed medical care, or other correctional treatment in the most effective manner,&#8221; Lasnik wrote. Prosecutors had again recommended an 84-month prison term, arguing that home confinement failed to provide adequate general deterrence for similar crimes. While acknowledging the Ninth Circuit&#8217;s determination that &#8220;a purely probationary sentence in this case does not meet the deterrence goal in sentencing,&#8221; Lasnik concluded that other factors outweighed general deterrence concerns in Thompson&#8217;s &#8220;unique case.&#8221; The court highlighted that Thompson &#8220;committed this terrible crime in a situational way, not intending to cause tens of millions of dollars in damages&#8221; while unemployed and &#8220;extremely depressed.&#8221; The judge also noted that Thompson had not monetized the stolen data, had alerted someone who could notify Capital One, and had not reoffended in the three years since her original sentencing. According to court documents, Thompson &#8220;will be living paycheck to paycheck until she reaches retirement age&#8221; due to the restitution order. Neither the Western District of Washington, nor the federal public defender’s office, which represented Thompson, responded to CyberScoop’s request for comment.&nbsp; You can read the re-sentencing order below. gov.uscourts.wawd.277257.463.0 (1)Download The post Court reimposes original sentence for Capital One hacker appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Court reimposes original sentence for Capital One hacker\nA federal judge has reimposed a sentence on Paige Thompson, the former Amazon Web Services engineer convicted in the 2019 Capital One data breach that compromised the personal information of more than 100 million people.\nU.S. District Judge Robert Lasnik sentenced Thompson to time served, plus five years of supervised release with three years of home confinement, and 250 hours of community service. The judge also maintained the original $40.7 million restitution order.\nThe resentencing, issued last week, follows a Ninth Circuit Court of Appeals decision that vacated Thompson’s original 2022 sentence after prosecutors appealed the original sentence as too lenient.\nLasnik acknowledged his “poor job of articulating the reasons” for the original sentence but maintained that imprisonment would be “greater-than-necessary punishment” after analyzing all legally required sentencing factors.\nThe court determined that Thompson’s three years under supervision since the original sentencing demonstrated that non-custodial punishment adequately “reflects the seriousness of the offense, promotes respect for the law, provides just punishment, affords adequate specific deterrence, and protects the public.”\nThompson, now 39, was convicted of wire fraud and computer intrusions after exploiting vulnerabilities in Capital One’s cloud computing systems. The breach affected approximately 106 million Americans, with damages estimated at over $40 million.\nIn weighing factors that justified a significant downward departure from federal sentencing guidelines of 135-168 months, Lasnik cited Thompson’s mental health challenges, gender transition difficulties, acceptance of responsibility, and poor performance but ultimate compliance on probation.\nThe court also expressed concerns about the current administration’s executive order regarding transgender inmates in federal prisons, noting uncertainty about whether Thompson would receive appropriate medical care while incarcerated.\n“The Court cannot find that a term of imprisonment would meet the need for any sentence to provide the defendant with needed medical care, or other correctional treatment in the most effective manner,” Lasnik wrote.\nProsecutors had again recommended an 84-month prison term, arguing that home confinement failed to provide adequate general deterrence for similar crimes.\nWhile acknowledging the Ninth Circuit’s determination that “a purely probationary sentence in this case does not meet the deterrence goal in sentencing,” Lasnik concluded that other factors outweighed general deterrence concerns in Thompson’s “unique case.”\nThe court highlighted that Thompson “committed this terrible crime in a situational way, not intending to cause tens of millions of dollars in damages” while unemployed and “extremely depressed.” The judge also noted that Thompson had not monetized the stolen data, had alerted someone who could notify Capital One, and had not reoffended in the three years since her original sentencing.\nAccording to court documents, Thompson “will be living paycheck to paycheck until she reaches retirement age” due to the restitution order.\nNeither the Western District of Washington, nor the federal public defender’s office, which represented Thompson, responded to CyberScoop’s request for comment.\nYou can read the re-sentencing order below.",
      "enhanced_at": 1762427833.6404104,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:13.640726+00:00Z"
}