{
  "id": "gbhackers-security-1-globally-trusted-cyber-security-news-platform-gbhackers-com-2025-11-05-1dd10db8",
  "source_id": "gbhackers-security-1-globally-trusted-cyber-security-news-platform-gbhackers-com",
  "guid": "https://gbhackers.com/?p=168194",
  "title": "Clop Ransomware Group Exploits New 0-Day Vulnerabilities in Active Attacks",
  "url": "https://gbhackers.com/clop-ransomware/",
  "published_at": "2025-11-05T14:34:37+00:00",
  "fetched_at": "2025-11-06T11:15:44.769505+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Clop ransomware group continues to pose a significant threat to enterprise organizations worldwide, with recent analysis revealing their exploitation of a critical zero-day vulnerability in Oracle E-Business Suite. Operating since early 2019, Clop has established itself as one of the most prolific and sophisticated ransomware gangs, amassing a victim count exceeding 1,025 organizations and [&#8230;] The post Clop Ransomware Group Exploits New 0-Day Vulnerabilities in Active Attacks appeared first on GBHackers Security | #1 Globally Trusted Cyber Security News Platform.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The Clop ransomware group continues to pose a significant threat to enterprise organizations worldwide, with recent analysis revealing their exploitation of a critical zero-day vulnerability in Oracle E-Business Suite.\nOperating since early 2019, Clop has established itself as one of the most prolific and sophisticated ransomware gangs, amassing a victim count exceeding 1,025 organizations and extorting over $500 million since its inception.\nThe group, believed to be a variant of the CryptoMix ransomware that emerged in 2016, strategically avoids targeting Commonwealth of Independent States (CIS) countries, with suspected origins tracing back to Russia.\nThe nomenclature “Clop” derives from the distinctive file extension (.cl0p) appended to encrypted files following successful attacks, which also translates to “bedbugs” in Russian.\nWhat distinguishes this threat actor from its contemporaries is the consistent exploitation of cutting-edge zero-day vulnerabilities, a capability that underscores the group’s technical sophistication and intelligence-gathering operations.\nOracle EBS Zero-Day Exploitation\nRecent threat intelligence analysis has uncovered a critical zero-day vulnerability in Oracle E-Business Suite, initially identified in June 2025, with Oracle officially releasing indicators of compromise (IOCs) in October 2025.\nCVE-2025-61882, classified as a critical vulnerability, enables attackers to compromise integrated enterprise resource planning systems responsible for order management, procurement, and logistics operations across affected organizations.\nThe investigation began with two outbound IP addresses shared by Oracle: 185.181.60.11 (ASN: AS56655, Gigahost) and 200.107.207.26 (ASN: AS273045, DATAHOME S.A). Further reconnaissance using internet scanners including Shodan and FOFA identified a network fingerprint associated with the El Salvadorian IP that correlated with 96 additional IP addresses.\nGeographical analysis revealed Germany leading with 16 IPs, followed by Brazil with 13 IPs and Panama with 12 IPs.\nNotably, Russia appeared at the bottom of the list with only three IPs, indicating a deliberate infrastructure diversification strategy as organizations increasingly block Russian autonomous system numbers (ASNs).\nHistorical MOVit Campaign\nA significant breakthrough emerged during deep-dive analysis when researchers cross-referenced the current exploit infrastructure against historical IOCs documented in CISA’s official reports regarding the 2023 MOVit vulnerability exploitation.\nSpecifically, 41 of the 96 identified subnet IPs were previously utilized during the MOVit campaign (CVE-2023-34362), establishing a high-confidence connection between present and past Clop operations.\nThe overlapping subnet analysis revealed that Clop maintains persistent infrastructure patterns across multiple exploitation campaigns spanning from January 2023 to present operations.\nBy combining data from both the MOVit exploit cluster and the subsequent Fortra GoAnywhere command injection vulnerability (CVE-2023-0669), researchers identified 37 high-confidence IP addresses demonstrating exact matches across both 2023 incidents.\nNotably, 59.5 percent of these IPs geolocate to the United States, with 13.5 percent in Canada and 8.1 percent in the Netherlands.\nSSL certificate fingerprint analysis proved instrumental in establishing infrastructure continuity.\nThe fingerprint “bd613b3be57f18c3bceb0aaf86a28ad8b6df7f9bccacf58044f1068d1787f8a5” associated with the Oracle EBS exploitation matched fingerprints previously documented during 2023 MOVit operations, directly connecting current attacks to historical campaigns.\nSubnet analysis across multiple fingerprints revealed that 77.8 percent of identified subnets demonstrated reuse patterns, with the 5.188.86/24 subnet appearing 14 times across multiple exploitation incidents.\nThese findings underscore Clop’s reliance on persistent infrastructure despite heightened detection efforts, suggesting the group maintains operational continuity through deliberately compartmentalized network segments while progressively shifting geographic distribution to evade regional blocking measures.\nFollow us on Google News, LinkedIn, and X to Get Instant Updates and Set GBH as a Preferred Source in Google.",
      "enhanced_at": 1762427885.3306987,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:18:05.331024+00:00Z"
}