{
  "id": "infosecurity-magazine-2025-11-05-f6900ef7",
  "source_id": "infosecurity-magazine",
  "guid": "https://www.infosecurity-magazine.com/news/unksmudgedserpent-targets-academics/",
  "title": "UNK_SmudgedSerpent Targets Academics With Political Lures",
  "url": "https://www.infosecurity-magazine.com/news/unksmudgedserpent-targets-academics/",
  "published_at": "2025-11-05T16:00:00+00:00",
  "fetched_at": "2025-11-06T11:13:54.971169+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A previously unknown cyber actor UNK_SmudgedSerpent has been observed targeting academics with phishing and malware, merging techniques from Iranian groups",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "A previously unknown cyber actor targeting academics and foreign policy experts between June and August 2025 has been identified as UNK_SmudgedSerpent by cybersecurity researchers.\nAccording to an advisory published by Proofpoint today, the group targeted individuals focused on Iran and global political developments, initiating contact through seemingly harmless conversations before attempting to steal credentials and deliver malware.\nThis activity combined techniques typically seen across multiple Iranian-linked threat groups, yet did not align cleanly with any single one. Proofpoint said the cluster shares traits with TA453, TA455 and TA450, but the overlaps are not strong enough for definitive attribution.\nMulti-stage Lure and Delivery Chain\nInvestigators first observed an email discussing economic strains and unrest in Iran in June, sent to more than 20 think tank experts in the US.\nAfter replies, attackers escalated the conversation and introduced spoofed collaboration materials via an OnlyOffice-styled link. The URL ultimately led to health-themed domains that collected credentials and delivered a ZIP file containing an MSI used to load remote monitoring and management (RMM) tools.\nThose tools included PDQConnect and later ISL Online – a sequence researchers found unusual in nation-state operations.\nEarly messages impersonated Brookings Institution vice president Suzanne Maloney, using a slightly misspelled Gmail account. Later waves spoofed policy expert Patrick Clawson, targeting an academic believed to be Israeli, then returning in August with lures tied to Iran’s activities in Latin America.\nKey tactics used by UNK_SmudgedSerpent included:\n-\nBenign conversation starters\n-\nThink tank and policy-themed impersonation\n-\nOnlyOffice and Microsoft 365 spoofs\n-\nHealth-related infrastructure\n-\nDeployment of RMM tools\nActivity Paused but Concerns Persist\nThough the group’s timing aligned with heightened Iran–Israel tensions, Proofpoint found no direct connection to those events.\nInstead, researchers suggested possible explanations for the tactical overlap, ranging from shared infrastructure procurement to personnel movement between Iranian contracting outfits. The blending of lure styles, infrastructure and malware across known clusters further complicates attribution.\n“The appearance of a new actor with borrowed techniques suggests there may be personnel mobility or exchange between teams, but with a consistent remit; however, there is no confirmed attribution for UNK_SmudgedSerpent at the time of writing,” Proofpoint said.\n“The TTPs and infrastructure are an extension of previously observed behavior from Iranian threat groups, and the targeting of Iran foreign policy experts continues to reflect the Iranian government’s intelligence collection priorities.”\nUNK_SmudgedSerpent activity stopped appearing in email telemetry in early August. Yet, infrastructure tied to the group later surfaced, hosting TA455-linked malware, indicating continued overlap and the possibility of ongoing operations.",
      "enhanced_at": 1762427864.9614546,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:44.961775+00:00Z"
}