{
  "id": "infosecurity-magazine-2025-11-05-2890380a",
  "source_id": "infosecurity-magazine",
  "guid": "https://www.infosecurity-magazine.com/news/operation-chargeback-uncovers/",
  "title": "Operation Chargeback Uncovers €300m Fraud Scheme in 193 Countries",
  "url": "https://www.infosecurity-magazine.com/news/operation-chargeback-uncovers/",
  "published_at": "2025-11-05T16:45:00+00:00",
  "fetched_at": "2025-11-06T11:13:54.970849+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Operation “Chargeback” has dismantled global fraud networks misusing stolen card data from more than 4.3 million victims",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Operation “Chargeback” has led to coordinated law enforcement action against three alleged international fraud and money laundering networks, which investigators say have misused stolen credit card data from more than 4.3 million cardholders across 193 countries.\nA sweeping series of raids and arrests unfolded on November 4 2025, after nearly five years of investigation.\nMore than 60 searches took place, and 18 arrest warrants were executed. Authorities estimate the scheme caused damage exceeding €300m, with attempted losses topping €75m.\nThe networks allegedly created around 19 million fake online subscription payments for adult content, dating platforms and streaming services while disguising monthly charges of about €50 to avoid detection.\nGlobal Action and Arrests\nThe Cybercrime Department of the General Prosecutor’s Office in Koblenz, along with the German Federal Criminal Police Office, led the operation, supported by Europol and Eurojust.\nOfficials targeted 44 suspects across Germany and abroad, including executives at payment service providers and crime-as-a-service intermediaries.\nIn Germany, 29 properties were searched and five arrests were carried out. More than 250 officers took part, and assets worth over €35m were secured in Germany and Luxembourg.\nAlleged Payment System Abuse\nInvestigators say four major German payment service providers’ systems were exploited to process illicit transactions.\nSix suspects, including compliance staff, are accused of knowingly enabling network access in exchange for fees. To obscure the money trail, the networks relied on shell companies in the UK and Cyprus, using fake directors and falsified know-your-customer (KYC) documents.\nKey elements identified by investigators included:\n-\nStolen credit card data used for subscription fraud\n-\nHidden websites accessible only by direct links\n-\nLow-value recurring charges to avoid alerts\n-\nShell firms to launder proceeds\nInternational Cooperation\nThe action day spanned the US, Canada, Singapore, Luxembourg, Cyprus, Spain, Italy and the Netherlands.\nMore than 90 legal assistance requests were filed with 30 countries. Seized digital evidence is now under review, and the suspects face accusations of organized computer fraud, membership in a criminal group and money laundering.\nEuropol executive director Catherine De Bolle said the coordinated effort shows the value of working across borders.\n“Operation Chargeback is a testament to the power of international cooperation in dismantling complex criminal networks,” she said.\n“[It shows] our commitment to staying ahead of evolving threats.”\nThe operation comes weeks after Eupol called for stronger data laws to combat cybercrime.\nImage credit: Markus Mainka / Shutterstock.com",
      "enhanced_at": 1762427855.494712,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:35.495054+00:00Z"
}