{
  "id": "latest-news-zdnet-com-2025-11-05-663c77ba",
  "source_id": "latest-news-zdnet-com",
  "guid": "849e3a82-2843-42b8-aedc-86f76a8d89cc",
  "title": "This free T-Mobile service could save your life, no matter what carrier you use - here's how",
  "url": "https://www.zdnet.com/article/this-free-t-mobile-service-could-save-your-life-no-matter-what-carrier-you-use-heres-how/",
  "published_at": "2025-11-05T21:37:00+00:00",
  "fetched_at": "2025-11-06T11:16:48.395838+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "T-Mobile's 'Text to 911' satellite service is available free of charge to anyone with a compatible smartphone. Here's how to sign up.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "This free T-Mobile service could save your life, no matter what carrier you use - here's how\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- T-Mobile's Text to 911 service is now available.\n- The option is available free of charge to anyone with a compatible smartphone.\n- T-Mobile, Verizon, and AT&T customers can sign up for it.\nImagine you need medical help, but you're in a remote and desolate location without traditional cell service. That's the sort of scenario T-Mobile's new Text to 911 satellite-based service aims to address.\nLaunched on Tuesday, T-Mobile's Text to 911 option is available to anyone with a compatible iPhone or Android phone. Yes, that includes Verizon and AT&T subscribers. The service is designed to work anywhere across the 500,000 square miles in the US not covered by terrestrial cell towers. All you need is a clear view of the sky to snag a signal from one of the 657 low-Earth orbit Starlink satellites used by T-Mobile.\nAlso: T-Mobile just made it hard for tech enthusiasts like me to leave - here's what changed\nBest of all, Text to 911 is free for anyone with the right type of phone, regardless of your carrier. Once you're signed up, you don't need to take any special action to use it. With a view of the sky, your phone should automatically connect to a corresponding satellite if and when no terrestrial signal is available. From there, simply open your messages app and send a standard text message addressed to 911.\nThe 911 texting requires an iPhone 13 or higher or a compatible Android phone. T-Mobile's T-Satellite support page lists all compatible devices under the Eligible Devices section.\nHow to sign up for Text to 911\nHow do you join up?\nT-Mobile customers should sign in to their account online or through the T-Life app, then head to the section for \"Manage Data & Add-ons,\" and activate the Text to 911 option. Non-T-Mobile users will need to browse to the T-Satellite page for Text to 911 and fill out the necessary forms to get the 911 service. Business customers are asked to call T-Mobile at 1-866-380-7511 to sign up.\n\"There's a good chance you've had that moment in your life at some point,\" Mike Katz T-Mobile marketing president for Strategy & Products, said in a news release. \"Badly rolled ankle deep into a backcountry hike. Stuck in a tree well while skiing. Flat tire on a backcountry road. Or a million other situations that require access to emergency services in a place without cell service. It's an absolutely terrifying feeling that we don't want anyone to have ever again.\"\n\"T-Mobile Text to 911 with T-Satellite gives peace of mind,\" Katz added. \"It's there when you need it the most. And it's too important to keep gated. Now all wireless users with a compatible phone can sign up for T-Mobile Text to 911 for absolutely free.\"\nAlso: The fastest US mobile carriers and ISPs, ranked\nOfficially rolled out in July following a free beta period, the carrier's Starlink T-Satellite service aims to provide connectivity in areas where conventional cellular access is unavailable. The service currently allows you to send and receive SMS and MMS (Multimedia Messaging Service) text messages. You can also share images, voice notes, and short videos. Additionally, the service enables you to utilize a variety of supported apps, including WhatsApp, X, T-Life, AllTrails, AccuWeather, and Google Maps.\nOverall, T-Satellite access is freely available to T-Mobile customers with a Go5G Next plan, an Experience Beyond plan, T-Priority, or SuperMobile. Other T-Mobile subscribers, as well as Verizon and AT&T subscribers, will have to pay $10 a month to use the full service.\nGet the morning's top stories in your inbox each day with our Tech Update newsletter.",
      "enhanced_at": 1762427828.8634028,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:08.863738+00:00Z"
}