{
  "id": "latest-news-zdnet-com-2025-11-05-4fd42201",
  "source_id": "latest-news-zdnet-com",
  "guid": "326298a6-95cc-4a00-99f9-8f35a32692a6",
  "title": "Microsoft confirms a bug is hitting paid Windows 10 ESU users - here's what's happening",
  "url": "https://www.zdnet.com/article/microsoft-confirms-a-bug-is-hitting-paid-windows-10-esu-users-heres-whats-happening/",
  "published_at": "2025-11-05T21:46:00+00:00",
  "fetched_at": "2025-11-06T11:16:48.395565+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "This problem has affected both consumer and business versions of Windows 10.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Microsoft confirms a bug is hitting paid Windows 10 ESU users - here's what's happening\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Windows 10 may tell you that support has ended even if you paid for it.\n- The incorrect message is due to a display bug.\n- Microsoft promises a fix in a future Windows update.\nMicrosoft offers extended security updates for its now unsupported Windows 10 system. But some people who've signed up for the program may still be seeing \"end of support\" messages on their PC. No, you didn't do anything wrong. It's a bug, not a feature.\nIn a new update to its \"Windows 10, version 22H2 known issues and notifications\" page, Microsoft acknowledged that a specific message may appear telling you that \"your version of Windows has reached the end of support.\" The message could pop up if you've installed the KB5066791 Windows update rolled out on Oct. 14, 2025, the last official security update for Windows 10.\nAlso: How to upgrade your 'incompatible' Windows 10 PC to Windows 11 - 2 free options\nThis problem has hit both consumer and business flavors of Windows 10. Affected versions include Windows 10 22H2 Pro, Education, and Enterprise editions enrolled in the ESU program and configured with an ESU product key. Windows 10 Enterprise LTSC 2021 and Windows 10 IoT Enterprise LTSC 2021 are also impacted.\nThe good news is that the glitch is a display issue, according to Microsoft. Windows 10 machines with a valid license for the ESU program will continue to receive security updates as promised.\nAs a workaround, Microsoft has already pushed out a \"cloud configuration update.\" But this one is designed more for businesses than individual consumers. Instead, you may have to wait for a future Windows update in which the company says it will fix the issue.\nMany people and companies are still stuck on Windows 10 despite the loss of official Microsoft support in October. The ESU program is a way to reclaim and extend that support for at least another year. You can qualify for the ESU using a few different methods.\nIf you don't mind spending a few dollars, the program costs a flat fee of $30. Otherwise, you're able to redeem 1,000 Microsoft Rewards points. To earn those rewards points, you typically have to run different searches using Microsoft Bing.\nAlso: Microsoft said my PC couldn't run Windows 11, but I upgraded in 5 minutes anyway - here's how\nBut the least expensive method is to simply use the built-in Windows Backup tool to back up and sync your settings to the cloud. Whichever method you choose, Windows should detect that you're signed up and add you to the list for future updates.\nHow to check for the bug\nTo see if the bug has hit your Windows 10 PC, head to Settings, select Update & Security, and then click Windows Update. The full message will say: \"Your version of Windows has reached the end of support. Your device is no longer receiving security updates.\"\nTo confirm that your computer is set to receive the updates, you'll see a message on the side that specifically says: \"Your PC is enrolled to get extended security updates.\" If that's the case, then don't worry about the glitchy error message. You're still on track to receive the regular security updates.",
      "enhanced_at": 1762427827.5258896,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:07.526258+00:00Z"
}