{
  "id": "latest-news-zdnet-com-2025-11-05-d5cafa5c",
  "source_id": "latest-news-zdnet-com",
  "guid": "0a76c1b9-0747-4507-b1ba-d26dcfc0ee85",
  "title": "Why Amazon really doesn't want Perplexity's AI browser shopping for you",
  "url": "https://www.zdnet.com/article/why-amazon-really-doesnt-want-perplexitys-ai-browser-shopping-for-you/",
  "published_at": "2025-11-05T22:02:00+00:00",
  "fetched_at": "2025-11-06T11:16:48.395293+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Perplexity called Amazon's actions 'a threat to all internet users.'",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Why Amazon really doesn't want Perplexity's AI browser shopping for you\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Amazon has threatened legal action against AI startup Perplexity.\n- Perplexity called the move \"a threat to all internet users.\"\n- The fight could impact the future of AI-powered shopping.\nThe battle over the future of AI-powered shopping has begun.\nAmazon sent Perplexity a cease-and-desist letter on Friday, demanding that the AI start-up immediately block its agentic Comet browser from making purchases on behalf of users in the Amazon Store.\nAlso: Google's AI mode agents can snag event tickets for you now – here's how\nAddressed to Perplexity CEO Aravind Srinivas, the letter claims the company has ignored multiple warnings about its Comet browser violating Amazon's conditions of use by not identifying itself as an AI agent, and that the company's \"ongoing illegal intrusion into the Amazon Store has already caused considerable harm, including disrupting Amazon's customer relationships and forcing Amazon to devote significant resources to track, investigate, and address Perplexity's misconduct.\"\nThe letter added that if Perplexity did not agree with its terms by Monday at 5 p.m., Amazon would pursue legal action against the company.\nInstead of complying, Perplexity fired back on Tuesday with a blog post titled \"Bullying is not innovation.\" The company painted itself as Silicon Valley's young David taking on an enormous tech Goliath (i.e., Amazon), which had lost sight of its founding startup ethic and, by seeking to forcibly block Perplexity's AI shopping assistant, was brazenly prioritizing ad revenue and other nefarious forms of user exploitation over what it had originally been built to provide: a frictionless online shopping experience.\nAlso: I let ChatGPT Atlas do my Walmart shopping for me - here's how the AI browser agent did\n\"This is Amazon's first legal salvo against an AI company, and it is a threat to all internet users,\" Perplexity wrote.\nThe old guard meets the new\nPerplexity is also framing its legal battle with Amazon as a competition between the old guard of AI-powered shopping and an emerging paradigm where agents act as extensions of human users, shopping on their behalf and thereby liberating them from the time-consuming work of shopping for the best deals, comparing product offerings, and the like.\n\"For decades, machine learning and algorithms have been weapons in the hands of large corporations, deployed to serve ads and manipulate what you see, experience, and purchase,\" Perplexity wrote. \"The transformative promise of LLMs is that they put power back in the hands of people. Agentic AI marks a meaningful shift: users can finally regain control of their online experiences.\"\nAlso: Beware of getting your product buying advice from AI for one big reason, says Ziff Davis CEO\nIn other words: Sit back and relax, Amazon shoppers -- Comet can zip through the online shopping process without getting bogged down by spammy ads and predatory offers.\nAmazon sees things differently, of course, arguing in its letter that the use of Comet \"degrades the Amazon shopping experience\" by bypassing crucial and familiar points of engagement.\n\"When Comet AI shops and makes purchases from the Amazon Store, Comet AI may not select the best price, delivery method, or recommendations, and Amazon customers may not receive critical product information,\" Amazon's legal counsel wrote in its letter. \"For example, Comet AI does not offer Amazon customers the option of adding products to existing deliveries, which can result in improved delivery times and lower shipment volumes.\"\nAlso: PayPal's new service is built for the AI shopping future - security included\nThe letter also claims that using Comet also endangers Amazon user privacy (which Perplexity denied in its retort).\nWhose AI assistant wins?\nAmazon has a delicate line to toe here. AI boomerism has become an ideological sticking point throughout Silicon Valley -- one of the great taboos of modern tech (at least if you're trying to attract investor dollars) is appearing to be an AI Luddite.\nAmazon, therefore, made it a point to clarify in its letter that while it was firmly opposed to Perplexity's use of Comet to shop on behalf of human users, it was steadfastly committed to the zeitgeist's broader embrace of AI.\nAlso: AI agents are only as good as the data they're given, and that's a big issue for businesses\n\"As a general matter, Amazon shares the industry's excitement about AI innovations and sees significant potential for agentic AI to improve customer experiences in a range of areas,\" the company's legal counsel wrote. \"But to successfully deliver for customers, AI agents that offer to make purchases on behalf of customers must operate transparently when taking actions purportedly on a customer's behalf.\"\nTherein lies Amazon's core motivation: it's currently pushing its own AI shopping assistant, Rufus, which it launched back in July. As Perplexity pointed out in its blog, Amazon CEO Andy Jassy told investors in an earnings call last week that the company \"[expects] over time to partner with third-party agents.\" The implication is that AI shopping assistants erode the optimal user shopping experience -- unless they're built by Amazon itself.\nIt's not the only e-commerce site actively trying to capitalize on agent-powered shopping experiences. In the company's own earnings call earlier this week, Shopify -- which builds online shopping experiences for businesses -- reported that purchases through its platform and rooted in AI-powered search had increased elevenfold since January.\nAI and the future of human agency\nThe unfolding dispute between Amazon and Perplexity offers an early glimpse of what could become a long and protracted conflict throughout the e-commerce world as it witnesses the rise of agentic shopping assistants.\nAlso: I run a very small business. Here are 21 simple ways AI saves me time every day\nIn one corner, Perplexity and similar AI-native startups will argue that they're empowering users through automation, while saluting some vague founding ethos of the internet as a tool for democratizing access to everything, including that deal on the vacuum cleaner you've been eyeing on Amazon. Bigger, more established tech companies like Amazon, on the other hand, are likely to argue that the ad-based model on which the internet has been built over the past 20+ years, while admittedly imperfect, is certainly better than an all-out free-for-all where armies of anonymous agents undercut the choices of individual users.\nThat, ultimately, is what it boils down to: human agency. Will it be expanded or eroded by AI? Only time -- and probably more than a few legal battles -- will tell.",
      "enhanced_at": 1762427812.6889186,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:16:52.689252+00:00Z"
}