{
  "id": "news-the-citizen-lab-citizenlab-org-2025-11-05-9a0ae4e6",
  "source_id": "news-the-citizen-lab-citizenlab-org",
  "guid": "https://citizenlab.ca/?p=82854",
  "title": "Citizen Lab Researchers Sign Open Letter on Canada’s AI Strategy",
  "url": "https://citizenlab.ca/2025/11/citizen-lab-researchers-sign-open-letter-on-canadas-ai-strategy/",
  "published_at": "2025-11-05T21:54:08+00:00",
  "fetched_at": "2025-11-06T11:15:32.371869+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Citizen Lab researchers and director Ron Deibert have signed an open letter to the Canadian Minister of AI and Minister of Industry rejecting the &ldquo;National Sprint&rdquo; on AI strategy. The letter calls upon the ministers to extend the consultation deadline, rewrite the public survey, and create a more representative AI task force. Signatories of the letter refuse to validate the consultation, calling it a &ldquo;facade for manufacturing consent for a harmful preordained agenda&rdquo; and stating their intention to host an independent and separate &ldquo;People&rsquo;s Consultation on AI.&rdquo; Read the letter here.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Citizen Lab researchers and director Ron Deibert have signed an open letter to the Canadian Minister of AI and Minister of Industry rejecting the “National Sprint” on AI strategy. The letter calls upon the ministers to extend the consultation deadline, rewrite the public survey, and create a more representative AI task force.\nSignatories of the letter refuse to validate the consultation, calling it a “facade for manufacturing consent for a harmful preordained agenda” and stating their intention to host an independent and separate “People’s Consultation on AI.”\nRead the letter here.",
      "enhanced_at": 1762427819.9164681,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:16:59.916780+00:00Z"
}