{
  "id": "security-affairs-securityaffairs-co-2025-11-05-458dac06",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184258",
  "title": "SonicWall blames state-sponsored hackers for September security breach",
  "url": "https://securityaffairs.com/184258/security/sonicwall-blames-state-sponsored-hackers-for-september-security-breach.html",
  "published_at": "2025-11-05T21:54:25+00:00",
  "fetched_at": "2025-11-06T11:16:27.012644+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Cybersecurity firm SonicWall attributed the September security breach exposing firewall configuration files to state-sponsored hackers. In September, SonicWall urged customers to reset credentials after firewall backup files tied to MySonicWall accounts were exposed. The company announced it had blocked attackers’ access and was working with cybersecurity experts and law enforcement agencies to determine the scope of the breach. SonicWall initially said under 5% of customers were impacted, and no files leaked. The incident impacted SonicWall Firewalls with preference files backed up in MySonicWall.com On October 8, SonicWall confirmed that threat actors accessed the preference files of all firewalls using its MySonicWall cloud backup service. SonicWall said the stolen files contain encrypted credentials and configs, which could aid attacks. They are notifying affected users and providing assessment tools. Updated device lists now classify impacted firewalls by priority to guide remediation. The cybersecurity firm urged password resets and revealed that the security breach is unrelated to Akira ransomware or SSLVPN attacks. Now, SonicWall says state-sponsored hackers are behind the September security breach. Mandiant confirmed the breach didn’t impact SonicWall products, firmware, tools, source code, or customer networks. &#8220;The Mandiant investigation is now complete. Their findings confirm that the malicious activity – carried out by a state-sponsored threat actor &#8211; was isolated to the unauthorized access of cloud backup files from a specific cloud environment using an API call.&#8221; reads the announcement published by the company. &#8220;The incident is unrelated to ongoing global Akira ransomware attacks on firewalls and other edge devices. &#8220; SonicWall applied Mandiant’s fixes and is strengthening its systems with the help of external experts. &#8220;As nation-state–backed threat actors increasingly target edge security providers, especially those serving SMB and distributed environments, SonicWall is committed to strengthening its position as a leader for partners and their SMB customers on the front lines of this escalation.&#8221; continues the announcement. &#8220;Our platform strategy is already aligned to that future.&#8221; Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, state-sponsored hackers)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "In September, SonicWall urged customers to reset credentials after firewall backup files tied to MySonicWall accounts were exposed. The company announced it had blocked attackers’ access and was working with cybersecurity experts and law enforcement agencies to determine the scope of the breach.\nSonicWall initially said under 5% of customers were impacted, and no files leaked.\nThe incident impacted SonicWall Firewalls with preference files backed up in MySonicWall.com\nOn October 8, SonicWall confirmed that threat actors accessed the preference files of all firewalls using its MySonicWall cloud backup service.\nSonicWall said the stolen files contain encrypted credentials and configs, which could aid attacks. They are notifying affected users and providing assessment tools. Updated device lists now classify impacted firewalls by priority to guide remediation.\nThe cybersecurity firm urged password resets and revealed that the security breach is unrelated to Akira ransomware or SSLVPN attacks.\nNow, SonicWall says state-sponsored hackers are behind the September security breach. Mandiant confirmed the breach didn’t impact SonicWall products, firmware, tools, source code, or customer networks.\n“The Mandiant investigation is now complete. Their findings confirm that the malicious activity – carried out by a state-sponsored threat actor – was isolated to the unauthorized access of cloud backup files from a specific cloud environment using an API call.” reads the announcement published by the company. “The incident is unrelated to ongoing global Akira ransomware attacks on firewalls and other edge devices. “\nSonicWall applied Mandiant’s fixes and is strengthening its systems with the help of external experts.\n“As nation-state–backed threat actors increasingly target edge security providers, especially those serving SMB and distributed environments, SonicWall is committed to strengthening its position as a leader for partners and their SMB customers on the front lines of this escalation.” continues the announcement. “Our platform strategy is already aligned to that future.”\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n(SecurityAffairs – hacking, state-sponsored hackers)",
      "enhanced_at": 1762427817.8546293,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:16:57.854969+00:00Z"
}