{
  "id": "security-affairs-securityaffairs-co-2025-11-05-bb131a04",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184215",
  "title": "Nine arrested in €600M crypto laundering bust across Europe",
  "url": "https://securityaffairs.com/184215/cyber-crime/nine-arrested-in-e600m-crypto-laundering-bust-across-europe.html",
  "published_at": "2025-11-05T06:29:47+00:00",
  "fetched_at": "2025-11-05T11:16:21.745872+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A coordinated Eurojust-led operation led to nine arrests in Cyprus, Spain, and Germany for laundering €600M in crypto fraud. Authorities in France, Belgium, and Cyprus arrested nine people in a coordinated Eurojust-led operation against a crypto money laundering ring that stole over €600 million. The group ran dozens of fake crypto investment sites that promised high returns and lured victims through social media ads, cold calls, fake news, and celebrity endorsements. Once victims sent their crypto, the scammers kept the funds and laundered them through blockchain transactions. Eurojust coordinated efforts with French, Belgian, Cypriot, German, and Spanish investigators to dismantle the network. Authorities seized €800K in bank funds, €415K in crypto, and €300K in cash during home raids tied to the arrests. &#8220;Actions against the suspects took place on 27 and 29 October and were coordinated from the Eurojust premises in The Hague. Nine suspects were arrested at their homes in Cyprus, Spain and Germany on suspicion of their involvement in money laundering from fraudulent activities.&#8221; reads the press release published by Eurojust. &#8220;At the same time, searches took place that resulted in the seizure of EUR 800 000 in bank accounts, EUR 415 000 in cryptocurrencies and EUR 300 000 in cash.&#8221; Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, crypto laundering)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}