{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-05-c130859e",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/marks-spencer-profits-wiped-out-cyberattack",
  "title": "Cyberattack ate up profits for first half of year, retailer M&S says",
  "url": "https://therecord.media/marks-spencer-profits-wiped-out-cyberattack",
  "published_at": "2025-11-05T17:08:42+00:00",
  "fetched_at": "2025-11-06T11:15:47.154911+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "British retailer Marks & Spencer (M&amp;S) said a cyberattack earlier this year was an \"extraordinary\" moment for the company, nearly wiping out profits.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Cyberattack ate up profits for first half of year, retailer M&S says\nThe cyberattack on the British retailer Marks & Spencer (M&S) caused profits at the company to plunge to £3.4 million pounds ($4.4 million) in the first half of 2025 — down from £391.1 million ($510 million) during the same period a year ago.\n“The first half of this year was an extraordinary moment in time for M&S,” said CEO Stuart Machin, who said the company is “getting back on track” after a cyberattack in April that disrupted online sales for months. The company previously predicted its profits would take a £300 million ($395 million) hit from the incident.\nAfter discovering the cyberattack, the company disconnected its warehouse management systems and online ordering. Home delivery orders resumed in June and “click and collect” — whereby customers order goods online for pickup — was restored in August, the company said.\n“Practically all operational systems have now been recovered,” the company said in its earnings report.\nM&S said Wednesday that an £100 million ($130.4 million) insurance payment helped to soften the revenue blow.\nThe incident — part of a cluster of costly cyberattacks targeting prominent British retailers — is believed to be linked to the Scattered Spider hacking collective. Four people, including one teenage minor, were arrested in July in connection to hacks on Co-op, Harrods and M&S.\nOther U.K. clothing retailers have benefited from M&S’s struggles, including Next, which last week reported a 7.6% rise in sales in part due to “competitor disruption.”\nJames Reddick\nhas worked as a journalist around the world, including in Lebanon and in Cambodia, where he was Deputy Managing Editor of The Phnom Penh Post. He is also a radio and podcast producer for outlets like Snap Judgment.",
      "enhanced_at": 1762427851.837016,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:31.837366+00:00Z"
}