{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-05-5b4e8504",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/china-sentences-5-myanmar-scam-kingpins-to-death",
  "title": "China sentences 5 Myanmar scam kingpins to death",
  "url": "https://therecord.media/china-sentences-5-myanmar-scam-kingpins-to-death",
  "published_at": "2025-11-05T21:51:28+00:00",
  "fetched_at": "2025-11-06T11:15:47.154286+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Five others were handed life sentences, while nine of the accused were handed prison sentences of three to 20 years.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "China sentences 5 Myanmar scam kingpins to death\nA Chinese court sentenced five members of a Myanmar crime syndicate to death for their roles in running industrial-scale scamming compounds near the border with China.\nThe Shenzhen Intermediate People's Court of Guangdong Province announced on Tuesday death sentences for the syndicate boss Bai Suocheng and his son Bai Yingcang, as well as Yang Liqiang, Hu Xiaojiang and Chen Guangyi. Five others were handed life sentences, while nine of the accused were handed prison sentences of three to 20 years. Two other members of the syndicates were given two-year suspended death sentences, meaning they would be subject to execution if they commit further crimes.\nSuocheng and his son Yingcang were the former leaders of the Kokang Border Guard Force, a militia operating at the behest of Myanmar’s ruling military junta that was known to profit from a range of illegal activities.\nUpset that the scamming operations were targeting Chinese citizens, Beijing launched a cross-border crackdown in 2023, arresting tens of thousands of people, including leaders of crime families in the Kokang region.\nEleven members of the Ming crime family arrested during the crackdown were sentenced to death in September for running a scamming empire.\nAccording to Xinhua, the Bai family and its associates built 41 industrial parks where they “engaged in telecommunications and online fraud, operating casinos, intentional homicide, intentional injury, kidnapping, extortion, organizing and forcing prostitution, and organizing illegal border crossings.” They defrauded people of more than 29 billion yuan (more than $4 billion), the court alleged, and their operations resulted in the deaths of at least six Chinese citizens.\nMyanmar is a nexus of the scamming industry, which has grown into a global scourge causing billions of losses through pig butchering and other schemes around the world each year.\nRecently, junta forces claimed to have raided and dynamited buildings within the infamous KK Park compound on the border with Thailand. More than 1,600 people reportedly fleeing the scam centers were detained by Thai authorities as they attempted to cross from Myanmar.\nJames Reddick\nhas worked as a journalist around the world, including in Lebanon and in Cambodia, where he was Deputy Managing Editor of The Phnom Penh Post. He is also a radio and podcast producer for outlets like Snap Judgment.",
      "enhanced_at": 1762427825.505168,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:05.505579+00:00Z"
}