{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-05-0d0b45d4",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/japan-nikkei-slack-breach",
  "title": "Japanese media giant Nikkei reports Slack breach exposing employee and partner records",
  "url": "https://therecord.media/japan-nikkei-slack-breach",
  "published_at": "2025-11-05T17:15:21+00:00",
  "fetched_at": "2025-11-06T11:15:47.154614+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Japanese media giant Nikkei said hackers gained unauthorized access to its internal Slack communication system, potentially exposing data linked to more than 17,000 people.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Japanese media giant Nikkei reports Slack breach exposing employee and partner records\nJapanese media giant Nikkei said hackers gained unauthorized access to its internal Slack communication system, potentially exposing data linked to more than 17,000 people.\nThe company discovered the breach in September but publicly reported it on Tuesday. According to a statement, the incident occurred after an employee’s computer was infected with malware, allowing attackers to steal login credentials and use them to break into Slack, a popular business messaging platform.\nNikkei said the breach may have exposed the names, email addresses, and chat histories of over 17,300 Slack users — including employees and business partners. It added that there is no evidence suggesting any compromise of journalistic sources or reporting-related information.\nThe company, which owns the Financial Times and publishes one of the world’s largest financial newspapers, The Nikkei, employs more than 3,000 people and operates 37 overseas editorial bureaus.\nNikkei said it voluntarily reported the incident to Japan’s data protection authorities “to ensure transparency,” even though the leaked data does not fall under the country’s personal information protection laws.\nThe company did not comment on who might be behind the attack or the hackers’ motives.\n“We take this incident seriously and will further strengthen personal information management to prevent any recurrence,” the statement said.\nIt is not the first time Nikkei has faced a cyber incident. In 2022, its Singapore headquarters was hit by a ransomware attack that potentially involved customer data.\nThe breach comes amid a wave of cyberattacks on media organizations. Earlier this year, a ransomware attack disrupted print editions of U.S. newspaper chain Lee Enterprises, while France’s Agence France-Presse reported an attack that disrupted parts of its news delivery system. Media outlets including The New York Times, Vice Media, and iHeartMedia have also faced cyber incidents in recent years.\nDaryna Antoniuk\nis a reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.",
      "enhanced_at": 1762427847.5973847,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:27.597705+00:00Z"
}