{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-05-0ab8c738",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/section-702-surveillance-powers-renewal-jim-himes-house-democrats",
  "title": "Democratic support for surveillance powers will be 'heavier lift' next time, House lawmaker says",
  "url": "https://therecord.media/section-702-surveillance-powers-renewal-jim-himes-house-democrats",
  "published_at": "2025-11-05T15:53:21+00:00",
  "fetched_at": "2025-11-06T11:15:47.155181+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Rep. Jim Himes said things have changed for House Democrats when it comes to their potential to back legislation to renew Section 702 of the Foreign Intelligence Surveillance Act.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Democratic support for surveillance powers will be 'heavier lift' next time, House lawmaker says\nHouse Democrats likely will be less inclined to support renewal of a key U.S. national security power next year, a senior lawmaker predicted on Tuesday.\nLegislation to reauthorize Section 702 of the Foreign Intelligence Surveillance Act (FISA) passed in both chambers of Congress last year and will take Democratic support in the House to happen again in 2026, Rep. Jim Himes, the ranking member on the House Intelligence Committee, said during an event at the Council on Foreign Relations in Washington, D.C.\n“The bad news, quite bluntly, is that FISA was reauthorized with a very strong vote on the floor [where] the majority was the minority. In other words, Democrats produced more votes than the Republicans did,” Himes (D-CT) said.\nThe GOP-controlled House passed legislation to reauthorize Section 702 for two years. The Senate also backed renewal but with the bare minimum of required votes. The law empowers broad electronic surveillance of the communications of overseas threats, such as terrorists, hackers and foreign spies.\n“Were it to be reauthorized, which it must be reauthorized, you would need somewhere in the neighborhood of 90, 100, 110 Democrats,” he added. “It won't surprise you to know that the Democratic caucus of the House is in a very different place with respect to questionable authorities or arguable authorities than they were two years ago. Like it or not, that's a fact.”\nThe comments were a nod to President Donald Trump’s expansive use of presidential authority, ranging from ongoing military strikes against Venezuelan fishing boats to the use of the National Guard for immigration enforcement in major Democratic cities like Los Angeles and Chicago.\nEven though the use of Section 702 by the U.S. intelligence community, and particularly the FBI, is “much, much better than it was, I think it would be a much heavier lift,” Himes said.\nWhile the statute is considered a critical tool to national security by intelligence officials, a coalition of progressive and conservative lawmakers have long argued against it because of how it enables some private data belonging to Americans to be collected and searched without a warrant.\nIn fact, the last reauthorization passed the House only after an amendment to impose a warrant requirement to search that information failed in a 212-212 tie vote.\nRecorded Future News reported that the chair of the Senate Intelligence Committee is already floating plans that would punt the controversial authority's renewal until after the 2026 midterms.\nThere is also speculation on Capitol Hill that a new sunset date might be tucked into the annual defense policy bill, one of the few measures to consistently pass, while some Republicans believe Trump, a longtime FISA critic, will bless an extension in a stopgap government funding measure.\n‘Good news’\nHimes said the “good news is that we're really seeing a dramatic improvement in the administrative protections around the use of these authorities.”\n“They've really cleaned up their act in a very big way” on aspects like “U.S. person queries,” where analysts search the massive 702 database for information about Americans.\nThe matter was a hot topic during the last extension debate after it was publicly disclosed the FBI used the foreign-spying tool to search for information about defendants in the January 6 attack on the U.S. Capitol and the 2020 George Floyd protests and even a member of the House Intelligence Committee.\nIn September, the Office of the Director of National Intelligence released an unclassified opinion by the surveillance court that oversees Section 702 that found after “a series of reforms, some of which are codified in [the last reauthorization bill, the FBI seems to be improving its implementation of the general querying standard.”\nThe Foreign Intelligence Surveillance Court (FISC) opinion noted that the bill required the Justice Department to audit each U.S.-person query conducted by the bureau every 180 days.\n“Through March 14, 2025, the Court has received notices describing some 4,732 queries that were identified by the persons conducting them as U.S.-person or presumed U.S.-person queries and reviewed by DOJ under this requirement. Only 31 (.66%) of those queries failed to comply with the querying standard,” the FISC opinion stated.\nTestifying before the Senate Judiciary Committee in September, FBI Director Kash Patel lauded his agency’s efforts at better compliance with the law.\n“I've changed that if you make a mistake, you're immediately sidelined. A review is conducted, and if it was an actual mistake, i.e., there should have been ‘s’ on the end of that name, and there wasn't, then we put you back in but we have to review those matters,” he told lawmakers. “If there was an intentional mistake, you have no more access to the 702 query system and its database.”\nHe also defended a decision to shutter the bureau’s own Section 702 auditing office, calling it “a great example of duplicative work,” and that compliance is now run solely through its Inspection Division.\nMartin Matishak\nis the senior cybersecurity reporter for The Record. Prior to joining Recorded Future News in 2021, he spent more than five years at Politico, where he covered digital and national security developments across Capitol Hill, the Pentagon and the U.S. intelligence community. He previously was a reporter at The Hill, National Journal Group and Inside Washington Publishers.",
      "enhanced_at": 1762427867.5244627,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-06T11:17:47.524773+00:00Z"
}