{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-23-e2f094af",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42354",
  "title": "El 42% de las pymes españolas prioriza la seguridad a la hora de plantear su gestión financiera",
  "url": "https://cybersecuritynews.es/el-42-de-las-pymes-espanolas-prioriza-la-seguridad-a-la-hora-de-plantear-su-gestion-financiera/",
  "published_at": "2025-11-23T22:00:00+00:00",
  "fetched_at": "2025-11-24T11:19:49.710809+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "La transformación digital avanza entre las pequeñas y medianas empresas españolas, pero la seguridad sigue siendo un eje central en sus decisiones financieras. Según el&nbsp;Estudio sobre tecnología y finanzas en las pymes españolas&nbsp;elaborado por&nbsp;Qonto, la&nbsp;confianza&nbsp;(48%), las&nbsp;comisiones&nbsp;(48%) y la&nbsp;seguridad en las operaciones financieras&nbsp;(42%) son los factores más valorados a la hora de elegir un banco, lo que refleja una creciente preocupación por la protección de sus operaciones en un entorno cada vez más digital. Durante este periodo comercial esencial para los comercios del último trimestre del año, Qonto lanza VoP, una función que ayuda a los clientes a confirmar que envían su dinero al destinatario correcto y evitar así errores o fraudes. Ante este contexto, este nuevo estudio de la compañía también revela que el nivel de conocimiento sobre ciberseguridad es limitado. Únicamente&nbsp;un 32% de las empresas dispone de un plan formal de ciberseguridad y solo un 28% ha impartido algún tipo de formación específica a su personal.&nbsp;Estos datos evidencian la necesidad de reforzar el acompañamiento a las empresas en materia de cumplimiento normativo y protección digital, así como de impulsar la adopción de soluciones que garanticen transacciones seguras y una gestión financiera fiable. La integración de medidas de ciberseguridad y la alineación con las directivas europeas no son solo un requisito legal, sino también un factor estratégico para consolidar la confianza en un entorno digital cada vez más exigente. En Europa, la seguridad y la privacidad representan los principales frenos para la digitalización, tal y como afirman un tercio de sus pymes; mientras que en España la percepción es algo más alentadora. Sólo el 28 % de las pymes españolas identifica estos factores como un impedimento, situando al país entre los más optimistas del continente. Su nivel de preocupación por la seguridad y la privacidad está 5 puntos por debajo de la media europea. Esta actitud más audaz permite a las pymes españolas explorar nuevas oportunidades, innovar y experimentar con mayor libertad que muchas de sus homólogas europeas. Refuerzo en seguridad con Verification of Payee (VoP) Verification of Payee (VoP) permitirá a los clientes comprobar, en cuestión de segundos, la coincidencia entre el beneficiario y la cuenta receptora antes de ejecutar una transferencia, evitando fallos que podrían resultar costosos, fraudes y cualquier retraso operativo. “Nuestra investigación revela que un tercio de las pymes europeas identifican la seguridad y la privacidad como el principal obstáculo para la digitalización”, afirma&nbsp;Maxime Laot, directora de riesgos y cumplimiento normativo de Qonto. Y añade: “en un entorno en el que una de cada cuatro empresas ha sido objeto de estafas y casi la mitad se muestra reacia a crecer por temor al fraude, la verificación del beneficiario refuerza la protección de sus operaciones en un momento crítico: Black Friday y Navidad, cuando se dispara el volumen de pagos y los ataques fraudulentos”. En un contexto en el que las empresas afrontan su periodo de mayor volumen de pagos y mayor vulnerabilidad, junto con una creciente presión operativa en la recta final del año, Qonto reafirma su compromiso con la seguridad financiera de las empresas gracias a&nbsp;Verification of Payee (VoP)&nbsp;actuando como capa informativa adicional que favorecerá evitar errores costosos, fraudes y retrasos operativos, sin bloquear las operaciones y mejorando la experiencia de los negocios, especialmente durante temporadas altas.&nbsp; La entrada El 42% de las pymes españolas prioriza la seguridad a la hora de plantear su gestión financiera se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}