{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-23-89c30402",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42357",
  "title": "Deepfakes a precio de saldo: 400 veces más baratos en la darknet",
  "url": "https://cybersecuritynews.es/deepfakes-a-precio-de-saldo-400-veces-mas-baratos-en-la-darknet/",
  "published_at": "2025-11-23T22:00:00+00:00",
  "fetched_at": "2025-11-24T11:19:49.711111+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "El Equipo Global de Investigación y Análisis de Kaspersky (GReAT) ha detectado anuncios en la darknet que ofrecen servicios de deepfake de vídeo y audio en tiempo real. Según estos anuncios, los precios parten de 50 dólares para vídeos falsos y 30 dólares para mensajes de voz fabricados, aumentando en función de la complejidad y la duración del contenido. Estos hallazgos se produjeron tras analizar múltiples plataformas en ruso e inglés. En investigaciones anteriores, Kaspersky había identificado servicios de creación de deepfakes en plataformas de la darknet con precios que oscilaban entre 300 y 20.000 dólares por minuto. Un ejemplo reciente de este tipo de fraude se produjo en España en 2024, cuando un deepfake suplantó la identidad de la doctora Susana Monereo, jefa de Endocrinología y Nutrición del Hospital Gregorio Marañón (Madrid), para promocionar falsamente pastillas de adelgazamiento en redes sociales. De forma similar, en junio de este año, los ciberdelincuentes llegaron a usar la imagen de la presidenta de la Comunidad de Madrid, Isabel Díaz Ayuso, en anuncios falsos difundidos en X (Twitter). En estos vídeos manipulados se simulaba una entrevista televisiva en la que Ayuso supuestamente recomendaba una plataforma de inversión, con un formato que imitaba la identidad visual de RTVE. Según Verifica RTVE, ni la entrevista ni la promoción eran reales: se trataba de un deepfake diseñado para atraer a posibles inversores y redirigirlos a páginas fraudulentas. A diferencia de esos casos, las ofertas actuales permiten a los ciberdelincuentes generar contenido falso de audio y vídeo en tiempo real a un precio mucho más bajo. Los anuncios incluyen varias opciones, como el intercambio de rostros en tiempo real durante videollamadas en plataformas de videoconferencia o mensajería, la sustitución de la cara en procesos de verificación y la manipulación de la señal de la cámara en dispositivos. Los autores de estas publicaciones afirman contar con software capaz de sincronizar las expresiones faciales de una persona en un vídeo con un texto, incluso en otros idiomas, así como herramientas de clonación de voz que permiten modificar el tono y timbre para transmitir emociones específicas. No obstante, es muy probable que muchos de estos anuncios sean en realidad fraudes dirigidos a estafar a posibles compradores. “Ya no solo vemos anuncios que ofrecen ‘deepfake-as-a-service’, sino también una clara demanda de estas herramientas. Los actores maliciosos están experimentando mucho con la IA e incorporándola a sus operaciones. Algunas plataformas presentan capacidades más sofisticadas: por ejemplo, LLM maliciosos creados desde cero, independientes de los modelos disponibles públicamente, que se ejecutan en local. Aunque estas tecnologías no introducen amenazas cibernéticas totalmente nuevas, sí pueden potenciar de forma significativa la capacidad de los atacantes. En este contexto, los expertos en ciberseguridad debemos trabajar para contrarrestar estas amenazas. Una de las formas más efectivas es aprovechar la IA para aumentar la productividad de los profesionales de seguridad como la eficacia de las medidas defensivas”, afirma Dmitry Galov, jefe de Kaspersky Global Research and Analysis Team en Rusia y CIS. La entrada Deepfakes a precio de saldo: 400 veces más baratos en la darknet se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}