{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-16-19b7066a",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42332",
  "title": "El 74% de los españoles asegura no sentirse preparado para identificar una ciberestafa",
  "url": "https://cybersecuritynews.es/el-74-de-los-espanoles-asegura-no-sentirse-preparado-para-identificar-una-ciberestafa/",
  "published_at": "2025-11-16T22:00:00+00:00",
  "fetched_at": "2025-11-17T11:19:17.991564+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Noviembre marca el pistoletazo de salida del periodo de consumo más potente del año. Desde Black Friday, las transacciones online se disparan con consumidores comprando los regalos anticipados de Navidad. Sin embargo, la combinación entre el volumen de compras y el entusiasmo por encontrar una buena oferta convierte este periodo en un terreno fértil para los ciberdelincuentes. De acuerdo con un estudio reciente de Wallapop, la plataforma de consumo consciente y humano, el 74% de los españoles asegura no sentirse preparado para identificar una ciberestafa. Según datos deLa Red del Cambio 2025, los españoles destinan una media de 185€ a sus compras en Black Friday, el pistoletazo de salida de uno de los periodos de más consumo del año al estar tan cerca de Navidad. En un contexto de consumo tan elevado, el 68% de los consumidores asegura haber notado un incremento de los intentos de fraude digital, y solo el 20% afirma no haber sufrido ninguna estafa. Además, el aumento de estafas en estos periodos también suele hacer que los ciberestafadores trabajen en técnicas cada vez más elaboradas. De hecho, ya es más de la mitad de la población (60%) la que siente que sus métodos son cada vez más sofisticados, lo que les hace más difícil detectarlos. Los cinco métodos más comunes de estafa en Wallapop y cómo reconocerlos Uno de los usos más recurrentes de los ciberestafadores en Wallapop es intentar que el usuario abandone la plataforma ya que, fuera de esta, no existe ninguna garantía de seguridad ni protección de pago. Por eso, Wallapop recomienda permanecer siempre en la app durante todo el proceso de la compraventa. Con el fin de ayudar a los usuarios a detectar posibles engaños, la plataforma explica los trucos más frecuentes que usan los estafadores. “Págame por Bizum o transferencia y te envío el paquete desde fuera”. Ya seas comprador o vendedor, evita utilizar métodos de pago externos como Bizum o transferencias, ya que no cuentan con la protección de seguridad de la plataforma. Por ello, nunca compartas tus datos bancarios con otro usuario. Para comprar y vender de manera segura en Wallapop, solo necesitas activar tu Monedero, que vincula tu perfil con tu cuenta bancaria. Los pagos y envíos fuera del sistema oficial no cuentan con la seguridad ni la garantía de la plataforma. “Hola, ¿me envías más fotos a este WhatsApp?”. Los estafadores a menudo intentan llevar la conversación fuera de la plataforma para esquivar los controles de seguridad, alegando, por ejemplo, que necesitan más fotos del producto. Si esto ocurre, recuerda que puedes añadir más imágenes editando tu anuncio. Para mantener tu seguridad, mantén todas las comunicaciones dentro del chat de la aplicación. “Necesito tu DNI / número de cuenta / tarjeta para preparar el envío.” Desconfía de quien te solicite información personal (incluido teléfono de contacto o correo electrónico) para comprar o vender fuera de la aplicación de Wallapop. En ningún caso, el comprador/vendedor necesita estos datos para preparar el envío. “Te mando el enlace para pagar/activar la garantía/protección extra”. Estos enlaces suelen ser falsos y redirigen a páginas creadas para robar tus datos personales o bancarios. Para evitar riesgos, utiliza Wallapop Envíos, el servicio logístico integrado que permite enviar tus productos de forma segura. Además, con Wallapop Protect, el pago se mantiene retenido 48 horas hasta que el comprador confirma haber recibido el artículo en buen estado, garantizando así mayor seguridad en tus transacciones. ¿Cómo trabaja Wallapop para garantizar la seguridad en la plataforma? Wallapop cuenta con un equipo especializado de Trust &amp; Safety, que representa el 8% de la plantilla, dedicado a detectar y prevenir comportamientos y usuarios fraudulentos antes de que afecten a su comunidad. Gracias a esto, el 90% de los anuncios y perfiles potencialmente fraudulentos ni siquiera llegan a estar visibles en la plataforma o son expulsados incluso antes de recibir ningún reporte por parte de otros usuarios.&nbsp; &nbsp; El equipo cuenta con herramientas tecnológicas avanzadas como Inteligencia Artificial, que les permiten identificar las cada vez más sofisticadas metodologías de los ciberdelincuentes, además de monitorizar y mediar en las interacciones y disputas que puedan surgir entre comprador y vendedor. Por último, Wallapop anima a su comunidad a reportar cualquier contenido que considere fraudulento o indebido. En caso de sospechar que un anuncio o usuario no cumple las normas de la plataforma, los usuarios pueden reportarlo a través de la app. Estas incidencias son analizadas de forma manual por nuestro equipo de moderación. En 2024, el 85% de los reportes fueron revisados y solucionados en menos de 4 horas. Todos estos esfuerzos forman parte de un ecosistema de protección, que combina tecnología avanzada, moderación humana y colaboración constante con cuerpos policiales, con el objetivo de garantizar al usuario una experiencia segura y fiable. “Durante las épocas de alto consumo es esencial mantenerse alerta frente a posibles ciberestafas. En Wallapop trabajamos cada día para que la compraventa de productos reutilizados se realice en un entorno de confianza y dentro de los límites ciberseguros de la plataforma. Desde el equipo de Trust &amp; Safety trabajamos día a día para detectar perfiles fraudulentos y frenar los intentos de ciberdelincuencia antes de que afecten a nuestra comunidad. Además, animamos a nuestros usuarios a denunciar cualquier práctica sospechosa para seguir construyendo juntos un espacio digital más seguro”, ha señalado Fernanda Castillo, Responsable de Marketplace en Wallapop. La entrada El 74% de los españoles asegura no sentirse preparado para identificar una ciberestafa se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}