{
  "id": "krebs-on-security-2025-11-16-3b1905ea",
  "source_id": "krebs-on-security",
  "guid": "https://krebsonsecurity.com/?p=72594",
  "title": "Microsoft Patch Tuesday, November 2025 Edition",
  "url": "https://krebsonsecurity.com/2025/11/microsoft-patch-tuesday-november-2025-edition/",
  "published_at": "2025-11-16T21:47:14+00:00",
  "fetched_at": "2025-11-17T11:20:48.130317+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Microsoft this week pushed security updates to fix more than 60 vulnerabilities in its Windows operating systems and supported software, including at least one zero-day bug that is already being exploited. Microsoft also fixed a glitch that prevented some Windows 10 users from taking advantage of an extra year of security updates, which is nice because the zero-day flaw and other critical weaknesses patched today affect all versions of Windows, including Windows 10. Affected products this month include the Windows OS, Office, SharePoint, SQL Server, Visual Studio, GitHub Copilot, and Azure Monitor Agent. The zero-day threat concerns a memory corruption bug deep in the Windows innards called CVE-2025-62215. Despite the flaw&#8217;s zero-day status, Microsoft has assigned it an &#8220;important&#8221; rating rather than critical, because exploiting it requires an attacker to already have access to the target&#8217;s device. &#8220;These types of vulnerabilities are often exploited as part of a more complex attack chain,&#8221; said Johannes Ullrich, dean of research for the SANS Technology Institute. &#8220;However, exploiting this specific vulnerability is likely to be relatively straightforward, given the existence of prior similar vulnerabilities.&#8221; Ben McCarthy, lead cybersecurity engineer at Immersive, called attention to CVE-2025-60274, a critical weakness in a core Windows graphic component (GDI+) that is used by a massive number of applications, including Microsoft Office, web servers processing images, and countless third-party applications. &#8220;The patch for this should be an organization&#8217;s highest priority,&#8221; McCarthy said. &#8220;While Microsoft assesses this as &#8216;Exploitation Less Likely,&#8217; a 9.8-rated flaw in a ubiquitous library like GDI+ is a critical risk.&#8221; Microsoft patched a critical bug in Office &#8212; CVE-2025-62199 &#8212; that can lead to remote code execution on a Windows system. Alex Vovk, CEO and co-founder of Action1, said this Office flaw is a high priority because it is low complexity, needs no privileges, and can be exploited just by viewing a booby-trapped message in the Preview Pane. Many of the more concerning bugs addressed by Microsoft this month affect Windows 10, an operating system that Microsoft officially ceased supporting with patches last month. As that deadline rolled around, however, Microsoft began offering Windows 10 users an extra year of free updates, so long as they register their PC to an active Microsoft account. Judging from the comments on last month&#8217;s Patch Tuesday post, that registration worked for a lot of Windows 10 users, but some readers reported the option for an extra year of updates was never offered. Nick Carroll, cyber incident response manager at Nightwing, notes that Microsoft has recently released an out-of-band update to address issues when trying to enroll in the Windows 10 Consumer Extended Security Update program. &#8220;If you plan to participate in the program, make sure you update and install KB5071959 to address the enrollment issues,&#8221; Carroll said. &#8220;After that is installed, users should be able to install other updates such as today’s KB5068781 which is the latest update to Windows 10.&#8221; Chris Goettl at Ivanti notes that in addition to Microsoft updates today, third-party updates from Adobe and Mozilla have already been released. Also, an update for Google Chrome is expected soon, which means Edge will also be in need of its own update. The SANS Internet Storm Center has a clickable breakdown of each individual fix from Microsoft, indexed by severity and CVSS score. Enterprise Windows admins involved in testing patches before rolling them out should keep an eye on askwoody.com, which often has the skinny on any updates gone awry. As always, please don’t neglect to back up your data (if not your entire system) at regular intervals, and feel free to sound off in the comments if you experience problems installing any of these fixes. [Author&#8217;s note: This post was intended to appear on the homepage on Tuesday, Nov. 11. I&#8217;m still not sure how it happened, but somehow this story failed to publish that day. My apologies for the oversight.]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}