{
  "id": "latest-news-zdnet-com-2025-11-02-f2a6d92a",
  "source_id": "latest-news-zdnet-com",
  "guid": "926d7e6d-ed6c-4999-9f11-e7c40c3b9a49",
  "title": "Are laser-powered tape measures legit? It took just minutes to make me a believer",
  "url": "https://www.zdnet.com/article/are-laser-powered-tape-measures-legit-it-took-just-minutes-to-make-me-a-believer/",
  "published_at": "2025-11-02T11:00:26+00:00",
  "fetched_at": "2025-11-02T11:14:12.681134Z",
  "status": "rejected",
  "content": {
    "raw": "The Mileseey S50 laser measuring tool provides accurate measurements at up to 400 feet. Here's how.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nAre laser-powered tape measures legit? It took just minutes to make me a believer\nMileseey S50 laser measuring tool\nZDNET's key takeaways\n- The Mileseey S50 is available now for $129.\n- It's a pocket-sized laser measuring tool with high-precision measurements up to 400 ft (120 m) with ±1/16 inch accuracy.\n- It's pricey and might be feature overkill for some.\nFollow ZDNET: Add us as a preferred source on Google.\nSome of my earliest memories are of using tools with my grandfather. He had the real ones while I had plastic facsimiles that could do a lot less damage. But to this day, I still can't pick up a hammer or tape measure without thinking about those memories.\nTools have been an integral part of my life from an early age. But they're changing, and getting packed with silicon and batteries and transistors.\nAlso: 10 DIY gadgets I never leave out of my toolkit (and why each one earns its spot)\nTake tape measures, once a palm-sized object that housed a metal ribbon that could snap back enthusiastically -- has been transformed into a palm-sized device with with a laser inside. Yup, the Mileseey S50 measuring tool has a frickin laser inside!\nThis is nothing like my grandpa's tape measure. The S50 is packed with features: first off, the laser measures out to a whopping 400 ft (120 m) and offers an incredible ±1/16 inch accuracy (and yes, it really is that accurate). It works in all sorts of conditions -- indoors, outdoors, in bright sun, rain, mist, slow, and can even see the laser when it's shone on a low-reflective surface (if the surface has too matte of a finish for the laser to work, you can use a reflective sticker).\nIt's quick to use, and the results are consistent and accurate.\nBut this is only a fraction of what the S50 can do. This small pocket-sized bit of kit can do all sorts -- you can use it to measure the distance between two points from a single location, measure the area of a wall, the volume of a room or cylinder, it can work out various Pythagorean calculations, and even use the side laser to make out intervals for things like fence posts.\nThe amount of stuff that this little gadget can do is quite staggering. Some of the features I've been using a lot, others I'm not sure why I'd need them but one day will probably have one of those \"a-ha\" moments and figure out that particular feature will be useful.\nAlso: This is my favorite tool kit of all time - here's why it's still in use 10 years later\nThe information is displayed on a 2.4 inch IPS backlit display that is big and bold and easy to read under a variety of conditions, whether that be at night or in bright sunlight. Powering the unit are two rechargeable AA 1800mAh Ni-MH batteries, and these can be recharged in the unit using USB-C. The buttons on the unit are large and clear, and they are easy to operate even when wearing work gloves.\nThere's also a hole for a lanyard and also a 1/4-20 tripod screw. The unit has rubberized bumpers, and resists knocks, bumps, and drops. Not to mention the handy zip-up case for storing the tool safely.\nZDNET's buying advice\nI admit it: I was surprisingly resistant to trying out the Mileseey S50. It seemed like overcomplicating what seemed to me like a simple bit of kit. But this takes a tape measure and super charges it!\nI mean, it's a 400-foot tape measure that can do trigonometry that I can fit in my pocket. I can measure things that would need ladders of cherry pickers to get to, and I can do it to an accuracy that I couldn't achieve with a regular tape measure.\nAll this in a tool that costs $140 (in fact, right now there's a $40 off coupon on Amazon). That might seem a bit pricey, but if you have a need for measurements in hard-to-reach spaces, it's easily worth it.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-02T11:16:25.514518Z"
}