{
  "id": "ciberseguridad-latam-ciberseguridadlatam-com-2025-11-20-0d6e4714",
  "source_id": "ciberseguridad-latam-ciberseguridadlatam-com",
  "guid": "https://ciberseguridadlatam.com/?p=19748",
  "title": "Identidades digitales múltiples: la metamorfosis involuntaria que define nuestro futuro",
  "url": "https://ciberseguridadlatam.com/identidades-digitales-multiples-la-metamorfosis-involuntaria-que-define-nuestro-futuro/",
  "published_at": "2025-11-20T18:00:16+00:00",
  "fetched_at": "2025-11-21T11:18:29.696303+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Por Daniel Monastersky &#8211; www.danielmonastersky.com Hace aproximadamente diez años, cuando escribí sobre las identidades digitales múltiples, describía un futuro que parecía lejano y especulativo. Hoy, sentado frente a la pantalla en 2025, esa visión no es una advertencia futura sino una realidad que enfrentamos con urgencia. Lo que entonces parecía ciencia ficción se ha convertido en el drama cotidiano de millones de jóvenes argentinos y latinoamericanos. Hace poco, una madre se contactó conmigo desesperada. Su hijo de dieciochos años, durante el último año de la secundaria, había tenido un conflicto escolar que derivó en desafortunados comentarios en redes sociales. Ahora se enfrentaba a la búsqueda de su primer empleo. Varias empresas rechazaban su candidatura. No obstante, logró acceder a una página de Google que mostraba aquellos mensajes de hace cuatro años. Los algoritmos habían convertido a un adolescente en su versión digital más oscura, sin que nadie se encargara de limpiar esos restos del pasado. Este no es un caso aislado. Es, de hecho, la experiencia normalizada de una generación entera. Cuando propuse hace una década que cada persona tendría múltiples identidades digitales a lo largo de su vida, no imaginaba que el proceso sería tan caótico, tan desordenado, tan fuera del control de los propios individuos. Hoy entiendo que el fenómeno es más complejo y potencialmente más dañino de lo que anticipé. Primera identidad: el sharenting y la infancia colonizada Todo comienza antes de que el niño tenga capacidad de decisión alguna. Los padres, seducidos por la posibilidad de compartir hitos de la infancia, publicaban fotografías, nombres, ubicaciones, rutinas. Lo que llamamos sharenting no era simplemente una práctica inocua de conexión familiar. Era la construcción de una identidad digital predeterminada, controlada completamente por otros, sin consentimiento y frecuentemente sin consideración sobre sus implicaciones futuras. Esa primera identidad digital es, por definición, ajena. Construida por padres bien intencionados, capturada por algoritmos, almacenada en servidores corporativos. El niño nace en el mundo físico y simultáneamente en el digital, pero sin ser el arquitecto de su propia narrativa. Segunda identidad: la adolescencia en pantalla Posteriormente, cuando los adolescentes acceden a sus propias redes sociales, creen que están tomando el control. La realidad es que heredan una identidad preexistente mientras simultáneamente crean una nueva, con toda la impulsividad y la falta de madurez que caracteriza esa edad. El ciberacoso no es un fenómeno secundario en esta etapa. Es el motor que muchas veces destruye la narrativa digital en construcción. Un mensaje enviado en un momento de enfado, una foto compartida sin pensar, un comentario hecho en grupo. Estos fragmentos se multiplican, se etiquetan, se almacenan en servidores y copian millones de veces. La impulsividad adolescente encuentra en internet una permanencia que en el mundo físico nunca tuvo. En la escuela, una ofensa se olvida; en línea, es eternamente recuperable. Tercera identidad: la puerta laboral cerrada o abierta Y entonces llega el momento crítico. El joven entra en el mercado laboral y descubre que no controla su presentación. Las empresas lo descubren a través de Google, Facebook, Instagram, ahora también ChatGPT, Claude, Gemini, Perplexity, Grok, entre otros. Ven no quien es, sino quien fue en momentos de debilidad, en compañía de amigos, en circunstancias que nunca debieron definir su futuro profesional. Aquella frase que escribí hace una década cobra una fuerza aún más preocupante: «Vos sos quien Google dice que sos.» Hoy, diez años después, comprendo que no es una declaración retórica. Es la expresión de una captura de identidad. Las Big Techs, en asociación con empleadores y algoritmos que nadie comprende completamente, han confiscado el derecho fundamental a reinventarse. Lo que no preveía completamente hace diez años: cómo la multiplicidad de identidades digitales se entrelaza con amenazas que escapan a toda comprensión. Hoy, empresas como Worldcoin no simplemente recopilan datos conductuales. Capturan iris, rostros, datos biométricos. Estos se almacenan en servidores privados en jurisdicciones que nuestras leyes no alcanzan. Esa cuarta identidad digital, la biométrica, es aún más profunda, más inmutable que los datos demográficos. Es literalmente quien eres a nivel biológico, capturado, procesado, entrenado para entrenar algoritmos de inteligencia artificial. Meta, Google, TikTok no simplemente registran nuestras acciones. Entrenan sistemas de inteligencia artificial con nuestras imágenes, textos, patrones de comportamiento. Creamos una quinta identidad digital: la del cuerpo cuyas características faciales entrenan sistemas de reconocimiento facial; la de la voz cuyas palabras entrenan modelos de lenguaje. No hemos entendido completamente lo que esto significa. No simplemente somos vigilados. Somos duplicados digitalmente, reproducidos en código, nuestras características y comportamientos se convirtieron en commodity para ser vendido, reutilizado, explotado sin límite temporal o geográfico. Cuando publiqué ese artículo hace diez años, ya era evidente que la Ley 25.326 era insuficiente. Hoy, la brecha entre realidad tecnológica y protección legal es un abismo. Argentina ha permitido que corporaciones tecnológicas multinacionales operen bajo reglas diseñadas a fines de los noventa. Hemos permitido que el sharenting sea legal. Hemos tolerado que Worldcoin operara años antes de cualquier regulación. Hemos visto cómo Meta entrena sistemas de IA con datos de ciudadanos sin consentimiento expreso. Otros países actuaron. La Unión Europea implementó el GDPR, con sanciones que corporaciones respetan. Colombia avanzó en regulación de biometría. Brasil requiere consentimiento para IA. Argentina, mientras tanto, sigue esperando. Hace una década advertía sobre la necesidad urgente de educación digital desde la infancia. Hoy esa necesidad es aún más crítica, pero el sistema educativo argentino está menos preparado que nunca. Los jóvenes no comprenden que cada compartición es una rendición de control. No entienden que los algoritmos no son neutrales. No saben que sus identidades digitales están siendo capturadas, replicadas, monetizadas. Las campañas de concientización deben ir más allá del «no compartas información personal». Deben explicar que la identidad digital no es simplemente información que compartimos voluntariamente. Es un ecosistema controlado por actores corporativos con incentivos en contra de nuestra autonomía. No creo en soluciones tecnocráticas simples. Pero creo en tres pilares para avanzar: Regulación con poder real: Necesitamos leyes que permitan a los ciudadanos recuperar control sobre sus identidades digitales. Derecho al olvido con verdaderas sanciones. Regulación de sharenting. Control sobre entrenamiento de IA. Derechos sobre biometría. Y reguladores con capacidad de sancionar a corporaciones multinacionales con multas que realmente duelan. Educación crítica y temprana: No basta enseñar a los niños a usar tecnología. Deben aprender a desconfiar de ella. A entender que los algoritmos están diseñados para maximizar engagement, no para servir su bienestar. A comprender que su identidad digital es valiosa y que tienen derecho a defenderla. Reconstrucción de identidades: Para quienes ya fueron atrapados por identidades digitales negativas, necesitamos mecanismos efectivos de remediación. El derecho al olvido no puede ser teórico. Debe ser práctico, rápido, vinculante. Cuando escribí eso hace diez años, la amenaza era prospectiva. Hoy es presente. Los adolescentes de hoy vivirán durante décadas con identidades digitales que no eligieron, que no controlan, que les cerrarán puertas que ni siquiera sabían que existían. La profecía no fue una advertencia que ignoramos. Fue una fotografía de un futuro que elegimos permitir. Aún podemos cambiar el curso. Necesitamos un reconocimiento radical de que las corporaciones tecnológicas capturaron aspectos fundamentales de nuestra identidad, y que recuperarlos requiere una voluntad política que Argentina aún no ha demostrado tener. La pregunta que debe urgir a legisladores, educadores y ciudadanos es simple: ¿Cuánto más esperaremos antes de actuar?",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}