{
  "id": "cloud-native-security-palo-alto-networks-blog-2025-11-20-75215e4a",
  "source_id": "cloud-native-security-palo-alto-networks-blog",
  "guid": "https://www.paloaltonetworks.com/blog/?post_type=cloud_sec_post&p=348488",
  "title": "Explore the OWASP Top 10 for LLMs: A New Interactive Guide",
  "url": "https://www.paloaltonetworks.com/blog/cloud-security/owasp-top-10-llms-ai-security-guide/",
  "published_at": "2025-11-20T13:00:21+00:00",
  "fetched_at": "2025-11-21T11:16:56.536677+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Figure 1: The interactive layout gives you a big-picture view while guiding you through the various mechanisms of potential attacks. In just a few years, AI has gone from a novelty to a core part of how we work, innovate and build software. But while large language models (LLMs) and generative AI (GenAI) have accelerated development across industries, they’ve also introduced a volatile, largely unprotected attack surface. That’s why the OWASP Top 10 for LLMs matters now more than ever. Just as traditional OWASP Top 10 lists have helped developers and security leaders mitigate classic web vulnerabilities, this new list is a foundational guide for understanding the unique threats in AI pipelines, applications and ecosystems. Why the Urgency? Because Attackers Are Already Targeting AI Pipelines It’s time to stop assuming that these risks are theoretical. They’re already playing out across cloud environments in real incidents – and at a real cost. Prompt Injection Across Multi-Model Environments Prompt injection isn’t a theoretical risk. Unit 42’s Prompt Attack report (2025) found that over half of all injection attempts successfully bypassed safety filters, even in production-grade systems. These attacks don’t exploit complex zero days. They exploit trustworthy assets – models, RAG pipelines or chained tools – that accept and act on malicious input without guardrails. Agentic AI and Over-Permissioned Access Unit 42’s AI threat research also highlights how agentic systems can be turned against themselves. In one test scenario, a single malicious prompt triggered an AI agent to extract sensitive data and send it to an attacker-controlled endpoint. When these agents operate with admin-level IAM permissions or no approval workflow (as seen in real-world shadow AI incidents), they become ideal entry points for data theft and insider-like abuse. Misconfigurations and Ransomware The latest Unit 42 Ransomware Report shows ransomware groups targeting cloud-hosted AI assets and development pipelines. Unsecured endpoints, excessive permissions or exposed training datasets can open the door to extortion or data destruction. This isn’t a hypothetical risk. It’s leading to exposed secrets, leaked PII, and unintended external access from unsecured AI behavior. The Cost of Ignoring AI-Specific Security When AI pipelines are left unsecured, the financial and operational impact can be devastating. According to IBM’s 2025 Cost of a Data Breach report, the average breach costs $4.7 million, rising to over $5.4 million for cloud-based AI workloads. These aren’t abstract numbers. In recent real-world scenarios, attackers have exploited misconfigured AI endpoints and unsecured model APIs to exfiltrate proprietary data, hijack compute resources, and insert poisoned training data. For example, an exposed agentic AI workflow can be manipulated through prompt injection to leak sensitive data, trigger unintended actions or spread misinformation across downstream systems. Meanwhile, stolen PII used for fine-tuning can violate compliance frameworks like GDPR or HIPAA, adding regulatory fines to already mounting recovery costs. And since AI assets are dynamic – models get retrained, data gets reclassified, endpoints proliferate – security blind spots grow fast. Without visibility into where sensitive data lives and how it flows through AI systems, even well-intentioned teams can leave their crown-jewel assets exposed. What the OWASP Top 10 for LLMs Covers – and Why It’s Your Blueprint The OWASP Top 10 for LLMs framework brings structure to the chaos of emerging AI risks. But we’ve taken it a step further. Our new interactive experience helps security and platform teams visualize where each risk surfaces in a typical AI application stack, so they can take action with context. Each risk is translated into real-world scenarios across model inputs, outputs, endpoints, agents and pipelines – giving you an at-a-glance understanding of where your AI stack is exposed. You’ll also get recommended remediations that are aligned with leading security capabilities such as: Sensitive data detection in AI pipelines Model misconfiguration and prompt-based attack prevention AI tool, plugin and access to cloud resource hardening The result: a practical, visual reference for securing AI across its full lifecycle – from training data to deployment – that’s aligned with OWASP’s latest guidance. Cortex Cloud’s AI-SPM Brings Visibility and Control Here’s how Cortex® CloudTM AI-SPM directly addresses today’s threats: Discover your AI ecosystem: Identify shadow AI, unmanaged models, OSS components, agents and connected data assets across your cloud workloads. Map access and permissions: See which agents, endpoints and users have access to sensitive data and systems, as well as trace toxic permission paths. Classify sensitive training data: Map PII, IP and financial data fueling your models, and assess exposure risk across pipelines. Detect policy misconfigurations: Surface risks in real time and receive automated remediation recommendations. Ensure governance and audit readiness: Build a defensible AI security posture before regulators or auditors come knocking. That’s why this guide is essential. Align with the standard and stay ahead of threats. Explore the Interactive OWASP Top 10 for LLMs. &nbsp; The post Explore the OWASP Top 10 for LLMs: A New Interactive Guide appeared first on Palo Alto Networks Blog.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}