{
  "id": "cyberscoop-2025-11-20-26a0019e",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86889",
  "title": "Top Senate Intel Dem warns of ‘catastrophic’ cyber consequences of Trump admin national security firings, politicization",
  "url": "https://cyberscoop.com/top-senate-intel-dem-warns-of-catastrophic-cyber-consequences-of-trump-admin-national-security-firings-politicization/",
  "published_at": "2025-11-20T18:44:10+00:00",
  "fetched_at": "2025-11-21T11:18:42.545759+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Politicization of intelligence in the Trump administration, as well as the “hollowing out” of government expertise, is leaving the United States dangerously vulnerable to cyberattacks and other threats, the top Democrat on the Senate Intelligence Committee said in a floor speech Thursday. Mark Warner of Virginia chastised the president over what he called the politically-motivated personnel decisions that he said jeopardized national security, including layoffs of one-third of the workforce at the Cybersecurity and Infrastructure Agency, the firing of a top FBI cyber official and the vacant leadership at the National Security Agency and U.S. Cyber Command. “One-third of CISA, the agency established for the absolutely explicit purpose of protecting our critical infrastructure — water, power, our elections — to prevent those entities from being attacked by cyber tools, a third of that agency, fired,” Warner said.&nbsp; The administration has eliminated election security workers at CISA, he noted — rolling back improvements innovated when Trump was first president. “The irony is stark: despite persistent efforts by China, Russia, Iran and other adversaries, the 2020 presidential election was one of the most secure in history, thanks in large part due to steps taken during the Trump administration’s first term to safeguard our critical infrastructure,” he said. “Yet now, much of that hard-won protection has been dismantled, leaving Americans more vulnerable than ever.” Warner criticized the firing of Michael Nordwall, the former head of the FBI’s criminal cyber response branch that oversees the bureau’s fight against ransomware, online fraud and more. He also criticized the firing of former NSA/Cyber Command boss Tim Haugh, and his deputy, Wendy Noble, “at the behest of the conspiracy theorist Laura Loomer.” Warner pointed out that those positions remain vacant, after the firings occurred in April. Many national security firings have come in retaliation for work under the prior administration to which Trump objected, or even because the fired personnel are friendly with administration critics, he said. The cutbacks and firings are happening at a time when Trump administration national security leaders are warning about cyberattacks and malign foreign influence from China, Russia and Iran, in addition to non-cyber threats, Warner said. “Firing agents who investigate terrorists, foreign spies, cyber hackers and child predators does not make America safer, especially when the president’s own intelligence officials warn, publicly and repeatedly, of the many threats facing our nation,” he said. If the administration fails to keep classified information safe, if it fails to protect critical infrastructure, “We will beat the costs later,” Warner said. “A cost that could be catastrophic.” A National Security Council spokesperson did not immediately respond to a request for comment. In the past, Trump administration officials have characterized firings and government layoffs as necessary for getting those agencies focused on their primary missions, and has refuted allegations of politicizing intelligence, saying it was the Biden administration that did so instead. The post Top Senate Intel Dem warns of ‘catastrophic’ cyber consequences of Trump admin national security firings, politicization appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}