{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-20-5635f073",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42351",
  "title": "Aumenta un 67% el malware Android y el 40% de los ataques IoT va a infraestructuras críticas",
  "url": "https://cybersecuritynews.es/aumenta-un-67-el-malware-android-y-el-40-de-los-ataques-iot-va-a-infraestructuras-criticas/",
  "published_at": "2025-11-20T22:00:00+00:00",
  "fetched_at": "2025-11-21T11:18:18.991471+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Zscaler, Inc., empresa de seguridad en la nube, ha publicado su último informe 2025 Mobile, IoT, and OT Threat, realizado por ThreatLabz, su equipo de investigación. Basado en el conjunto de datos de telemetría móvil de Zscaler, el equipo de ThreatLabz ha identificado nuevas amenazas móviles emergentes y actividades maliciosas, ofreciendo información clave para ayudar a las empresas a adelantarse a los atacantes en un mundo dominado por lo móvil. Al igual que el año pasado, este año los actores de amenazas han seguido desarrollando y lanzando aplicaciones maliciosas dirigidas a mercados de confianza y entornos de trabajo híbridos. El resultado, según revela el informe, es un aumento interanual del 67% en las transacciones de malware para Android, reflejando los riesgos persistentes del spyware y el malware bancario. Los investigadores de ThreatLabz identificaron 239 de estas aplicaciones alojadas en Google Play Store, que fueron descargadas 42 millones de veces en total. Uno de los canales principales de distribución de este malware fue la categoría “Herramientas”, donde las aplicaciones maliciosas se camuflaban como funcionalidades de productividad. Esta táctica se aprovecha de la confianza de los usuarios en aplicaciones orientadas a mejorar los flujos de trabajo, especialmente en entornos de trabajo híbrido y remoto donde los dispositivos móviles son esenciales para las tareas profesionales. Industria manufacturera: objetivo principal para ataques móviles y de IoT El análisis de ThreatLabz sobre los volúmenes de ataques a Android revela que los sectores de manufactura y energía siguen siendo objetivos clave para los ciberdelincuentes debido al potencial de obtener beneficios significativos. Específicamente, el sector energético ha experimentado un aumento sustancial del 387 % en ataques respecto al año anterior, destacando una amenaza creciente para la infraestructura crítica y una mayor explotación de vulnerabilidades en estas industrias esenciales. En el ámbito del IoT, los sectores de manufactura y transporte siguen siendo los verticales más frecuentemente atacados. Este año, cada uno representa el 20,2% de todos los ataques observados de malware en IoT, sumando más del 40% de los incidentes totales. Esto marca un cambio con respecto a 2024, cuando manufactura representaba el 36% del total de incidentes, seguida de transporte con el 14%. Esto sugiere que, aunque manufactura sigue siendo un objetivo crítico, los actores de amenazas están diversificando sus esfuerzos hacia otras industrias con alta dependencia del IoT. Epicentro de amenazas IoT En Europa, el informe detecta una intensificación del riesgo cibernético en varios países clave. Alemania se sitúa como el tercer país más atacado en el entorno IoT, con un 6,6% del tráfico de malware dirigido a su infraestructura, mientras que Francia y los Países Bajos también figuran entre los principales destinos de tráfico IoT global. Italia, por su parte, ha experimentado un crecimiento explosivo de más del 800% en transacciones móviles bloqueadas, lo que la posiciona como uno de los focos emergentes más alarmantes en ciberamenazas móviles. El troyano bancario Anatsa ha ampliado su alcance en Europa, apuntando a entidades financieras en Alemania, y el malware Coper —presente en Europa, Sudamérica y Australia— refleja un patrón de diseminación transcontinental con impacto potencial en España, dada su integración en el ecosistema financiero europeo y el uso compartido de plataformas móviles. Aunque España no aparece directamente entre los países más afectados, la concentración de amenazas en países vecinos y la actividad creciente de malware móvil e IoT en Europa subrayan la necesidad de vigilancia y preparación en el ámbito nacional. A nivel mundial, Estados Unidos es tanto un centro de actividad de IoT, como un objetivo principal de ataques de malware. Los cinco países que reciben más tráfico de malware de IoT son: Estados Unidos (54%) Hong Kong (15%) Alemania (6%) India (5%) China (4%) Asimismo, las amenazas móviles han aumentado, con la mayoría de los ataques concentrados en tres regiones clave: India, con el 26% de todos los ataques móviles, Estados Unidos con el 15%, y Canadá con el 14%. India, en particular, experimentó un aumento significativo del 38% en ataques móviles en comparación con el año anterior. Los cinco países que reciben más tráfico de malware móvil son: India (26%) Estados Unidos (15%) Canadá (14%) México (5%) Sudáfrica (4%) Malware más prevalente en IoT Aproximadamente el 40% de las transacciones bloqueadas están vinculadas exclusivamente a la familia Mirai, y Mozi ha superado a Gafgyt como la segunda familia de malware más frecuente. Juntas, Mirai, Mozi y Gafgyt representan aproximadamente el 75% de todas las cargas maliciosas en entornos de IoT. “Los atacantes están pivotando hacia áreas de mayor impacto. Estamos viendo un aumento interanual del 67% en malware dirigido a dispositivos móviles y del 387% en ataques de IoT/OT al sector energético, que a menudo alberga infraestructura crítica, lo cual es un cambio drástico. Un enfoque Zero Trust Everywhere, combinado con detección de amenazas potenciada por IA, es imperativo para reducir la superficie de ataque, limitar el movimiento lateral y proporcionar a las emprensas la defensa que necesitan contra ataques en constante evolución”, asegura Deepen Desai, vicepresidente ejecutivo y director de seguridad en Zscaler. Aspectos destacados adicionales y nuevos hallazgos de 2025: Un nuevo backdoor llamado Android Void ha infectado 1,6 millones de TV box con Android, principalmente en India y Brasil. Se identificó un nuevo Troyano de Acceso Remoto (RAT), Xnotice, que apunta a personas en búsqueda de empleo en la industria del petróleo y gas, particularmente en MENA. El adware superó a la familia de malware Joker como la principal amenaza móvil, con un 69 % de los casos, mientras que Joker cayó al 23 %, desde el 38 % del año pasado. Los actores de amenazas están abandonando el fraude con tarjetas a favor de los pagos móviles. Defensa contra amenazas crecientes de IoT, OT y móviles Zscaler Zero Trust Branch ofrece seguridad integral y eficiencia operativa para oficinas sucursales, sitios remotos y redes distribuidas, diseñado para entornos que dependen en gran medida de tecnologías móviles, IoT, IoT celular y OT. Utilizando una arquitectura nativa de la nube y basada en IA de Zero Trust, Zscaler busca garantizar que todos los usuarios, dispositivos y aplicaciones estén protegidos con verificación continua en tiempo real y una sólida aplicación de políticas, independientemente de su ubicación respecto al perímetro tradicional de la red. Zscaler Cellular ofrece conectividad segura, escalable y eficiente como servicio para dispositivos móviles e IoT que dependen de conexiones celulares. Esta solución, impulsada por la plataforma Zscaler Zero Trust Exchange™, aborda los crecientes desafíos de seguridad que representan los miles de millones de dispositivos IoT y puntos finales móviles, que los métodos de seguridad tradicionales a menudo no logran proteger eficazmente. Lo logra aplicando políticas granulares, proporcionando visibilidad centralizada y eliminando superficies de ataque para todo el tráfico celular. La entrada Aumenta un 67% el malware Android y el 40% de los ataques IoT va a infraestructuras críticas se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}