{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-20-5b9fccff",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42349",
  "title": "Los ataques de malware han experimentado un crecimiento del 131% en 2025",
  "url": "https://cybersecuritynews.es/los-ataques-de-malware-han-experimentado-un-crecimiento-del-131-en-2025/",
  "published_at": "2025-11-20T22:00:00+00:00",
  "fetched_at": "2025-11-21T11:18:18.991046+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "El&nbsp;Cybersecurity Report anual de Hornetsecurity, ha revelado que los delincuentes han adoptado técnicas de automatización, inteligencia artificial e ingeniería social a una velocidad sin precedentes, mientras que empresas e instituciones han tratado de adaptar sus programas de gobernanza, resiliencia y concienciación para defenderse y estar a la altura. Así lo confirma el análisis de más de 6.000 millones de correos electrónicos al mes (72.000 millones al año). La compañía ha descubierto que el correo electrónico ha sido un vector de entrada constante para los ciberataques en 2025. Los correos electrónicos cargados con&nbsp;malware&nbsp;aumentaron un 131% interanual, así como las estafas por correo electrónico (+34,7%) o el phishing (+21%). Los ciberdelincuentes han podido crear contenidos fraudulentos más convincentes gracias a la IA generativa, y más de tres cuartas partes de los CISOs (77%) han identificado al phishing generado por IA como una amenaza grave y emergente. No obstante, los sistemas de defensa están trabajando para ponerse al día y el 68% de las organizaciones han invertido ya este año en capacidades de detección y protección basadas en IA contra este tipo de amenazas. Daniel Hofmann, CEO de Hornetsecurity, afirma que “la IA es tanto una herramienta como un objetivo, y los vectores de ataque están creciendo más rápido de lo que muchos creen. El resultado es una carrera armamentística en la que ambas partes utilizan el machine learning para, por un lado, engañar; y, por otro, defenderse y prevenir”. “Los delincuentes recurren cada vez más a la IA generativa y la automatización para identificar vulnerabilidades, generar señuelos de phishing más convincentes y orquestar intrusiones en varias etapas con una supervisión humana mínima”, concluye Daniel Hofmann. Amenazas emergentes para la ciberseguridad derivadas de la IA: fraude de identidad sintética y&nbsp;deepfakes El potencial del uso indebido de la IA se ha convertido en una tendencia clara del actual panorama de amenazas. Así, el 61% de los CISOs cree que la IA ha aumentado directamente el riesgo de sufrir ataques de ransomware. Además, sus principales preocupaciones son el fraude de identidad sintética, que utiliza la IA para generar documentos y credenciales; la clonación de voz y los vídeos&nbsp;deepfake, para suplantar a usuarios; el ataque de&nbsp;poisoning, donde datos maliciosos corrompen los sistemas internos de IA; y el uso indebido de herramientas públicas de IA por parte de los empleados. Todas estas tecnologías emergentes difuminan la línea entre la actividad legítima y la maliciosa, lo que hace que los controles de seguridad tradicionales sean menos eficaces, especialmente cuando los ciberdelincuentes buscan comprometer la confianza en lugar de forzar el acceso. Una brecha en la concienciación de los líderes empresariales en materia de IA Incluso cuando las empresas refuerzan su capacidad de recuperación, muchas corren el riesgo de quedarse ancladas en objetivos obsoletos. La próxima ola de ataques se centrará en algo menos tangible pero más poderoso: la confianza. Los CISOs han percibido este año una gran disparidad en la comprensión de los riesgos relacionados con la IA por parte de los directivos de las empresas. Algunos informaron de que sus altos ejecutivos tenían una «profunda conciencia» de estas amenazas, pero otros admitieron que no tenían «ninguna comprensión real» del papel de la IA en este tipo de ataques. La respuesta media general indica que existe cierta conciencia, pero los avances eran inconsistentes y variaban mucho de una empresa a otra. De cara al futuro, la resiliencia impulsada por un cambio cultural y no solo por la prevención, definirá el éxito de la ciberseguridad en 2026. Hofmann añade que “los resultados de nuestro informe demuestran que las organizaciones están aprendiendo a recuperarse sin negociar. Pero los esfuerzos internos de concienciación sobre la seguridad deben evolucionar al mismo ritmo de la adopción de la IA”. “Pocas juntas directivas realizan simulaciones de ciber crisis y los manuales de estrategias interfuncionales siguen siendo la excepción y no la norma. A medida que la desinformación impulsada por la IA y la extorsión realizada a través de deepfakes se vuelven más comunes, una cultura de seguridad basada en la preparación y respaldada por la concienciación sobre la IA, tendrá que ser un objetivo para 2026”. La entrada Los ataques de malware han experimentado un crecimiento del 131% en 2025 se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}