{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-13-16a63bcd",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42323",
  "title": "España registra 1.932 ciberataques semanales de media en octubre, un 6% más que en 2024",
  "url": "https://cybersecuritynews.es/espana-registra-1-932-ciberataques-semanales-de-media-en-octubre-un-6-mas-que-en-2024/",
  "published_at": "2025-11-13T22:00:00+00:00",
  "fetched_at": "2025-11-14T11:18:51.529872+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Check Point Research, la división de Inteligencia de Amenazas Check Point® Software Technologies Ltd., empresa global en soluciones de ciberseguridad, ha publicado su Índice Global de Amenazas de octubre 2025 que muestra que las empresas de todo el mundo se enfrentaron a una media de 1.938 ciberataques semanales por semana. Esta cifra representa un aumento del 2% respecto a septiembre y un incremento interanual del 5%, lo que refleja una escalada continua de las ciberamenazas globales impulsadas por la expansión del ransomware y los riesgos relacionados con la IA generativa (GenAI). Por sectores, Educación volvió a ser el más atacado a nivel mundial, con una media de 4.470 ataques semanales por organización, lo que supone un aumento interanual del 5%. Esta persistencia refleja tanto la rápida digitalización del sector, que amplía su superficie de ataque, como su tradicional falta de inversión en ciberseguridad, lo que lo convierte en un objetivo habitual para los ciberdelincuentes. La industria de las Telecomunicaciones registró 2.583 ataques semanales por organización (+2% interanual), mientras que las Instituciones Gubernamentales sufrieron 2.550 ataques semanales (-2% interanual), manteniéndose entre los sectores más vigilados por ciberdelincuentes y agentes estatales. Asimismo, destaca el notable incremento del 40% interanual en el sector de la Hostelería, que asciende del octavo al quinto puesto entre las industrias más atacadas, impulsado por la cercanía de la temporada vacacional. Imagen 1. Media mundial de ciberataques semanales por sector (octubre 2025 comparado con octubre 2024) “Los datos de octubre muestran que, además del incremento general del número de ataques, la verdadera preocupación reside en sus consecuencias, reflejadas en el fuerte aumento de los incidentes exitosos de ransomware.”, afirma Eusebio Nieva, director técnico de Check Point Software para España y Portugal. “A ello se suman los riesgos de exposición de datos a través de la IA generativa y otros vectores, que pueden proporcionar a los atacantes nuevas herramientas para futuros ciberataques. Esta evolución plantea desafíos inéditos para losprofesionales de la ciberseguridad. La única estrategia verdaderamente eficaz es una basada en la prevención proactiva, impulsada por IA en tiempo real y por inteligencia de amenazas avanzada, capaz de bloquear los ataques antes de que causen daños”. Los sectores más atacados en España en octubre En el caso de España, las compañías han sufrido 1.932 ataques semanales de media en octubre, un 6% más que en el mismo mes de 2024. Los sectores más atacados han resultado ser el sector Gubernamental, Bienes y ervicios de Consumo y Telecomunicaciones, entre otros: Gobierno Bienes y Servicios de Consumo Telecomunicaciones Industria Manufacturera Finanzas Servicios Empresariales Energía y servicios Públicos. Por regiones, Latinoamérica fue la zona más atacada, con una media de 2.966 ataques semanales por organización, lo que supone un incremento interanual del 16%, seguida de África, con 2.782 ataques (-15%) y la región APAC, con 2.703 (-8%). Europa registró un aumento moderado del 4%, mientras que Norteamérica volvió a destacar con el mayor crecimiento interanual, del 18%, impulsado en parte por la intensificación de los ciberataques de ransomware. Por regiones, Latinoamérica fue la zona más atacada, con una media de 2.966 ataques semanales por organización, lo que supone un incremento interanual del 16%, seguida de África, con 2.782 ataques (-15%) y la región APAC, con 2.703 (-8%). Europa registró un aumento moderado del 4%, mientras que Norteamérica volvió a destacar con el mayor crecimiento interanual, del 18%, impulsado en parte por la intensificación de los ciberataques de ransomware. Riesgos de exposición de datos por IA generativa El uso de herramientas de Inteligencia Artificial Generativa (GenAI) se ha generalizado en los entornos corporativos, lo que está incrementando los riesgos de exposición de información sensible. Durante octubre, una de cada 44 interacciones o “prompts” realizadas desde redes empresariales presentó un alto riesgo de fuga de datos, una tendencia que ya afecta al 87% de las organizaciones que utilizan habitualmente soluciones de GenAI. Además, el 19% de los prompts analizados contenían información potencialmente confidencial, privada o propietaria. Estos riesgos coinciden con un aumento del 8% en el uso diario promedio de herramientas de IA generativa en entornos corporativos. Destaca especialmente el incremento relativo en la exposición de código fuente y credenciales, por encima de otros tipos de datos como la información personal (PII) o financiera.Aunque parte de este uso se realiza a través de herramientas gestionadas, las organizaciones emplean una media de 11 herramientas de GenAI diferentes al mes, la mayoría sin supervisión ni control de seguridad adecuados. Ataques de ransomware La actividad de ransomware experimentó un fuerte repunte en octubre, con 801 ataques denunciados públicamente en todo el mundo, lo que supone un aumento interanual del 48% respecto al mismo mes de 2024. Norteamérica concentró la mayoría de los incidentes (62%), seguida de Europa (19%). Estados Unidos se mantuvo como el principal objetivo, con el 57% de las víctimas registradas y un incremento mensual del 56,8%, mientras que otros países especialmente afectados fueron Canadá (5%), Francia (4%) y Reino Unido (3%), reflejando la creciente expansión global de este tipo de ciberataques. Imagen 2. Víctimas de ransomware por regiones en octubre de 2025 Por sectores, Servicios empresariales fue el más afectado por el ransomware, concentrando el 12% del total de víctimas, seguido de Bienes y servicios de consumo (10,5%) e Industria manufacturera (10,4%). Estos datos reflejan cómo el ransomware continúa diversificando sus objetivos, afectando tanto a sectores críticos como a industrias orientadas al consumidor. Principales grupos de ransomware en octubre Los datos de octubre de los “puntos calientes” del ransomware ponen de relieve los cambios en la dinámica entre los principales grupos: Qilin (Agenda) – responsable de aproximadamente el 22,7% de los ataques publicados, se consolida como el grupo más activo del mes. Este colectivo ha evolucionado hasta convertirse en una sofisticada operación de Ransomware como Servicio (RaaS), con una amplia red de afiliados y un cifrador basado en Rust. Akira – ocupa la segunda posición, con el 8,7% de los ataques registrados. Mantiene su foco en los sectores empresarial e industrial, utilizando cargas útiles tanto para Windows como para Linux. Sinobi – actor emergente aparecido a mediados de 2025, representó el 7,8% de los incidentes. Destaca por su especialización en ataques dirigidos al sector sanitario de Estados Unidos. El panorama de amenazas de octubre de 2025 refleja un entorno en el que los ciberdelincuentes actúan de forma cada vez más oportunista, aprovechando la inestabilidad geopolítica, la automatización impulsada por IA y las tácticas de doble extorsión para ampliar su alcance. A medida que los grupos de ransomware evolucionan y los riesgos asociados a la IA generativa se multiplican, resulta imprescindible que las organizaciones refuercen sus estrategias de prevención de amenazas, seguridad de datos y gobernanza de IA para mantenerse un paso por delante de sus adversarios. La entrada España registra 1.932 ciberataques semanales de media en octubre, un 6% más que en 2024 se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}