{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-13-03620fc5",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42327",
  "title": "Uno de cada dos consumidores europeos confunde mensajes legítimos de marcas con estafas",
  "url": "https://cybersecuritynews.es/uno-de-cada-dos-consumidores-europeos-confunde-mensajes-legitimos-de-marcas-con-estafas/",
  "published_at": "2025-11-13T21:23:00+00:00",
  "fetched_at": "2025-11-14T11:18:51.530647+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "El 50% de los consumidores admite haber confundido activamente un mensaje legítimo de una marca con una estafa, según una encuesta realizada por Sinch, la empresa de servicios pionera en impulsar las comunicaciones en la nube entre las empresas y sus clientes, a usuarios y líderes empresariales que revela la creciente crisis de confianza digital que amenaza la interacción con las marcas justo antes de la temporada de fiestas. Esta situación supone un punto crítico y un perjuicio en la comunicación entre empresas y clientes, ya que la mitad de los mensajes promocionales o esenciales corren el riesgo de ser ignorados o descartados por los consumidores. El informe examina el estado global de los Rich Communication Services (RCS) en las relaciones con clientes, y resalta una demanda urgente de los consumidores por contar con sistemas de seguridad verificada. Además, la encuesta identifica la brecha existente entre las prácticas de comunicación de las marcas y las expectativas de los consumidores: Señales claras de verificación: el 74 % de los consumidores europeos afirma que es más probable que confíen y actúen ante mensajes que incluyan señales claras de autenticación: logotipo o una marca de verificación. Riesgo generalizado: la mitad de los encuestados asegura haber recibido mensajes de apariencia sospechosa en el último año. Esta exposición constante al fraude conduce a los consumidores a desconfiar de todos los mensajes no solicitados, lo que genera una gran pérdida de participación y tasas de respuesta para aquellos remitentes no verificados. Desconfianza y automatización: la falta de confianza en la seguridad también afecta a los nuevos canales. Un tercio de los encuestados manifiesta que no confiaría en una solución impulsada por IA para atender consultas básicas, lo que indica que la seguridad debe ser un pilar fundamental en cualquier estrategia de experiencia del cliente automatizada (CXA). La mensajería verificada, clave para los sectores financieros, de salud y retail La mensajería verificada está dejando de ser una herramienta de nicho para convertirse en una necesidad estratégica a nivel empresarial, especialmente en industrias de alta sensibilidad como los servicios financieros, o el sector salud y retail: Servicios financieros: los consumidores están abiertos a una interacción más profunda y segura. Un 43 % afirma querer que las instituciones financieras les envíen comunicaciones personalizadas sobre su situación económica actual. Salud: en este sector la preocupación por la seguridad es especialmente crítica. Solo el 13% de los encuestados se siente cómodo recibiendo comunicaciones a través de canales como SMS tradicional, WhatsApp o Messenger. Esta baja cifra revela la necesidad de adoptar un canal verificado y seguro como el RCS para informar a los usuarios de recordatorios de citas y entrega de información sensible. Retail (comercio minorista): a pesar del alto volumen de mensajes promocionales, solo el 6% de los consumidores considera actualmente que WhatsApp y Messenger son los mejores canales para recibir comunicaciones de tiendas. Esto subraya la necesidad de contar con un canal seguro y de confianza para destacar entre el ruido de mensajes que reciben los consumidores. RCS, una solución a la desconfianza del consumidor El panorama del mercado está cambiando drásticamente. En la actualidad, con los sistemas operativos móviles, incluida la actualización de Apple iOS 26, se está reforzando el uso de bandejas de entrada filtradas que separan a los remitentes no reconocidos. En este contexto, ser un remitente verificado y confiable ya no es opcional, es fundamental para mantener la visibilidad y la interacción con los clientes, sobre todo, durante las temporadas altas del comercio electrónico. Los protocolos de mensajería verificada, como RCS, ayudan a solucionar esta crisis de confianza entre consumidores y marcas al autenticar identidades de remitente, implementar logotipos de marca y protección contra suplantación. Esto garantiza que los clientes puedan reconocer los mensajes auténticos instantáneamente, reduciendo significativamente el riesgo de fraude y aumentando las tasas de conversión. La entrada Uno de cada dos consumidores europeos confunde mensajes legítimos de marcas con estafas se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}