{
  "id": "krebs-on-security-2025-11-13-361792df",
  "source_id": "krebs-on-security",
  "guid": "https://krebsonsecurity.com/?p=72607",
  "title": "Google Sues to Disrupt Chinese SMS Phishing Triad",
  "url": "https://krebsonsecurity.com/2025/11/google-sues-to-disrupt-chinese-sms-phishing-triad/",
  "published_at": "2025-11-13T14:47:22+00:00",
  "fetched_at": "2025-11-14T11:20:23.583560+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Google is suing more than two dozen unnamed individuals allegedly involved in peddling a popular China-based mobile phishing service that helps scammers impersonate hundreds of trusted brands, blast out text message lures, and convert phished payment card data into mobile wallets from Apple and Google. In a lawsuit filed in the Southern District of New York on November 12, Google sued to unmask and disrupt 25 &#8220;John Doe&#8221; defendants allegedly linked to the sale of Lighthouse, a sophisticated phishing kit that makes it simple for even novices to steal payment card data from mobile users. Google said Lighthouse has harmed more than a million victims across 120 countries. A component of the Chinese phishing kit Lighthouse made to target customers of The Toll Roads, which refers to several state routes through Orange County, Calif. Lighthouse is one of several prolific phishing-as-a-service operations known as the &#8220;Smishing Triad,&#8221; and collectively they are responsible for sending millions of text messages that spoof the U.S. Postal Service to supposedly collect some outstanding delivery fee, or that pretend to be a local toll road operator warning of a delinquent toll fee. More recently, Lighthouse has been used to spoof e-commerce websites, financial institutions and brokerage firms. Regardless of the text message lure used or brand used, the basic scam remains the same: After the visitor enters their payment information, the phishing site will automatically attempt to enroll the card as a mobile wallet from Apple or Google. The phishing site then tells the visitor that their bank is going to verify the transaction by sending a one-time code that needs to be entered into the payment page before the transaction can be completed. If the recipient provides that one-time code, the scammers can link the victim&#8217;s card data to a mobile wallet on a device that they control. Researchers say the fraudsters usually load several stolen wallets onto each mobile device, and wait 7-10 days after that enrollment before selling the phones or using them for fraud. Google called the scale of the Lighthouse phishing attacks &#8220;staggering.&#8221; A May 2025 report from Silent Push found the domains used by the Smishing Triad are rotated frequently, with approximately 25,000 phishing domains active during any 8-day period. Google&#8217;s lawsuit alleges the purveyors of Lighthouse violated the company&#8217;s trademarks by including Google&#8217;s logos on countless phishing websites. The complaint says Lighthouse offers over 600 templates for phishing websites of more than 400 entities, and that Google&#8217;s logos were featured on at least a quarter of those templates. Google is also pursuing Lighthouse under the Racketeer Influenced and Corrupt Organizations (RICO) Act, saying the Lighthouse phishing enterprise encompasses several connected threat actor groups that work together to design and implement complex criminal schemes targeting the general public. According to Google, those threat actor teams include a &#8220;developer group&#8221; that supplies the phishing software and templates; a &#8220;data broker group&#8221; that provides a list of targets; a &#8220;spammer group&#8221; that provides the tools to send fraudulent text messages in volume; a &#8220;theft group,&#8221; in charge of monetizing the phished information; and an &#8220;administrative group,&#8221; which runs their Telegram support channels and discussion groups designed to facilitate collaboration and recruit new members. &#8220;While different members of the Enterprise may play different roles in the Schemes, they all collaborate to execute phishing attacks that rely on the Lighthouse software,&#8221; Google&#8217;s complaint alleges. &#8220;None of the Enterprise’s Schemes can generate revenue without collaboration and cooperation among the members of the Enterprise. All of the threat actor groups are connected to one another through historical and current business ties, including through their use of Lighthouse and the online community supporting its use, which exists on both YouTube and Telegram channels.&#8221; Silent Push&#8217;s May report observed that the Smishing Triad boasts it has &#8220;300+ front desk staff worldwide&#8221; involved in Lighthouse, staff that is mainly used to support various aspects of the group’s fraud and cash-out schemes. An image shared by an SMS phishing group shows a panel of mobile phones responsible for mass-sending phishing messages. These panels require a live operator because the one-time codes being shared by phishing victims must be used quickly as they generally expire within a few minutes. Google alleges that in addition to blasting out text messages spoofing known brands, Lighthouse makes it easy for customers to mass-create fake e-commerce websites that are advertised using Google Ads accounts (and paid for with stolen credit cards). These phony merchants collect payment card information at checkout, and then prompt the customer to expect and share a one-time code sent from their financial institution. Once again, that one-time code is being sent by the bank because the fake e-commerce site has just attempted to enroll the victim&#8217;s payment card data in a mobile wallet. By the time a victim understands they will likely never receive the item they just purchased from the fake e-commerce shop, the scammers have already run through hundreds of dollars in fraudulent charges, often at high-end electronics stores or jewelers. Ford Merrill works in security research at SecAlliance, a CSIS Security Group company, and he&#8217;s been tracking Chinese SMS phishing groups for several years. Merrill said many Lighthouse customers are now using the phishing kit to erect fake e-commerce websites that are advertised on Google and Meta platforms. &#8220;You find this shop by searching for a particular product online or whatever, and you think you&#8217;re getting a good deal,&#8221; Merrill said. &#8220;But of course you never receive the product, and they will phish that one-time code at checkout.&#8221; Merrill said some of the phishing templates include payment buttons for services like PayPal, and that victims who choose to pay through PayPal can also see their PayPal accounts hijacked. A fake e-commerce site from the Smishing Triad spoofing PayPal on a mobile device. &#8220;The main advantage of the fake e-commerce site is that it doesn&#8217;t require them to send out message lures,&#8221; Merrill said, noting that the fake vendor sites have more staying power than traditional phishing sites because it takes far longer for them to be flagged for fraud. Merrill said Google&#8217;s legal action may temporarily disrupt the Lighthouse operators, and could make it easier for U.S. federal authorities to bring criminal charges against the group. But he said the Chinese mobile phishing market is so lucrative right now that it&#8217;s difficult to imagine a popular phishing service voluntarily turning out the lights. Merrill said Google&#8217;s lawsuit also can help lay the groundwork for future disruptive actions against Lighthouse and other phishing-as-a-service entities that are operating almost entirely on Chinese networks. According to Silent Push, a majority of the phishing sites created with these kits are sitting at two Chinese hosting companies: Tencent (AS132203) and Alibaba (AS45102). &#8220;Once Google has a default judgment against the Lighthouse guys in court, theoretically they could use that to go to Alibaba and Tencent and say, &#8216;These guys have been found guilty, here are their domains and IP addresses, we want you to shut these down or we&#8217;ll include you in the case.'&#8221; If Google can bring that kind of legal pressure consistently over time, Merrill said, they might succeed in increasing costs for the phishers and more frequently disrupting their operations. &#8220;If you take all of these Chinese phishing kit developers, I have to believe it&#8217;s tens of thousands of Chinese-speaking people involved,&#8221; he said. &#8220;The Lighthouse guys will probably burn down their Telegram channels and disappear for a while. They might call it something else or redevelop their service entirely. But I don&#8217;t believe for a minute they&#8217;re going to close up shop and leave forever.&#8221;",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}