{
  "id": "security-affairs-securityaffairs-co-2025-11-13-e9945fca",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184561",
  "title": "Amazon alerts: advanced threat actor exploits Cisco ISE & Citrix NetScaler zero-days",
  "url": "https://securityaffairs.com/184561/hacking/amazon-alerts-advanced-threat-actor-exploits-cisco-ise-citrix-netscaler-zero-days.html",
  "published_at": "2025-11-13T08:42:58+00:00",
  "fetched_at": "2025-11-13T11:21:56.151393+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Amazon warns that an advanced threat actor exploited zero-days in Cisco ISE and Citrix NetScaler to deploy custom malware. Amazon&#8217;s threat intelligence researchers spotted an advanced threat actor exploiting two previously undisclosed zero-day flaws in Cisco Identity Service Engine (ISE) and Citrix NetScaler ADC to deliver custom malware. Attackers also exploited multiple undisclosed vulnerabilities. Amazon’s honeypots revealed exploitation attempts of the Citrix Bleed Two (CVE-2025-5777) and Cisco ISE (CVE-2025-20337) for pre-auth RCE before public disclosure. &#8220;What made this discovery particularly concerning was that exploitation was occurring in the wild before Cisco had assigned a CVE number or released comprehensive patches across all affected branches of Cisco ISE.&#8221; reads the advisory published by Amazon. &#8220;This patch-gap exploitation technique is a hallmark of sophisticated threat actors who closely monitor security updates and quickly weaponize vulnerabilities.&#8221; One exploited Cisco ISE, the actor installed a bespoke web shell masquerading as IdentityAuditAction. Built for ISE, it ran fully in-memory, injected via Java reflection, and registered an HTTP listener on Tomcat. &#8220;This wasn’t typical off-the-shelf malware, but rather a custom-built backdoor specifically designed for Cisco ISE environments.&#8221; states the report. The web shell used DES with nonstandard Base64, required specific headers for access, and left minimal artifacts. The deserialization routine decoded a payload, defined or instantiated a proxy class, and executed it. The actor showed expert knowledge of Java, Tomcat, and Cisco ISE internals, suggesting a well-funded group with access to multiple zero-days and advanced exploit research. Amazon security researchers warn that critical infrastructure, including identity systems and remote access gateways, are prime targets. Even well-maintained systems are at risk, highlighting the need for defense-in-depth, robust detection, and restricted access to privileged endpoints. &#8220;The pre-authentication nature of these exploits reveals that even well-configured and meticulously maintained systems can be affected.&#8221; concludes the report. &#8220;This underscores the importance of implementing comprehensive defense-in-depth strategies and developing robust detection capabilities that can identify unusual behavior patterns.&#8221; Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Cisco ISE)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}