{
  "id": "tenable-blog-tenable-com-2025-11-13-89658ba0",
  "source_id": "tenable-blog-tenable-com",
  "guid": "https://www.tenable.com/210510",
  "title": "How Rapid AI Adoption Is Creating an Exposure Gap",
  "url": "https://www.tenable.com/blog/how-rapid-ai-adoption-is-creating-an-exposure-gap",
  "published_at": "2025-11-13T14:00:00+00:00",
  "fetched_at": "2025-11-14T11:19:29.409946+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "As organizations rush to deploy AI, enterprise defenses are struggling to keep up. This blog explores the emerging AI exposure gap — the widening divide between innovation and protection — and what security leaders can do to close it.Key takeaways:The AI exposure gap is widening as most organizations adopt AI faster than they can secure it, creating a gap between innovation and security.&nbsp;Many organizations are aligning with frameworks like the EU AI Act and NIST AI RMF and adopting best practices, but few are translating those efforts into real protection — with only a small share encrypting AI data, testing AI systems, or enforcing identity controls.&nbsp;Tenable’s latest Insight Brief, AI Adoption Outpaces Security: The AI Exposure Gap, explains how proactive defense and continuous visibility can help organizations secure AI pipelines and reduce exposure.AI isn’t just reshaping how organizations innovate, it is rewriting the rules of risk.As businesses rush to adopt AI tools and integrate them into operations, the pace of innovation has outstripped the pace of protection. The result? A growing AI exposure gap that’s leaving critical systems and data vulnerable.AI’s rapid integration into everyday business tools like productivity apps, browsers, and cloud services creates invisible pathways for attack. As AI becomes embedded into enterprise ecosystems, these same connection points between systems, models, and data expand the attack surface, exposing new risks beyond the models themselves.This blog takes a closer look at findings from Tenable’s new Insight Brief, AI Adoption Outpaces Security: The AI Exposure Gap, which builds on The State of Cloud and AI Security 2025 report, developed in collaboration with the Cloud Security Alliance (CSA). While the report mapped the broad landscape of cloud and AI security, this brief dives deeper into one urgent theme: the widening divide between AI innovation and enterprise readiness — and what security leaders can do about it.Nearly nine in ten organizations (89%) have adopted AI in some form. More than half (55%) of organizations are running AI in production, and another 34% are in pilot phases. Yet, one in three (34%) have already suffered an AI-related breach.Two of the three top causes of these breaches — exploited vulnerabilities (21%) and insider threats (18%) — are hardly unique to AI, a reminder of the importance of proactive exposure management and cybersecurity best practices.Top Causes of AI Workload Breaches: Exploited Vulnerabilities and Security Flaws Source: State of Cloud and AI Security 2025, commissioned by Tenable and developed in collaboration with the Cloud Security Alliance. &nbsp;Each new AI model, dataset, and integration expands the attack surface, particularly across hybrid and multi-cloud environments where visibility is fragmented and risk assessments lag behind adoption.&nbsp;The lesson: AI exposure is now a measurable enterprise risk — amplified by weak identity controls and limited visibility across hybrid and multi-cloud environments.Compliance ≠ securityOrganizations are making meaningful progress by aligning with frameworks like the EU AI Act and NIST AI RMF. While 51% follow these frameworks, only 22% encrypt AI data and 26% conduct AI-specific security testing, such as red-teaming.The result: Organizations may check the box on compliance while leaving critical data and AI pipelines vulnerable. Compliance and security often overlap, but they serve different goals. Source: State of Cloud and AI Security 2025, commissioned by Tenable and developed in collaboration with the Cloud Security Alliance. Other steps organizations are taking, beyond compliance, include adopting industry best practices, conducting regular audits of AI model integration protections, and implementing AI-specific identity and access controls, all of which play a role in reducing risk.How to close the AI exposure gapTo bridge the gap between AI innovation and security, organizations should:Treat AI as a dynamic attack surface and continuously monitor for anomalous activity.Strengthen foundational controls like encryption, access management, and model integrity validation.Integrate AI exposures into unified, proactive risk management strategies across cloud and hybrid environments.Security teams need unified visibility to manage this new layer of risk effectively, moving beyond compliance checklists to real-world resilience.How Tenable can helpTenable provides unified exposure management that brings together cloud, identity and AI risk insights into a single view. Tenable AI Exposure, available in the Tenable One Exposure Management Platform, gives you visibility into how your teams use AI platforms and where that usage could put your data, users, and defenses at risk. Together with Tenable AI Aware, which uncovers AI tools across your environment, Tenable now provides one of the first end-to-end solutions to both discover and secure AI platform usage as part of your exposure management program.Learn moreDownload The State of Cloud and AI Security 2025View the Insight Brief: AI Adoption Outpaces Security: The AI Exposure Gap",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}