{
  "id": "cyberscoop-2025-11-17-20b6f2f1",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86835",
  "title": "Dozens of groups call for governments to protect encryption",
  "url": "https://cyberscoop.com/encryption-sixty-groups-call-on-governments-to-oppose-backdoor-mandates/",
  "published_at": "2025-11-17T20:56:09+00:00",
  "fetched_at": "2025-11-18T11:20:42.745383+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "On Monday, more than 60 digital commerce and trade groups called on governments around the globe to reject efforts or requests to weaken or bypass encryption, saying strong encrypted communications provides critical protections for user privacy, secure data protection and trust that underpin some of society’s most important interactions. “Encryption is a vital tool for ensuring that consumers, businesses and governments can confidentially engage online, fostering a secure environment that supports economic growth and cross-border collaboration,” the groups wrote. The letter, signed by The App Association, the Business Software Alliance, the Information Technology Industry Council, the Surveillance Technology Oversight Project and others, argues that the tradeoffs in privacy and security to all users would outweigh the benefits to law enforcement, stating “any effort to undermine encryption, whether through backdoors, key escrow systems, or technical mandates, undermines that trust.” While policymakers in the U.S. and other democracies have been debating the question of “lawful access” to encrypted data for decades, the letter comes as countries in Europe and other parts of the world have made moves over the past year to regulate or mandate some form of legalized access for criminal and national security investigations. This year, Apple removed its end-to-end encrypted Advanced Data Protection plans from the UK, part of a running dispute with British officials over access to encrypted iCloud data for national security investigations. Over the past three decades, the U.S. and governments around the world have come up with a range of technological proposals for gaining access to encrypted communications for law enforcement and national security investigations: from Clipper Chips to key escrow systems. In August, Director of National Intelligence Tulsi Gabbard claimed to have persuaded British officials to reverse their position, but the next month Apple reiterated its plans to remove the advanced encryption plan from UK devices, saying it “remains committed to offering our users the highest level of security for their personal data and we are hopeful that we will be able to do so in the future in the United Kingdom.” “As we have said many times before, we have never built a backdoor or master key to any of our products or services and we never will,” Apple’s statement reads. Across St. George’s Channel, Ireland’s Minister of Justice Jim O’Callaghan is reportedly working on a proposal that would grant access to encrypted data to the An Garda Síochána, the country’s national police and security service. Details of that proposal have not been publicized, but in a speech in July, O’Callaghan outlined his views on encryption, saying that the right to privacy cannot be allowed to become “sacrosanct” when it comes to law enforcement investigations and that there is “a need to grapple with the question of what data we will permit [police] to access, and what systems, protections and oversights should be in place.” “None of us would like to imagine living in a surveillance State, with all of our private life – our thoughts, our communications, our interests – being observed and recorded,” O’Callaghan said. “But neither, I think, would we like to imagine people who have taken or plan to take the lives of others continuing to walk free with impunity, as a result of an inability on the part of Gardaí to effectively investigate their crimes.”Last month, the European Union came close to passing a new regulation, called Chat Control, that would have given governments broad authority to mass scan user devices for Child Sexual Abuse Material (CSAM). Digital groups said the regulation would mark “the end” of privacy in Europe and threaten journalists, human rights activists, political dissidents, domestic abuse survivors and other victims who rely on the technology for legitimate means. Germany, a critical swing vote, later came out against the proposal, and EU proponents canceled the vote. The post Dozens of groups call for governments to protect encryption appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}