{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-17-d94568eb",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42338",
  "title": "Las redes sociales desbancan al correo electrónico como principal vía de estafas en España",
  "url": "https://cybersecuritynews.es/las-redes-sociales-desbancan-al-correo-electronico-como-principal-via-de-estafas-en-espana/",
  "published_at": "2025-11-17T22:00:00+00:00",
  "fetched_at": "2025-11-18T11:20:18.285213+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Bitdefender, empresa mundial en ciberseguridad, acaba de publicar los resultados del Informe sobre Ciberseguridad del Consumidor 2025, basado en una encuesta independiente realizada a más de 7.000 personas en todo el mundo. El estudio analiza los principales comportamientos, prácticas y preocupaciones en materia de ciberseguridad de los usuarios a nivel global, poniendo de manifiesto importantes carencias que los dejan expuestos a amenazas como el malware, el fraude online, el robo de datos o los engaños impulsados por inteligencia artificial (IA). Los resultados de este año subrayan el papel dual de la IA: mientras impulsa protecciones más avanzadas para los usuarios, también está siendo utilizada por los ciberdelincuentes para crear estafas más creíbles y manipular la información pública. “Estos resultados ponen de relieve la creciente importancia de la concienciación en ciberseguridad, especialmente ahora que los ataques a consumidores son cada vez más frecuentes y sofisticados en la era de la inteligencia artificial”, afirma Ciprian Istrate, vicepresidente sénior de Operaciones de Bitdefender Consumer Solutions Group. “Bitdefender lleva años siendo pionera en el uso de la ‘IA buena’ para combatir el cibercrimen, pero los actores de amenazas también la están utilizando para mejorar sus ataques. Contraseñas sólidas, una buena gestión de las cookies y soluciones de seguridad de confianza pueden marcar la diferencia. Los ciberdelincuentes no descansan, pero la concienciación y las herramientas adecuadas empoderan a los usuarios para defenderse.” El Informe sobre Ciberseguridad del Consumidor 2025 se basa en un estudio independiente realizado a más de 7.000 consumidores de Australia, Francia, Alemania, Italia, España, Reino Unido y Estados Unidos. Principales conclusiones del Informe sobre Ciberseguridad del Consumidor 2025 Las redes sociales superan por primera vez al correo electrónico como principal canal de estafas. Las redes sociales son ahora el medio más utilizado por los ciberdelincuentes, con un 34% de los casos, por delante del correo electrónico (28%), las llamadas telefónicas (25%), los SMS (24%) y los anuncios online (21%). Las diferencias generacionales son significativas: las personas de entre 25 y 34 años tienen más del doble de probabilidades de caer en una estafa a través de redes sociales (43%) que las mayores de 55 (20%). En España, las plataformas más utilizadas para este tipo de engaños son WhatsApp, Instagram y TikTok, especialmente entre los jóvenes de 25 a 34 años. Las estafas con IA dominan las preocupaciones de los consumidores. Al ser preguntados por la inteligencia artificial, la principal inquietud fue su uso en estafas sofisticadas como los deepfakes (37%), seguida de la pérdida de empleo (30%) y la desinformación (29%). En España, los consumidores sitúan la desinformación como la segunda mayor amenaza tras las estafas, una preocupación que ha crecido notablemente respecto al año anterior, en línea con el auge de los contenidos generados por IA.” Por edades, casi la mitad de los mayores de 55 años (46%) se muestra preocupada por las estafas con IA, frente a algo más de un tercio de los millennials (34%). Las estafas siguen afectando gravemente a los usuarios. El 14% de los encuestados (1 de cada 7) reconoció haber sido víctima de una estafa en el último año, y un 4% adicional no está seguro. Con una pérdida media estimada de 545 dólares por estafa, esto equivale a más de 534.000 dólares perdidos entre los participantes del estudio. Estados Unidos lidera el número de víctimas (17%), seguido del Reino Unido (16%) y Australia (16%), mientras que Francia presenta el menor porcentaje (11%). En España, el porcentaje es similar a la media, con un 14% de consumidores que afirma haber caído en algún tipo de engaño online. España lidera el uso de soluciones de seguridad en el móvil. Casi la mitad (48%) de los encuestados a nivel global no utiliza una solución de seguridad de terceros en su teléfono, aunque más de la mitad realiza transacciones sensibles como pagos o compras online. Tampoco protegen adecuadamente otros dispositivos: el 58% no usa soluciones de seguridad en sus ordenadores y el 82% en sus tablets. En contraste, España destaca como el país europeo con mayor adopción de seguridad móvil, con un 57,6% de usuarios que protegen su dispositivo. Los consumidores gestionan una media de cinco cuentas online. Los participantes declararon tener una media de cinco cuentas online, y casi dos tercios cuentan con al menos tres. Un 32,8% tiene entre 3 y 5 cuentas, y otro 32,4% entre 6 y 9, una ligera reducción respecto a 2024. El Reino Unido lidera con más usuarios que gestionan de 6 a 9 cuentas (40%), mientras que España (21,7%) y Francia (25,6%) presentan las cifras más bajas. Las malas prácticas de contraseñas siguen comprometiendo la seguridad. Más de un tercio (37%) de los encuestados sigue anotando sus contraseñas en papel, y un 32% reutiliza la misma contraseña en varias cuentas. En España, los datos son similares, aunque se observa una mejora en el uso de gestores de contraseñas respecto al año anterior, especialmente entre los usuarios más jóvenes. Los jóvenes de entre 16 y 34 años son más propensos que los mayores de 55 a reutilizar contraseñas en tres o más cuentas (20% frente al 14%), y las malas prácticas son más frecuentes entre quienes han sufrido una estafa (23%) que entre quienes no (16%). La falta de gestión de cookies pone en riesgo la privacidad y la seguridad.Casi la mitad (48%) de los encuestados acepta todas las cookies por defecto, mientras que solo el 36% las gestiona manualmente y el 16% las rechaza por completo. Un 75% admite que no lee —o apenas revisa— las condiciones antes de aceptarlas. La comodidad es la razón principal: un 70% lo hace para acceder rápidamente al contenido, mientras que un 25% no muestra preocupación por el seguimiento de datos. Este comportamiento expone a los usuarios a riesgos de privacidad y seguridad, ya que las cookies pueden permitir el perfilado, la explotación de datos o incluso el secuestro de sesiones. Este comportamiento es también común en España, donde la mayoría de los usuarios prioriza la rapidez de acceso frente a la gestión de la privacidad. Privacidad y confianza en la tecnología. El informe también destaca que más de uno de cada cinco españoles (21%) desea mantener privada su ubicación frente a las grandes tecnológicas, y el 59% evita compartir su información financiera online, mostrando una mayor concienciación en materia de privacidad que otros países europeos. La entrada Las redes sociales desbancan al correo electrónico como principal vía de estafas en España se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}