{
  "id": "security-affairs-securityaffairs-co-2025-11-17-b8e4b06d",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184742",
  "title": "Jaguar Land Rover confirms major disruption and £196M cost from September cyberattack",
  "url": "https://securityaffairs.com/184742/security/jaguar-land-rover-confirms-major-disruption-and-196m-cost-from-september-cyberattack.html",
  "published_at": "2025-11-17T14:37:23+00:00",
  "fetched_at": "2025-11-18T11:22:03.517828+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Jaguar Land Rover says the September 2025 cyberattack halted production, led to data theft, and cost £196M in the quarter. Jaguar Land Rover reported that a September 2025 cyberattack, claimed by Scattered Lapsus$ Hunters, cost the company £196 million in the quarter. In early September, Jaguar Land Rover shut down systems to mitigate a cyberattack that disrupted production and retail operations. The attack also impacted systems at the Solihull production plant. The overall production only restarted by October 8, 2025. UK dealers reported JLR disruptions blocking car registrations and parts supply. The company initially said customer data was not compromised. “JLR has been impacted by a cyber incident. &nbsp;We took immediate action to mitigate its impact by proactively shutting down our systems. We are now working at pace to restart our global applications in a controlled manner.” reads the&nbsp;statement&nbsp;published by the automaker. “At this stage there is no evidence any customer data has been stolen but our retail and production activities have been severely disrupt” The automaker did not disclose technical details about the incident; however, the group “Scattered Lapsus$ Hunters,” behind&nbsp;recent UK retail cyberattacks, claimed responsibility for the JLR attack. Jaguar Land Rover (JLR) is a British luxury vehicle manufacturer headquartered in Whitley, Coventry, UK. JLR combines two iconic brands, Jaguar and Land Rover. Since 2008, JLR has been owned by Tata Motors (India), which bought it from Ford.&nbsp;JLR sells vehicles in over 120 countries, with major markets in Europe, North America, and China. In mid-September, JLR confirmed that the cyberattack also led to a data breach without disclosing details about the type of information that had been compromised. According to the financial results for July 1 to September 30 shared by JLR, the cyberattack cost £196M ($220 million) in the quarter. &#8220;Revenue for Q2 was £4.9bn, down 24% year‑on‑year (YoY), while H1 revenue was £11.5bn, down 16% YoY. Revenue was impacted by the production stoppages JLR initiated in September following the cyber incident and the planned wind down of legacy Jaguar model Loss before tax and exceptional items of £(485)m for Q2 and £(134)m for H1, down from a profit of £398m and £1.1bn respectively a year ago, due to the challenges above and the continuing impact of US tariffs&#8221; reads the statement published by the carmaker. &#8220;Exceptional items of £238m in the quarter reflect cyber related costs of £196m and voluntary redundancy programme costs of £42m&#8221; At the end of September, the UK government announced a support package of £1.5 billion ($2 billion) for Jaguar Land Rover (JLR) in response to the disruptive cyberattack that recently hit the company. UK pledges decisive support for JLR after cyberattack, reinforcing its Industrial Strategy to boost auto sector growth, supply chain, and job creation. “The Government has agreed to support Jaguar Land Rover (JLR) with a guarantee expected to unlock up to £1.5 billion to give certainty to its supply chain following a recent cyber-attack, Business Secretary Peter Kyle has announced today (28 September).”&nbsp;reads the announcement. The UK government explained that its decision aims at protect JLR’s supply chain, safeguard jobs, and stabilize the auto sector after the cyberattack severely disrupted operations. The government highlighted JLR’s key role as a top exporter, employing 34,000 directly and supporting 120,000 jobs through its vast automotive supply chain. According to a recent report published by the Bank of England, UK Q3 2025 GDP was weaker than expected, partly due to the JLR cyberattack. &#8220;Headline GDP growth has remained slightly higher than estimates of underlying growth over recent quarters (Chart 1.7). Headline GDP is projected to have grown by 0.2% in Q3, a little less than expected in the August Report.&#8221; reads the Bank of England&#8217;s report. &#8220;That reflects weaker-than-expected growth in exports to the US, as well as disruption linked to the Jaguar Land Rover cyberattack. Headline GDP growth is expected to pick up to 0.3% in Q4.&#8221; Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, JLR)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}