{
  "id": "bellingcat-bellingcat-com-2025-11-14-24952a24",
  "source_id": "bellingcat-bellingcat-com",
  "guid": "https://www.bellingcat.com/?p=50172",
  "title": "Building on Ruins: The Russification of Mariupol, One Apartment Block at a Time",
  "url": "https://www.bellingcat.com/uncategorized/2025/11/14/building-on-ruins-the-russification-of-mariupol-one-apartment-block-at-a-time/",
  "published_at": "2025-11-14T10:20:39+00:00",
  "fetched_at": "2025-11-14T11:18:38.953201+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "× “They Are Building Houses on Bones” It’s the second time Moreva has lost her home. She fled to Mariupol from Makiivka, an industrial city near Donetsk, after Russia occupied Donbas in 2014. The 57-year-old rebuilt her life in the port city, working as a professor in Mariupol State University’s ecology department and running an animal shelter in her spare time. When Russia launched its full-scale invasion of Ukraine, her husband was in Donetsk and their adult daughter was living near the town of Bucha, where unarmed civilians were massacred. “I was preparing lectures and my daughter called me early in the morning and said: ‘Mum, we are being bombed.’ I said: ‘Vika, are you kidding? What do you mean you are being bombed?’ At that moment it was still quiet in Mariupol.” Soon after, the phone lines went down and Moreva lost all contact with her family. Viktoriia Moreva at the Sea of Azov, Mariupol On the day the airstrikes began in Mariupol, Moreva said she ran into the street with her neighbours to wave at a drone overhead. “We thought that, seeing civilians, they would not bomb the area,” she said. “But within a few minutes, the whole district was completely destroyed.” Moreva described the harrowing early days of the siege of Mariupol: water, gas and electricity supplies severed; Russian tanks roaming the city; bodies in the streets; children shot in fleeing cars; screams from under the rubble. “All the authorities had left, abandoned the city. It was mostly civilians who remained, including many children, because there was no evacuation and no green corridors. We had nothing – no rescue services, no ambulances, no fire department, absolutely nothing.” Viktoriia Moreva’s apartment building after it was bombed Moreva said at least seven of her neighbours were killed when her apartment block was repeatedly bombed. The ones who survived cannot go home because the building has since been demolished. Of those who remain in the occupied city, she knows of only one, an old man, who was rehoused. She said his case was reported as a “success story” on pro-Russian social media channels. Across the city, Moreva said the bodies of many people who died in their homes have never been found. “People were trapped under the rubble when the buildings collapsed,” she said. “They suffocated or died from cold, hunger and illness because they couldn’t get out, and no one could reach them. Many were literally buried alive.” Often, she said, the bodies that were recovered were buried in the courtyards of the apartment buildings. “People covered the bodies with soil, and when the ground was frozen, they could only cover them lightly, wrapping them in carpets or blankets. “In Mariupol, now, they are building houses on bones. They are building so that people cannot return.” Viktoriia Moreva with her husband Alexander at Glenveagh National Park in Ireland Moreva, who was eventually reunited with her family, now lives in Ireland. She still has the keys to her apartment, “to the door that’s no longer there”. If she ever returns to Ukraine, it will not be to the adopted city that she loved. “Even if I dreamed of getting there, I cannot enter,” Moreva said. “I have nothing left in Mariupol.” Close video not supported in this browser. video not supported in this browser. Warning: This report contains graphic imagery. A new apartment in the Mirapolis complex comes with panoramic views of the city. The property developer boasts easy access to shops and schools, with colourful mock-ups showing families and manicured gardens. “If you&#8217;ve been thinking about owning your own apartment by the sea,” it says, “now is the best opportunity to realise your dream.” Prices range from about €75,000 to €110,000. The Mirapolis estate is just one of many “new” residential housing complexes under construction across Mariupol, the Ukrainian port city subjected to some of the worst horrors of Russia’s invasion. When the apartment blocks that originally stood here were bombed in March 2022, the residents of Building 127 sheltered in the basement. Children were among the 90 people killed in the attack, according to Mariupol&#8217;s Destruction and Victims Map, which has documented the devastation across the city. At a nearby burial ground, graves were marked with crosses made from scrap wood. Credit: REUTERS --> --> --> The four high-rises on the western edge of Mariupol were destroyed, and then torn down. Now, they are being rebuilt. Credit: REUTERS --> --> Across the road is the new Nevsky residential estate, one of the sites pro-Kremlin media has used to paint a picture of life returning to normal in Mariupol, which has been under Russian occupation for more than three years. In a video of Russian president Vladimir Putin meeting residents in the neighbourhood in 2023, a woman in the background can be heard shouting. “This is all a lie!” The damaged buildings were leveled by 2024. Credit: Google Earth / Maxar, Google Earth / Airbus A Bellingcat investigation has identified 23 multi-storey housing complexes — more than 50 buildings with at least 6,000 apartments – being built in the ashes of Mariupol and advertised for sale, with low interest rate loans, to Russian citizens. Construction of the first buildings has been completed; new residents have already moved in. Meanwhile, many of the original Ukrainian owners cannot return home. Satellite imagery shows the buildings before Russia invaded Ukraine in 2022. By the summer of 2024, all had been demolished, with some already being rebuilt. video not supported in this browser. Russia launched its full-scale invasion of Ukraine on Feb. 24, 2022, minutes after Vladimir Putin announced the start of a “special military operation” on state television. Credit: Al Jazeera The strategically important southeastern city of Mariupol was surrounded within days. Homes and infrastructure were shelled. Credit: Associated Press The Russian bombardment cut food, water, power and heat to the besieged city. Internet and phone lines went down. Credit: REUTERS/Alexander Ermochenko Most of Mariupol’s 430,000 residents were forced to flee. Credit: REUTERS/Alexander Ermochenko video not supported in this browser. By the time the brutal 86-day siege ended, an estimated 25,000 people had been killed, including thousands who died when their homes were bombed. Many are buried in mass graves. The United Nations said 90 percent of Mariupol’s residential buildings were damaged or destroyed. video not supported in this browser. video not supported in this browser. video not supported in this browser. video not supported in this browser. As part of its post-siege reconstruction of the coastal city, Russia deployed workers to demolish what was left. video not supported in this browser. video not supported in this browser. video not supported in this browser. video not supported in this browser. And to rebuild. In the months after Mariupol was razed, the new authorities released a plan to “restore” the city and grow its population to 500,000 over the next decade. video not supported in this browser. It is part of the Russification of Mariupol: streets have been renamed, Ukrainian monuments removed, and murals painted over. Access to Ukrainian websites has been blocked and Russian programmes are shown on television. Mariupol and St Petersburg are now “twin cities”. Russia is painting a picture of a city restored, but many locals still live in perilous conditions, including some in half-destroyed buildings. Credit: REUTERS/Sergei Ilnitsky Continue reading Take me straight to the data “A Step into a Bright Future” The largest of the 23 developments is the Leningrad Quarter, a 10-minute drive from the shore of the Sea of Azov. The sprawling residential complex, in Mariupol’s north-east, includes at least 11 high-rises along with car parking, recreation areas and children’s playgrounds. Last week, another phase of the project was released, with four new apartment blocks listed online. “We are building the future of Russia!” the website for the development says. The apartments are listed for sale with “preferential mortgages” at a 2 percent interest rate over 30 years with Russian banks. Mortgage rates in Russia are, on average, about 20 percent. --> --> Rewind three years. The Leningrad Quarter was a site of death and destruction. People fell from their windows when the original building at 81 Metallurgist Avenue was shelled and engulfed in flames, according to posts in a Telegram channel that documented the lives lost here. A great-grandmother was killed when her apartment in Building 77 burned, her family said. Another woman died while hiding in the basement of Building 121. “Forgive me, mum, for not saving you,” her daughter wrote. Near Building 83, someone posted a photo of a 36-year-old woman’s grave, with fresh flowers and a makeshift plaque. “I don&#8217;t know how she died,” they said. Credit: TASS video not supported in this browser. Residents who survived the siege of Mariupol, or have since returned to the captured city, face the challenge of finding somewhere to live. How can they prove ownership when property records are missing or have been destroyed? To claim their home in the occupied territory – to prevent an “ownerless” property from being confiscated – they must become Russian citizens and present, in person, with ownership documents. Credit: Mariupol&#8217;s Destruction and Victims Map video not supported in this browser. video not supported in this browser. video not supported in this browser. video not supported in this browser. video not supported in this browser. video not supported in this browser. Some residents – including the people who lived in the original Soviet-era buildings at the Leningrad site – have posted videos to social media, cautiously appealing to Putin and the Russian-installed authorities in Mariupol to intervene. “We don’t have the possibility to buy the housing with [a] mortgage, as many of us are pensioners or have lost practically everything,” one woman said. Another said: “In 2022 we lost housing, property, and many of us also our loved ones.” Residents complain about being unable to move back to the sites where they used to live, and say they were misled about access to compensatory housing. They say many people across the city are still homeless or forced to rent. Those who can prove property ownership say the financial compensation being offered is at a rate far lower than market value. Authorities have said they will compensate residents who lost their homes in the war, but this is capped at about €12,000 for a one-person household and €16,000 for a two-person family. The cheapest flats advertised in the rebuilt apartment blocks start at about €45,000 for a 20m2 studio. “We are not asking for favours, but for adherence to the law and promises made,” one woman said. “We ask to be given the housing we were promised, not an offer of [a] mortgage to our own house or someone’s ‘ownerless’ apartment.” It’s not only people from the reconstructed high-rises advertised for sale who are impacted. In one video, a woman can be heard sobbing as she films the hollowed-out shell of a building on the western edge of Mariupol. This apartment block was demolished but has not been rebuilt. video not supported in this browser. For Viktoriia Moreva, who lived on the first floor of the building, there’s nothing to go back to. Moreva was in a friend’s home nearby when airstrikes hit her home in March 2022. She watched it burn. Viktoriia Moreva in Ireland &#8220;We just couldn&#8217;t understand it, why the shelling started with the houses,&#8221; she said. &#8220;It was a quiet residential area. There was a school and two kindergartens in this area. No soldiers were in the houses. Only civilians.&#8221; Read Viktoriia&#8217;s story “Flagrant Violations of International Law” Professor Balakrishnan Rajagopal, the UN’s Special Rapporteur on the right to adequate housing, said Russia’s attacks on homes and residential areas in Mariupol were “grave war crimes and crimes against humanity”. He told Bellingcat that the scale and intensity of destruction, mass displacement of residents and deaths of civilians constituted “one of the most flagrant violations of international law” and were “comparable to some of the worst examples from World War II”. “Mass destruction of homes during conflict as in Mariupol are acts of ‘domicide’, as I proposed to the UN General Assembly in 2022, and may constitute war crimes, crimes against humanity or even genocide, depending on facts,” he said. Professor Rajagopal said the housing policy measures implemented by Russia were contrary to the basic rules of international law, such as the prohibition against taking private property during occupation under the laws of war, including the Hague regulations. “What appears to be happening is in fact an annexation of Ukrainian territory, through occupation and creation of new property rights which excludes the former owners,” he said. “Declaring a property ‘ownerless’ or ‘abandoned’ in order to annex it is an old colonial legal trick that settler colonial states have used for hundreds of years when such property, usually belonging to native populations, was declared ‘terra nullius’ (no person’s land) in order to acquire it, but is considered to be completely contrary to modern international law.” “What Russia is attempting is to go back to medieval practices and discredited norms such as ‘terra nullius’ that Russia itself, as part of the Soviet Union, actively opposed for decades.” video not supported in this browser. A 2023 analysis by the Kyiv School of Economics estimated the damage to Ukraine’s housing stock to be almost $56 billion. Mariupol was one of the worst-affected cities: Ukrainian authorities said more than 11,000 homes were destroyed and tens of thousands more were damaged. Half of the 2,600 multi-storey residential buildings were reduced to rubble. Credit: REUTERS Over a large block that was decimated in central Mariupol, seven separate residential complexes are nearing completion. Among them are four gemstone-named developments ranging from nine to 15 storeys. Three apartment blocks in the centre of the “resort town” – the Residence I, Residence II, and Residence III – are due to be completed by the end of the year. video not supported in this browser. Like the other estates analysed by Bellingcat, these apartments are listed on Russian real estate websites with low-interest loans. The advertisements target families with children: “Everything is close by: the sea, a park, schools, medical facilities and a church,” says one for the new Residence III. They don’t show what was here before. The tree-lined street where Residence III now stands became a graveyard during the siege. Credit: REUTERS / Alexander Ermochenko A short walk away is Hospital No. 3, the children’s and maternity hospital bombed by Russian forces on March 9, 2022. “Everything was destroyed in one second,” said Elena Karas, a nurse who was caring for 13 premature babies on the third floor. “I didn’t ever think they could bomb our hospital. Not a hospital. You would think it’s a safe place,” she told The New York Times. Ukrainian authorities said three people were killed and more than a dozen others were injured in the attack, which President Volodymyr Zelensky said was evidence of genocide. Iryna Kalinina, the wounded pregnant woman in this photograph, and her unborn baby – named Miron, meaning “peace” – both died. Credit: Associated Press / Evgeniy Maloletka Across the road from the hospital, construction workers are building the Horizon complex, two “comfort class” high-rises due to be finished by 2026. A block behind the site is the Cypress complex. The residential building that originally stood here was bombed and later torn down. Advertisements for Cypress – “a new destination for those who value prestige, comfort, and reliability” – tout the 15-storey building’s proximity to Hospital No. 3. On March 16, 2022, a Russian airstrike hit Mariupol’s drama theatre. The grand Soviet-era building had become the city’s main bomb shelter, with hundreds of civilians seeking refuge inside. Outside, the word “CHILDREN” had been spelled out on the ground in giant Cyrillic letters. As many as 600 people reportedly died in the attack. Credit: Google Earth / Airbus Less than 500m from the theatre is the original site of the House with the Clock, a historic landmark in the city’s centre. Noted for its clock tower, the 1950’s building served as a meeting place for the city’s residents. In the months before Russia’s invasion, its facade had been restored and a new clock installed. Credit: House with the Clock / Google Maps The building was shelled during the siege and demolished after Mariupol fell. Credit: Mariupol&#8217;s Destruction and Victims Map A new multi-storey complex with studio, one- and two-bedroom apartments was built on the site in late 2024. “The House with the Clock was a recognisable symbol of Mariupol, but was damaged during the war,” the property developer’s website says. As is the case with most new complexes analysed by Bellingcat, its original address was changed under occupation – a tactic Mariupol’s residents say further complicates their claim to housing. The House with the Clock was on Myru Avenue – “Avenue of Peace”. The road has since been renamed Lenin Avenue, after the former Soviet leader. video not supported in this browser. Farther east is the Azovstal Iron and Steel Works plant, where Mariupol’s last defenders surrendered on May 20, 2022. Credit: Cover Media via REUTERS Beyond the Azovstal steelworks are four new residential developments: the Olympic, Left Bank, Zhukova and Designer’s House Mari, a seven-storey “business-class” complex “inspired by the sandy coast”. video not supported in this browser. The bombed-out building seen in this footage is where Designer’s House Mari is being built. Credit: Defense of Ukraine Polished advertisements for the new building show it will feature landscaped courtyards and a 24-hour concierge service. Prices for a two-bedroom apartment are listed for about €130,000. Ukrainian journalist Mstyslav Chernov and his Associated Press colleagues were trapped in Mariupol during the first weeks of the siege. video not supported in this browser. video not supported in this browser. The last international journalists to remain in the city, they captured some of the most defining – and haunting – images of the war. Unblur videos video not supported in this browser. video not supported in this browser. The crew reported from across the charred city, including in Mariupol’s north-west, near the new 655-apartment Mirapolis complex. In this area, four new complexes are also under construction. “This is where your story begins,” a website for the Azure Coasts development says. Among the people killed here in March 2022 was an elderly man. “He lies there under the rubble,” his granddaughter posted on Telegram. video not supported in this browser. An apartment building on Kuprina Street promises its new residents “comfort, security and affordability”. A video filmed nearby after the original buildings were bombed shows unburied bodies on the grass, carefully wrapped in sheets. Credit: Mariupol&#8217;s Destruction and Victims Map Maple Alley, a complex with 10 apartment blocks, is featured in a Russian YouTube video with the caption: “Dreaming of an apartment by the sea with a preferential mortgage?” It is being built where a mother and her son were buried with their neighbours during the siege. video not supported in this browser. Credit: Mariupol&#8217;s Destruction and Victims Map This high-rise, advertised as having children’s playgrounds and being close to a kindergarten, is on Troyiczka Street, which has been renamed to commemorate the USSR. Credit: Mariupol&#8217;s Destruction and Victims Map The UN’s Office of the High Commissioner for Human Rights (OHCHR) has said that Russia’s legislation on “abandoned property” in occupied Ukraine violates international humanitarian law prohibiting the unlawful confiscation of property, affecting both the right of displaced people to return to their homes and the right to adequate housing. The Institute for the Study of War (ISW) said Russia was engaged in a “large-scale campaign” to inventory real estate in occupied parts of Ukraine, including Mariupol, with the intention of nationalising and seizing property. Karolina Hird, a national security fellow at ISW, said the campaign has two main aims: to generate profit for the Russian state and to repopulate occupied areas with Russian citizens and residents loyal to the regime. Hird said Russia’s bill to standardise and codify the mass nationalisation of “ownerless” property in occupied Ukraine contains a provision for allocating nationalised residential real estate to government officials, military and law enforcement personnel, doctors and teachers. The properties are often offered to Russians at premium rates, she said, as a financial incentive to attract relocation to occupied regions. “The property nationalisation campaign therefore supports the Russian effort to lend legitimacy to its illegal occupation by creating the impression that occupied areas are predominantly populated by Russian citizens. The fact that Ukrainians who wish to reclaim their property from Russian nationalisation schemes must have Russian documentation further supports this campaign.” As of Aug. 2025, Russia’s real estate registration agency Rosreestr reported that it had registered 550,000 properties in occupied Ukraine as “ownerless”. Hird said the impact on the original owners and residents of seized property can be severe. “Russia uses its ownership of the seized property as a coercive bargaining tool, basically trying to force residents to return to occupied areas and receive Russian documentation and face the horrors and challenges of living under occupation if they wish to retain their property,” she said. “Property seizure also represents a loss of control for the original residents, who have no mechanism with which to dispute its allocation to Russian citizens or regime loyalists. Russia’s longer-term aim is to make the reintegration of occupied territories seem infeasible to Ukrainians, and the seizure of homes and apartments significantly complicates the concept of future reintegration.” View each building on the interactive map below. Click on a development for more information. × Destroyed: Rebuilt: New apartments: Price: View in Google Maps. View property listing. Satellite imagery Before Siege Demolition Take me back to the story Ilvija Bruge, Beau Donelly and Miguel Ramalho contributed to this article. Bellingcat is a non-profit and the ability to carry out our work is dependent on the kind support of individual donors. If you would like to support our work, you can do so here. You can also subscribe to our Patreon channel here. Subscribe to our Newsletter and follow us on Bluesky here and Mastodon here. With the unpredictability of social media algorithms making it harder for news outlets to reach audiences consistently, we have also started a WhatsApp channel that you can join to stay updated on our stories. Image Credits: Reuters, Associated Press, Al Jazeera, EFE, Mariupol’s Destruction and Victims Map, First Corps Azov of the National Guard of Ukraine, Mariupol Now, House with the Clock / Google Maps, TASS, Satellite images are courtesy of Planet Labs, Maxar, Airbus and Google Earth. This project was co-funded by the European Union under agreement number 101158277-BENEDMO-2023-DEPLOY-04. The post Building on Ruins&lt;span id=&quot;hide-colon&quot;&gt;:&lt;/span&gt; &lt;div class=&quot;subtitle&quot;&gt;The Russification of Mariupol, &lt;span class=&quot;mobile-line-break&quot;&gt;One Apartment Block&lt;/span&gt; &lt;span class=&quot;mobile-line-break&quot;&gt;at a Time&lt;/span&gt;&lt;/div&gt; appeared first on bellingcat.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}