{
  "id": "ciberseguridad-latam-ciberseguridadlatam-com-2025-11-14-1383d3dc",
  "source_id": "ciberseguridad-latam-ciberseguridadlatam-com",
  "guid": "https://ciberseguridadlatam.com/?p=19729",
  "title": "Kaspersky: las empresas sobrestiman su seguridad mientras descuidan lo básico",
  "url": "https://ciberseguridadlatam.com/kaspersky-las-empresas-sobrestiman-su-seguridad-mientras-descuidan-lo-basico/",
  "published_at": "2025-11-14T12:58:46+00:00",
  "fetched_at": "2025-11-15T11:16:20.634573+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Un nuevo estudio inédito revela brechas críticas en procesos, personas y tecnologías dentro de la seguridad corporativa de las empresas latinoamericanas. La excesiva confianza de los líderes genera una falsa sensación de protección. Una nueva encuesta de Kaspersky aplicada a&nbsp;300 líderes de ciberseguridad en América Latina&nbsp;revela una desconexión entre la confianza de los responsables de esta área en la solidez de sus defensas y la realidad operativa. Aunque el 97% de los entrevistados en la región afirma que los datos y sistemas de su empresa están bien protegidos, los hallazgos muestran que muchas organizaciones siguen siendo vulnerables. Según el informe, el 30% de las empresas latinoamericanas (40% de argentinas) no utiliza protección para endpoints (antivirus), mientras que el 44% en la región (40% en argentina) no cuenta con firewall, ambas medidas básicas de seguridad. En cuanto a soluciones avanzadas para la detección temprana de ataques, poco más de la mitad de las organizaciones en la región (63%) emplea servicios de Threat Intelligence (inteligencia de amenazas), que proporcionan información sobre ataques recientes y posibles riesgos para anticiparse; un cuarto (25%) ha adoptado soluciones de detección y respuesta extendida (XDR); el 31% utiliza soluciones de detección y respuesta en endpoints (EDR); y el 42% usa SIEM, un sistema que correlaciona datos de seguridad para detectar amenazas rápidamente. Este análisis sobre el uso de herramientas y servicios de protección indica que la mayoría de las empresas difícilmente podría detectar y responder a un ataque a tiempo para neutralizarlo antes de que tenga éxito.&nbsp;“Una ciberdefensa eficaz se apoya en un tripié formado por personas, procesos y tecnología. Cuando uno de estos pilares se descuida, la protección corporativa se vuelve frágil y reactiva”, explica&nbsp;Claudio Martinelli, director general para Américas en Kaspersky. El estudio también muestra que la adopción de tecnologías avanzadas —como XDR (detección y respuesta extendida), SIEM (gestión de información y eventos de seguridad) y EDR (detección y respuesta en endpoints)— seguirá evolucionando en los próximos meses: el 30% de las empresas latinoamericanas afirma que planea implementar XDR, el 26% pretende adoptar SIEM y el 25% quiere invertir en EDR durante el próximo año, aunque actualmente no las utilicen. Para los especialistas de Kaspersky, este movimiento demuestra un deseo positivo de evolución, pero también implica riesgos si la implementación no tiene una planificación adecuada.&nbsp;“Implementar soluciones de alta complejidad sin una estructura interna sólida, personal capacitado u objetivos claros es como construir castillos de arena: las tecnologías fallan porque la base es inestable. Antes de cualquier inversión, es esencial evaluar la madurez de la organización, la capacidad del equipo y qué tecnología puede ofrecer la mejor protección posible con los recursos técnicos y humanos disponibles”,&nbsp;advierte&nbsp;Martinelli. Para reducir la brecha entre la confianza que las empresas sienten en su protección y su verdadera capacidad de defensa, Kaspersky recomienda: Establecer y probar procedimientos regularmente, simulando situaciones reales de ataque para identificar áreas que requieren inversión a corto plazo. Evaluar la madurez cibernética interna (procesos, equipo, activos e integración tecnológica) antes de adquirir nuevas soluciones. Definir niveles mínimos de seguridad para cada tipo de operación. Cuanto mayor sea el acceso a datos confidenciales, mayor debe ser el control y la protección. Analizar la adopción de nuevas tecnologías considerando su impacto operativo y el tiempo necesario para implementarlas, a fin de definir el mejor costo-beneficio. Recordar que la tecnología cubre, en promedio, solo el 30% de las amenazas conocidas; para una protección de alta calidad, es necesario invertir también en personas (conocimiento técnico y conciencia) y procesos (políticas que permitan prevenir, identificar, responder, neutralizar y recuperarse rápidamente de un incidente). Promover una cultura de seguridad en todas las áreas, basada en los estándares de seguridad corporativa deseados y las mejoras necesarias para alcanzarlos. Desarrollar planes de integración tecnológica con cronogramas e indicadores de desempeño (KPIs) que permitan medir el progreso y evaluar las mejoras en las acciones previamente definidas. Según&nbsp;Claudio Martinelli, una estrategia de ciberseguridad robusta no se compra en la tienda, es una construcción que requiere planificación, capacitación continua e integración entre tecnología y gobernanza. Solo así las organizaciones estarán preparadas para enfrentar el escenario de amenazas cada vez más sofisticado en la región. Para obtener más información, visite la página de Kaspersky y descargue el&nbsp;informe de la encuesta CISO 2025. Acerca de Kaspersky Kaspersky es una empresa global de ciberseguridad y privacidad digital fundada en 1997. Con más de mil millones de dispositivos protegidos hasta la fecha contra ciberamenazas emergentes y ataques dirigidos, la profunda inteligencia sobre amenazas y experiencia en seguridad de Kaspersky se transforma constantemente en soluciones y servicios innovadores para proteger a individuos, empresas, infraestructuras críticas y gobiernos en todo el mundo. El completo portafolio de seguridad de la empresa incluye protección líder para la vida digital de dispositivos personales, productos y servicios de seguridad especializados para empresas, así como soluciones Cyber Immune para combatir amenazas digitales sofisticadas y en evolución. Ayudamos a millones de personas y a cerca de 200,000 clientes corporativos a proteger lo que más valoran. Más información en: www.kaspersky.com",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}