{
  "id": "cyberscoop-2025-11-14-e16e1a99",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86816",
  "title": "Google, researchers see signs that Lighthouse text scammers disrupted after lawsuit",
  "url": "https://cyberscoop.com/lighthouse-text-scammers-disrupted-google-lawsuit/",
  "published_at": "2025-11-14T16:02:32+00:00",
  "fetched_at": "2025-11-15T11:16:34.766055+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The phishing kit Lighthouse, which has aided text scams like those soliciting victims to pay unpaid road tolls, appears to have been hampered shortly after Google filed a lawsuit aimed at its creators. Google said on Thursday that Lighthouse had been shut down. Two other organizations that have tracked the suspected Chinese operators of Lighthouse said they saw signs it had at least been disrupted. &#8220;This shut down of Lighthouse&#8217;s operations is a win for everyone,” said Halimah DeLaine Prado, general counsel at Google. “We will continue to hold malicious scammers accountable and protect consumers.&#8221; Members of the syndicate, known to some by the name Smishing Triad, had been corresponding on Telegram channels. “We can confirm that all Lighthouse Telegram channels previously tracked have been deleted or taken down due to Telegram TOS violations,” Kasey Best, the director of threat intelligence at Silent Push, told CyberScoop. “We are tracking many websites still active and using Lighthouse kit code, as well as phishing kits used by other Smishing Triad threat actors, but there could be backend changes with Lighthouse or other disruptions in this criminal ecosystem which are just starting to be seen. “Either way, this is a positive sign for Google&#8217;s lawsuit, and we look forward to increased pressure against smishing threat actors based mostly in China,” Best continued. Ford Merrill, lead researcher at SecAlliance, told CyberScoop that it “can confirm that several domains historically associated with Lighthouse infrastructure appear to no longer be resolving to DNS requests at present.&#8221; Google filed its lawsuit in the U.S. District Court for the Southern District of New York. They allege that 25 unnamed individuals behind Lighthouse have violated racketeering, trademark and anti-hacking laws with their prolific SMS phishing, or “smishing,” platform. The post Google, researchers see signs that Lighthouse text scammers disrupted after lawsuit appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}