{
  "id": "schneier-on-security-2025-11-14-e5f51677",
  "source_id": "schneier-on-security",
  "guid": "https://www.schneier.com/?p=71136",
  "title": "The Role of Humans in an AI-Powered World",
  "url": "https://www.schneier.com/blog/archives/2025/11/the-role-of-humans-in-an-ai-powered-world.html",
  "published_at": "2025-11-14T12:00:33+00:00",
  "fetched_at": "2025-11-15T11:14:33.781514+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "As AI capabilities grow, we must delineate the roles that should remain exclusively human. The line seems to be between fact-based decisions and judgment-based decisions. For example, in a medical context, if an AI was demonstrably better at reading a test result and diagnosing cancer than a human, you would take the AI in a second. You want the more accurate tool. But justice is harder because justice is inherently a human quality in a way that &#8220;Is this tumor cancerous?&#8221; is not. That&#8217;s a fact-based question. &#8220;What&#8217;s the right thing to do here?&#8221; is a human-based question. Chess provides a useful analogy for this evolution. For most of history, humans were best. Then, in the 1990s, Deep Blue beat the best human. For a while after that, a good human paired with a good computer could beat either one alone. But a few years ago, that changed again, and now the best computer simply wins. There will be an intermediate period for many applications where the human-AI combination is optimal, but eventually, for fact-based tasks, the best AI will likely surpass both. The enduring role for humans lies in making judgments, especially when values come into conflict. What is the proper immigration policy? There is no single &#8220;right&#8221; answer; it&#8217;s a matter of feelings, values, and what we as a society hold dear. A lot of societal governance is about resolving conflicts between people&#8217;s rights&#8212;my right to play my music versus your right to have quiet. There&#8217;s no factual answer there. We can imagine machines will help; perhaps once we humans figure out the rules, the machines can do the implementing and kick the hard cases back to us. But the fundamental value judgments will likely remain our domain. This essay originally appeared in IVY.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}