{
  "id": "security-affairs-securityaffairs-co-2025-11-14-d23a8e74",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184628",
  "title": "Millions of sites at risk from Imunify360 critical flaw exploit",
  "url": "https://securityaffairs.com/184628/security/millions-of-sites-at-risk-from-imunify360-critical-flaw-exploit.html",
  "published_at": "2025-11-14T14:58:49+00:00",
  "fetched_at": "2025-11-15T11:17:54.912747+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A vulnerability affecting Imunify360 lets attackers run code via malicious file uploads, risking millions of websites. A vulnerability in ImunifyAV/Imunify360 allows attackers to upload malicious files to shared servers and execute arbitrary code, potentially exposing millions of websites, cybersecurity firm Patchstack warns. The flaw in Imunify360 AV before v32.7.4.0 lets attacker‑supplied malware trigger dangerous PHP calls, enabling remote code execution and full server compromise. &#8220;Recently a remote code execution via malware execution vector was discovered in the imunify360AV (AI-bolit) version prior to v32.7.4.0. The vulnerability stems from the deobfuscation logic executing untrusted functions and payloads extracted from attacker supplied malware.&#8221; reads the report published by Patchstack. &#8220;An attacker-controlled payload can cause the deobfuscator to call dangerous PHP functions (for example system, exec, shell_exec, passthru, eval, etc.), resulting in arbitrary command execution and full compromise of the hosting environment.&#8221; Imunify360 is an all-in-one server security platform developed by CloudLinux. It focuses on protecting shared, VPS, and dedicated hosting servers by combining multiple defensive layers. The cybersecurity solution currently protects over 56 million websites. Remote attackers can craft obfuscated PHP that mimics Imunify360AV (AI-Bolit) deobfuscation patterns, causing the scanner to execute attacker‑controlled functions and system commands. &#8220;The exploit requires the imunify360AV scanner to perform active deobfuscation during analysis. In practice this means running the scanner with the -y / &#8211;deobfuscate option enabled. Example invocation used during triage&#8221; states the report. This enables arbitrary code execution, leading to website compromise or full server takeover, especially since the scanner often runs as a root‑privileged service. &#8220;Remote attackers can embed specifically crafted obfuscated PHP that matches imunify360AV (AI-bolit) deobfuscation signatures.&#8221; continues the report. &#8220;The deobfuscator will execute extracted functions on attacker-controlled data, allowing execution of arbitrary system commands or arbitrary PHP code. Impact ranges from website compromise to full server takeover depending on hosting configuration and privileges.&#8221; The researchers warn that detection is difficult because payloads use layered obfuscation formats. In shared hosting, exploitation may allow privilege escalation and potentially full host control. The bad news is there has been no statement released about the flaw by Imunify360, and no CVE has yet been assigned. Patchstack researchers pointed out that the issue has been publicly available on CloudLinux&#8217;s Zendesk since November 4, 2025. &#8220;A critical security vulnerability has been identified in the AI-Bolit before v32.7.4.0.&#8221; reads the advisory. The flaw impacts the following solutions: Imunify360 ImunifyAV+ ImunifyAV According to the advisory, CloudLinux fixed the vulnerability on October 21, 2025. It&#8217;s unclear whether the vulnerability has been actively exploited in the wild. Patchstack released technical details and a PoC exploit, recommending hosting providers to check for potential compromises. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Imunify360)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}