{
  "id": "security-affairs-securityaffairs-co-2025-11-14-63f9a60c",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184615",
  "title": "Critical FortiWeb flaw under attack, allowing complete compromise",
  "url": "https://securityaffairs.com/184615/hacking/critical-fortiweb-flaw-under-attack-allowing-complete-compromise.html",
  "published_at": "2025-11-14T12:41:05+00:00",
  "fetched_at": "2025-11-15T11:17:54.913025+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A Fortinet FortiWeb auth-bypass flaw is being actively exploited, allowing attackers to hijack admin accounts and fully compromise devices. Researchers warn of an authentication bypass flaw in Fortinet FortiWeb WAF that allows full device takeover. The cybersecurity vendor addressed the vulnerability with the release version 8.0.2. A security flaw lets anyone break into FortiWeb devices and get full admin control. The issue was publicly disclosed after Defused shared a PoC on October 6, 2025, following real attack attempts captured by its honeypot. Unknown Fortinet exploit (possibly a CVE-2022-40684 variant) from 64.95.13.8 ( BLNWX ) VirusTotal Detections: 0/95 JWT payload translates into:{ &quot;username&quot;: &quot;admin&quot;, &quot;profname&quot;: &quot;prof_admin&quot;, &quot;vdom&quot;: &quot;root&quot;, &quot;loginname&quot;: &quot;admin&quot;} pic.twitter.com/IdTcdxBuBf&mdash; Defused (@DefusedCyber) October 6, 2025 watchTowr Labs confirmed the FortiWeb exploit and published the video PoC on X. The team also released a tool, the “FortiWeb Authentication Bypass Artifact Generator,” which tries to exploit the flaw by creating an admin account with a random 8-character username. another exploited in-the-wild FortiWeb vuln? It must be Thursday! pic.twitter.com/F9TQgdJQ4l&mdash; watchTowr (@watchtowrcyber) November 13, 2025 Defused and researcher Daniel Card report that attackers are exploiting the flaw by sending a crafted HTTP POST request to “/api/v2.0/cmdb/system/admin%3F/../../../../../cgi-bin/fwbcgi” to create a new admin account. &#8220;So this is already public and already being sprayed over the internet, there’s always a concern here when we think about how much intel to share/publish etc. So I’m not going to write the full details but I will give enough to help with detection logic (someone else is free to do more, that’s their own choice!)&#8221; Card explained. The TA appears to send a payload to the following URL Endpoint via an HTTP POST request /api/v2.0/cmdb/system/admin%3F/../../../../../cgi-bin/fwbcgi Inside this is a payload to create a user account.&#8221; Card extracted the following credentials from the payloads: UsernamePasswordTestpointAFodIUU3Sszp5trader13eMIXX43trader3eMIXX43test1234pointAFT3$tH4ckTestpointAFT3$tH4ckTestpointAFT3$tH4ckmet0d4yaga!n At this time, is unclear who is behind the exploitation attempts. On November 6, 2025, Rapid7 Labs researchers noted the sale of an alleged zero-day exploit targeting FortiWeb on a popular black hat forum. However, it is unclear if it is the same exploit as the one described by the researchers. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, FortiWeb)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}