{
  "id": "tenable-blog-tenable-com-2025-11-14-165329f5",
  "source_id": "tenable-blog-tenable-com",
  "guid": "https://www.tenable.com/210523",
  "title": "CVE-2025-64446: Fortinet FortiWeb Zero-Day Path Traversal Vulnerability Exploited in the Wild",
  "url": "https://www.tenable.com/blog/cve-2025-64446-fortinet-fortiweb-zero-day-path-traversal-vulnerability-exploited-in-the-wild",
  "published_at": "2025-11-14T17:45:55+00:00",
  "fetched_at": "2025-11-15T11:16:46.261198+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Fortinet has released an advisory for a recently disclosed zero-day path traversal vulnerability which has been exploited in the wild. Organizations are urged to patch immediately.BackgroundOn October 6, Defused published an X post regarding an unknown exploit targeting Fortinet devices. Shortly after, several cyber security organizations began investigating and confirming that a new exploit appeared to have silently been fixed in some releases of Fortinet’s FortiWeb. This includes researchers at WatchTowr who were able to reproduce the vulnerability. Within hours of their publication, Fortinet released a security advisory acknowledging that CVE-2025-64446 has been exploited in the wild.CVEDescriptionCVSSv3CVE-2025-64446Fortinet FortiWeb Path Traversal Vulnerability9.1AnalysisCVE-2025-64446 is a relative path traversal vulnerability affecting Fortinet’s FortiWeb. An unauthenticated attacker could exploit this vulnerability to execute arbitrary commands on an affected device. According to the advisory and several reports released prior to the publication of the security advisory, this vulnerability has been exploited in the wild.Security advisory released days after exploitationWhile it’s not clear when exploitation was first observed, researchers at Defused were the first to raise the alarm about the unknown exploit targeting Fortinet devices.&nbsp;⚠️Unknown Fortinet exploit (possibly a CVE-2022-40684 variant) from 64.95.13.8 🇺🇸 ( BLNWX )&nbsp;VirusTotal Detections: 0/95 🟢&nbsp;JWT payload translates into:{\"username\": \"admin\",\"profname\": \"prof_admin\",\"vdom\": \"root\",\"loginname\": \"admin\"} pic.twitter.com/IdTcdxBuBf— Defused (@DefusedCyber) October 6, 2025&nbsp;On November 13, WatchTowr posted on X proof that they had reproduced the exploit and followed up the following day with a blog and the release of an artifact generator on GitHub.&nbsp;another exploited in-the-wild FortiWeb vuln? It must be Thursday! pic.twitter.com/F9TQgdJQ4l— watchTowr (@watchtowrcyber) November 13, 2025&nbsp;Prior to the publication of the security advisory (FG-IR-25-910) from Fortinet, several research groups began testing the exploit to determine which versions were affected and which were patched. Although several new releases appeared to contain a fix based on testing of the exploit, confirmed patch information was not available until Fortinet published their security advisory.Historical Exploitation of Fortinet DevicesFortinet vulnerabilities have historically been common targets for cyber attackers, and CVE-2025-64446 is the twenty-first Fortinet vulnerability to be added to the Cybersecurity and Infrastructure Security Agency’s (CISA) Known Exploited Vulnerabilities (KEV) list. The Research Special Operations Team has written blogs about several of these vulnerabilities as shown in the table below:CVEDescriptionPatchedTenable BlogCVE-2025-25256Fortinet FortiSIEM Command Injection VulnerabilityAugust 2025CVE-2025-25256: Proof of Concept Released for Critical Fortinet FortiSIEM Command Injection VulnerabilityCVE-2025-32756Fortinet FortiVoice, FortiMail, FortiNDR, FortiRecorder and FortiCamera Arbitrary Code Execution VulnerabilityMay 2025CVE-2025-32756: Zero-Day Vulnerability in Multiple Fortinet Products Exploited in the WildCVE-2024-55591Fortinet Authentication Bypass in FortiOS and FortiProxyJanuary 2025CVE-2024-55591: Fortinet Authentication Bypass Zero-Day Vulnerability Exploited in the WildCVE-2024-21762Fortinet FortiOS Out-of-bound Write Vulnerability in sslvpndFebruary 2024CVE-2024-21762: Critical Fortinet FortiOS Out-of-Bound Write SSL VPN VulnerabilityCVE-2023-27997FortiOS and FortiProxy Heap-Based Buffer Overflow VulnerabilityJune 2023CVE-2023-27997: Heap-Based Buffer Overflow in Fortinet FortiOS and FortiProxy SSL-VPN (XORtigate)CVE-2022-42475FortiOS and FortiProxy Heap-Based Buffer Overflow VulnerabilityDecember 2022CVE-2022-42475: Fortinet Patches Zero Day in FortiOS SSL VPNsAA23-250A: Multiple Nation-State Threat Actors Exploit CVE-2022-47966 and CVE-2022-42475CVE-2022-40684FortiOS and FortiProxy Authentication Bypass VulnerabilityOctober 2022CVE-2022-40684: Critical Authentication Bypass in FortiOS and FortiProxyProof of conceptAt the time this blog was published on November 14, several public exploits had been released. In addition, active exploitation of this vulnerability has been observed. The combination of public exploits and known exploitation means that this vulnerability should be mitigated as soon as possible.SolutionFortinet has released patches for the following FortiWeb versions:Affected VersionFixed Version7.0.0 through 7.0.117.0.12 or above7.2.0 through 7.2.117.2.12 or above7.4.0 through 7.4.97.4.10 or above7.6.0 through 7.6.47.6.5 or above8.0.0 through 8.0.18.0.2 or aboveIn addition, Fortinet provides the workaround of disabling HTTP or HTTPS on any public (internet) facing devices in order to reduce risk. While patching is still recommended, this mitigation can be used to reduce risk until patching can be completed. According to Fortinet, access to the management interface via HTTP/HTTPS should be restricted to only be accessed internally and not be publicly exposed.Identifying affected systemsA list of Tenable plugins for this vulnerability can be found on the individual CVE page for CVE-2025-64446 as they’re released. This link will display all available plugins for this vulnerability, including upcoming plugins in our Plugins Pipeline. Tenable Web App Scanning plugin ID 115040 will also be available soon.Additionally, customers can utilize Tenable Attack Surface Management to identify public facing Fortinet devices by using the following subscription:&nbsp;Get more informationFortinet security advisory FG-IR-25-910WatchTowr blog: When The Impersonation Function Gets Used To Impersonate Users (Fortinet FortiWeb (??) Auth. Bypass)Join Tenable's Research Special Operations (RSO) Team on Tenable Connect and engage with us in the Threat Roundtable group for further discussions on the latest cyber threats.Learn more about Tenable One, the Exposure Management Platform for the modern attack surface.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}