{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-09-35774d49",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42291",
  "title": "Google revela cómo los ciberdelincuentes usan la IA y comparte previsiones para 2026",
  "url": "https://cybersecuritynews.es/google-revela-como-los-ciberdelincuentes-usan-la-ia-y-comparte-previsiones-para-2026/",
  "published_at": "2025-11-09T22:00:00+00:00",
  "fetched_at": "2025-11-10T11:18:57.893035+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Google Threat Intelligence Group (GTIG)[1] ha publicado un nuevo informe sobre cómo los ciberdelincuentes atacan las plataformas de IA, y las medidas que se toman para mitigar unos ataques que están en constante evolución. Un análisis que le ha llevado a identificar un cambio de tendencia en el último año: los ciberdelincuentes ya no utilizan la IA únicamente para aumentar su productividad; ahora también emplean en sus operaciones nuevo malware con IA integrada. Este hallazgo marca una nueva fase dentro del mal uso de la IA, con herramientas capaces de modificar su comportamiento de forma dinámica mientras se ejecutan. Este informe supone un complemento a su análisis de enero de 2025, Adversarial Misuse of Generative AI, y detalla el modo en que los agentes de amenazas que actúan respaldados por gobiernos y otros ciberdelincuentes están integrando IA y experimentando con ella en distintos sectores, y a lo largo de todo el ciclo de vida de los ataques. Por ejemplo, actores procedentes de China, Corea del Norte, Rusia e Irán están intentando utilizar la IA para todo, desde la ejecución de malware, las indicaciones de ingeniería social y la venta de herramientas de IA, hasta la mejora de todas las etapas de sus operaciones. Los hallazgos de Google se refieren al panorama de amenazas en general. Google ha asumido el compromiso de desarrollar la IA de forma responsable y toma medidas preventivas para impedir la actividad maliciosa. Cancela cuentas y proyectos asociados a agentes maliciosos, y somete sus modelos a una mejora continua, con el fin de que sea más difícil utilizarlos de forma indebida. Igualmente, divulga activamente las mejores prácticas del sector para dar herramientas a los equipos de seguridad y para promover protecciones más sólidas en todo el ecosistema. Este informe también repasa las medidas que Google ha tomado para dificultar las actividades maliciosas, que van desde la desactivación de recursos hasta el uso de inteligencia para reforzar sus clasificadores y su modelo, de modo que en el futuro esté mejor protegido contra usos indebidos. Puedes consultar más información sobre las medidas de protección y defensa aplicadas a Gemini en el libro blanco Advancing Gemini’s Security Safeguards. Principales conclusiones del informe Primer uso de IA just in time en software malicioso: GTIG ha identificado por primera vez familias de malware, como PROMPTFLUX y PROMPTSTEAL, que utilizan grandes modelos de lenguaje (LLM) durante la ejecución. Estas herramientas son capaces de generar scripts maliciosos de forma dinámica, ofuscar su propio código para eludir la detección y hacer uso de modelos de IA para crear funciones maliciosas a demanda, en lugar de incluirlas en el código del malware. Esta tendencia, todavía incipiente, representa un paso significativo hacia un malware más autónomo y adaptable. “Ingeniería social» para eludir las salvaguardas: Para eludir las barreras de seguridad de la IA, los agentes de amenazas están utilizando en sus prompts argumentos que recuerdan a la ingeniería social. Así, por ejemplo, se han podido observar agentes que se hacen pasar por estudiantes que hacen ejercicios tipo “captura la bandera” o por investigadores en ciberseguridad. En ambos casos, tratan de persuadir a Gemini para que les facilite una información que, en otras circunstancias, estaría bloqueada, y que necesitan para desarrollar determinadas herramientas. El mercado de herramientas de IA dirigidas a ciberdelincuentes ha madurado: A lo largo de este año, el mercado negro de herramientas de IA ilícitas ha madurado. Google ha identificado una serie de ofertas de herramientas multifuncionales diseñadas para facilitar actividades de phishing, desarrollo de malware e investigación de vulnerabilidades. Estas herramientas reducen las barreras de entrada para los agentes menos sofisticados. Aumento continuado del ciclo de vida de los ataques: Los agentes que operan con respaldo de gobiernos como los de Corea del Norte, Irán y China siguen utilizando Gemini de forma indebida para mejorar todas las fases de sus operaciones, desde las actividades de reconocimiento o la creación de señuelos de phishing hasta el desarrollo de sistemas de comando y control y la exfiltración de datos. Los agentes de amenazas desarrollan nuevas capacidades de IA Por primera vez en 2025, GTIG ha identificado una familia de códigos que emplea capacidades de IA durante la ejecución para alterar el comportamiento del malware de forma dinámica. Algunos de estos nuevos desarrollos de técnicas de IA son todavía experimentales, pero constituyen un indicador precoz de la dirección hacia la que evolucionan las amenazas y de cómo se podría, potencialmente, integrar capacidades de IA en las futuras actividades de intrusión. Claramente, los agentes de amenazas van más allá del “vibe coding” y de los niveles de base que se observaron en 2024, cuando solo se empleaban herramientas de IA con fines de soporte técnico. Este tipo de actividades apenas están empezando a despuntar y es de esperar que se incrementen en el futuro. Billy Leonard, Tech Lead, Google Threat Intelligence Group, explica: «Aunque los adversarios están intentando utilizar las plataformas de IA convencionales, las barreras de seguridad han llevado a muchos a recurrir a modelos disponibles en el mercado negro. Estas herramientas no tienen restricciones y pueden ofrecer una ventaja significativa a los menos avanzados. Actualmente hay varias disponibles y esperamos que reduzcan la barrera de entrada para muchos delincuentes». Pronósticos de ciberseguridad para 2026 de Google Cloud Security Esta semana, Google Cloud Security también ha presentado sus ‘Pronósticos de ciberseguridad para 2026’, un estudio elaborado con el objetivo de ayudar a los equipos de seguridad a prepararse para una serie de amenazas y desafíos específicos a los que se enfrentarán en 2026. Las conclusiones se centran en tres áreas fundamentales: el uso de la inteligencia artificial por parte de adversarios y defensores, la ciberdelincuencia como la amenaza global más disruptiva, y las operaciones continuadas de los actores estatales para alcanzar sus objetivos estratégicos. Entre las principales previsiones, destacan: Se espera que el uso de la IA por parte de los actores maliciosos pase de ser una excepción a convertirse en la norma, lo que transformará notablemente el panorama de las amenazas cibernéticas al acelerar operaciones como la ingeniería social, las operaciones de información y el desarrollo de malware. En 2026, los adversarios dejarán atrás el simple phishing, basado en texto, para aprovechar al máximo la IA generativa multimodal (deepfakes de voz, texto y vídeo), con el fin de crear suplantaciones convincentes y sensibles al contexto de ejecutivos, empleados o socios de confianza. Esto acelerará el éxito del vishing (phishing de voz) y permitirá ataques hiperrealistas de compromiso del correo electrónico empresarial (BEC) a gran escala. El ransomware, el secuestro de datos y la extorsión multifacética combinados seguirán siendo la categoría de ciberdelincuencia más perjudicial desde el punto de vista financiero a nivel mundial, impulsada por grandes grupos especializados que explotan a proveedores externos y vulnerabilidades de Zero-Day en ataques en cascada de gran volumen. En 2026, también se espera que actores estatales como Rusia, Corea del Norte, China e Irán intensifiquen sus operaciones cibernéticas, con Rusia centrándose en objetivos estratégicos globales a largo plazo; Corea del Norte intensificando los ataques relacionados con las criptomonedas para obtener ingresos y ampliando las campañas de trabajadores de TI; China dando prioridad a las operaciones sigilosas y a gran escala; e Irán impulsado por la estabilidad del régimen y la influencia regional, lo que conducirá a un aumento del ciberespionaje y los ataques disruptivos. Tendencias en la región EMEA Europa debe prepararse para una escalada de la guerra híbrida, incluidos los ciberataques físicos dirigidos a infraestructuras críticas, así como las operaciones de información y el espionaje. En paralelo, los marcos normativos en materia de inteligencia artificial y ciberseguridad en toda la región EMEA pasarán a aplicarse de forma activa, exigiendo a las organizaciones el cumplimiento de los requisitos normativos. Para navegar por este entorno complejo y en rápida evolución, las organizaciones deben dar prioridad a las estrategias de defensa proactivas y multicapa, invertir en la gobernanza de la IA y adaptar continuamente sus posturas de seguridad para protegerse contra las amenazas emergentes y garantizar la resiliencia operativa. [1] Google Threat Intelligence Group reúne a los equipos de Mandiant Intelligence y Threat Analysis Group (TAG), y se centra en identificar, analizar, mitigar y eliminar tipologías enteras de ciberamenazas contra Alphabet, sus usuarios y sus clientes. Su trabajo incluye contrarrestar amenazas de atacantes respaldados por el gobierno, ataques dirigidos de Zero-Day, operaciones de información coordinadas y redes graves de ciberdelincuencia. Google Threat Intelligence Group aplica su inteligencia para mejorar las defensas de Google y proteger a sus usuarios y clientes. La entrada Google revela cómo los ciberdelincuentes usan la IA y comparte previsiones para 2026 se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}