{
  "id": "security-affairs-securityaffairs-co-2025-11-09-f4645a80",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184362",
  "title": "Security Affairs newsletter Round 549 by Pierluigi Paganini – INTERNATIONAL EDITION",
  "url": "https://securityaffairs.com/184362/breaking-news/security-affairs-newsletter-round-549-by-pierluigi-paganini-international-edition.html",
  "published_at": "2025-11-09T09:46:59+00:00",
  "fetched_at": "2025-11-09T11:18:05.215829+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A new round of the weekly Security Affairs newsletter has arrived! Every week, the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. China-linked hackers target U.S. non-profit in long-term espionage campaignA new Italian citizen was targeted with Paragon’s Graphite spyware. We have a serious problemLANDFALL spyware exploited Samsung zero-day CVE-2025-21042 in Middle East attacksCisco fixes critical UCCX flaw allowing Root command executionRussia-linked APT InedibleOchotense impersonates ESET to deploy backdoor on Ukrainian systemsClop Ransomware group claims the breach of The Washington PostCisco became aware of a new attack variant against Secure Firewall ASA and FTD devicesGoogle sounds alarm on self-modifying AI malwareAlleged Russia-linked Curly COMrades exploit Windows Hyper-V to evade EDRsSonicWall blames state-sponsored hackers for September security breachU.S. sanctioned North Korea bankers for laundering funds linked to cyberattacks and peapons programFormer cybersecurity employees attempted to extort five U.S. companies in 2023 using BlackCat ransomware attacksU.S. CISA adds Gladinet CentreStack, and CWP Control Web Panel flaws to its Known Exploited Vulnerabilities catalogNine arrested in €600M crypto laundering bust across EuropeGoogle fixed a critical remote code execution in AndroidSesameOp: New backdoor exploits OpenAI API for covert C2Google Big Sleep found five vulnerabilities in SafariCrooks exploit RMM software to hijack trucking firms and steal cargoJabber Zeus developer ‘MrICQ’ extradited to US from ItalyChrome 142 Released: Two high-severity V8 flaws fixed, $100K in rewards paidAndroid Apps misusing NFC and HCE to steal payment data on the riseConduent January 2025 breach impacts 10M+ people International Press – Newsletter Cybercrime Remote access, real cargo: cybercriminals targeting trucking and logistics Alleged Jabber Zeus Coder ‘MrICQ’ in U.S. Custody Decisive actions against cryptocurrency scammers earning over EUR 600 million&nbsp;&nbsp; Lawmakers say stolen police logins are exposing Flock surveillance cameras to hackers Scattered LAPSUS$ Hunters: Anatomy of a Federated Cybercriminal Brand&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; Chicago firm that resolves ransomware attacks had rogue workers carrying out their own hacks, FBI says INSIDE LOCKBIT 5.0: AN EXCLUSIVE INTERVIEW WITH THE NEW INSTANCE OF THE WORLD&#8217;S MOST INFAMOUS RANSOMWARE BRAND&nbsp;&nbsp; &nbsp; How a ransomware gang encrypted Nevada government&#8217;s systems&nbsp;&nbsp; Malware SesameOp: Novel backdoor uses OpenAI Assistants API for command and control&nbsp;&nbsp; Weaponized Military Documents Deliver Advanced SSH-Tor Backdoor to Defense Sector&nbsp;&nbsp; Gootloader Returns: What Goodies Did They Bring? LANDFALL: New Commercial-Grade Android Spyware in Exploit Chain Targeting Samsung Devices Hacking Exploiting Trust in Collaboration: Microsoft Teams Vulnerabilities Uncovered HackedGPT: Novel AI Vulnerabilities Open the Door for Private Data Leakage Cisco Event Response: Continued Attacks Against Cisco Firewalls LLM-goat&nbsp;&nbsp; The most advanced ClickFix yet?&nbsp; Intelligence and Information Warfare DPRK’s Playbook: Kimsuky’s HttpTroy and Lazarus’s New BLINDINGCAN Variant&nbsp;&nbsp; Disrupting Illicit DPRK Bankers and Institutions Laundering Cybercrime and IT Worker Funds Preparing for Threats to Come: Cybersecurity Forecast 2026 Sonicwall: Cloud Backup Security Incident Investigation Complete and Strengthened Cyber Resilience&nbsp; &nbsp;&nbsp;&nbsp; Curly COMrades: Evasion and Persistence via Hidden Hyper-V Virtual Machines&nbsp;&nbsp; ESET APT Activity Report Q2 2025–Q3 2025&nbsp;&nbsp; Italian communications executive reveals he was targeted with Paragon spyware&nbsp; China-linked Actors Maintain Focus on Organizations Influencing U.S. Policy&nbsp; Russian Cybercrime &amp; State Militarization&nbsp;&nbsp; Cybersecurity Google Pays $100,000 in Rewards for Two Chrome Vulnerabilities&nbsp; Google&#8217;s AI &#8216;Big Sleep&#8217; Finds 5 New Vulnerabilities in Apple&#8217;s Safari WebKit Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, newsletter)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}