{
  "id": "bleeping-computer-2025-11-01-0c910329",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/microsoft/windows-11-build-262207051-released-with-ask-copilot-feature/",
  "title": "Windows 11 Build 26220.7051 released with “Ask Copilot” feature",
  "url": "https://www.bleepingcomputer.com/news/microsoft/windows-11-build-262207051-released-with-ask-copilot-feature/",
  "published_at": "2025-11-01T16:17:22+00:00",
  "fetched_at": "2025-11-02T11:10:18.435747Z",
  "status": "rejected",
  "content": {
    "raw": "Windows 11 Build 26220.7051 is now rolling out to testers in the Windows Insider Program, and there are at least three new features, including Ask Copilot in the taskbar. [...]",
    "full": "Windows 11 Build 26220.7051 is now rolling out to testers in the Insider Program, and there are at least three new features, including Ask Copilot on the taskbar.\nUp until now, you could access Copilot on Windows 11 via the app or browser, but now you can use a new taskbar-based 'Ask Copilot' to interact with the AI.\nMy understanding is that this new Copilot taskbar search experience will replace the existing Windows Search UI at some point.\nFor now, Ask Copilot will remain an optional feature that you need to opt into.\nYou can use Copilot on the taskbar to search the internet, local files and AI using text and voice.\n\"You’re always in control. As you type, results appear and update instantly, making it easier than ever to find what you need,\" Microsoft explained in a blog post.\nMicrosoft says it's hopeful Copilot will eventually become a natural way of using PC.\nTo turn on the feature, open Settings > Personalization > Taskbar > Ask Copilot.\nNew Xbox experience rolls out to everyone\nIf you own a handheld device, you can now try the new full-screen experience (FSE), which was previously exclusive to the ASUS ROG Xbox Ally and ROG Xbox Ally X.\nWith full-screen experience (FSE), Microsoft says Windows performs better and allows you to focus only on gaming.\nTo enable FSE, go to Settings > Gaming > Full screen experience, then select Xbox as your home app.\nOnce enabled, you can access FSE from Task View and Game Bar or configure your handheld to enter full screen experience on startup.\nShared audio support for Bluetooth\nMicrosoft is rolling out a new \"shared audio,\" which is built on top of Bluetooth LE Audio broadcast technology.\nWindows can now transmit an audio stream to two Bluetooth devices.\nYou can turn on the new “Shared audio (preview)” shortcut in quick settings to start sharing audio.\nLast but not least, ARM PCs now have better performance after this update.\nMicrosoft has enabled support for more 64-bit x86 (x64) applications to run under emulation by adding support for more CPU features under emulation. This leads to better performance.\nThese features will roll out to everyone in the coming weeks.\nIf you want to try them today, join the Beta or Dev Channel of Windows Insider Program.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-02T11:16:37.429928Z"
}