{
  "id": "bleeping-computer-2025-11-01-150bf35c",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/google/google-confirms-ai-search-will-have-ads-but-they-may-look-different/",
  "title": "Google confirms AI search will have ads, but they may look different",
  "url": "https://www.bleepingcomputer.com/news/google/google-confirms-ai-search-will-have-ads-but-they-may-look-different/",
  "published_at": "2025-11-01T16:56:00+00:00",
  "fetched_at": "2025-11-02T11:10:18.435520Z",
  "status": "rejected",
  "content": {
    "raw": "Google Ads are not going anywhere. Eventually, AI Search results on Google and likely other properties will have ads. [...]",
    "full": "Google Ads are not going anywhere. Eventually, AI Search results on Google and likely other properties will have ads.\nGoogle recently reported $56.57 billion in revenue from ads on Search and YouTube. You obviously can't expect ads to disappear from its search business.\nRight now, Google has two AI features.\nThe first is AI Overviews, which appears at the top of the search results with answers scraped from publishers that Google does not want to pay.\nThe second and more powerful feature is AI Mode, which offers a ChatGPT-like personalized experience.\nGoogle has already confirmed it plans to integrate services like Gmail and Drive into Google AI Mode to create a new personalized experience where AI knows everything about you.\nThat might sound scary, but it's clearly the direction Google is taking.\nGoogle says AI Search will have ads\nIn a podcast, Google's Robby Stein argued that the Google Ads business is not going anywhere, but it will evolve to support the new landscape.\nRobby Stein says Google does not see them [ads] going away, but the experience could change.\n\"...you could take a picture of your shoes and say, 'Hey, these are my shoes. What are other cool shoes like this?' And we could answer that now or help provide you context with that. Or you could ask about this really cool restaurant question. It can be five sentences about all your allergies, issues with this. I have this big group. I want to make sure it's got light. What can I book in advance? And you can put that into Google now too,\" Robby argues while explaining where ads could fit into the AI experience.\n\"I think that's an opportunity for the future to be even more helpful for you, particularly in an advertising context. And so we started some experiments on ads within AI Mode and within Google AI experiences,\" he added.\nAt this point, it looks like Google wants you to use AI Mode for personal questions, and based on those questions, it could show personalized ads.\nGoogle is already testing ads in AI Search in a limited form, and we'll likely learn more about its plans next year.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-02T11:16:37.429498Z"
}