{
  "id": "latest-news-zdnet-com-2025-11-01-bee5d4bc",
  "source_id": "latest-news-zdnet-com",
  "guid": "fc2bc5df-4ca2-4e0b-9420-2a4d614e4990",
  "title": "This AirPods hack is a game-changer for frequent flyers - how to find it in your iPhone settings",
  "url": "https://www.zdnet.com/article/this-airpods-hack-is-a-game-changer-for-frequent-flyers-how-to-find-it-in-your-iphone-settings/",
  "published_at": "2025-11-01T10:30:31+00:00",
  "fetched_at": "2025-11-01T11:14:21.660939Z",
  "status": "rejected",
  "content": {
    "raw": "Gone are the days of falling asleep and waking up to an entire missed season of your favorite show.",
    "full": "This AirPods hack is a game-changer for frequent flyers - how to find it in your iPhone settings\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Your AirPods can detect when you've fallen asleep and pause your media.\n- The AirPods likely use an accelerometer, not a heart rate sensor, to detect when you've fallen asleep.\n- The feature requires a pair of AirPods Pro 2, Pro 3, or AirPods 4, and iOS 26.\nIf you're like me, the one place you can fall asleep upright is on an airplane, but you need a pair of noise-canceling headphones to do so. Most of the time, I'll fall asleep during a \"Real Housewives\" scene and wake up two episodes later.\nAlso: Your Sony headphones just got a useful Bluetooth upgrade with the latest software patch\nThere's a feature in your iPhone's settings that can enable some AirPods to pause your audio content when they detect that you've fallen asleep. Here's how to turn it on, and how it worked when I tried it.\nWhat is AirPods sleep detection?\nIn the iOS 26 software update, Apple implemented a new sleep detection feature for AirPods. This feature is disabled by default, so you'll need to access your iPhone settings to enable it. If you do, put your AirPods Pro 2, Pro 3, or AirPods 4 in your ear and play media. Your AirPods can then detect when you fall asleep and respond by pausing the media.\nWhen your AirPods are connected to your iPhone, open your phone's settings, tap on your AirPods' settings, and scroll down to \"Pause Media When Falling Asleep.\"\nHow does it work?\nI've only tried the sleep detection feature with the AirPods Pro 3. Each time I wore my AirPods while flying, I connected them to my MacBook and played my TV show. The feature worked each time, as I woke up to a sleeping MacBook, but my show was paused a few minutes after I fell asleep.\nAlso: These QuietComfort Ultra headphones show Bose still does one thing better than Apple\nSince the AirPods 4 and AirPods Pro 2 lack in-ear heart rate monitoring and are not compatible with this feature, it's likely that the AirPods use their internal accelerometer, rather than your heart rate, to detect sleep. These accelerometers are the same sensors that are responsible for wear detection, the feature that pauses your media when you remove an earbud from one ear.\nApple Watch also uses its accelerometer to detect when you've fallen asleep, relying on a lack of movement to determine when you've fallen asleep.\nHowever, unlike the Apple Watch, the AirPods Pro 3 do not passively track your heart rate, so there's no heart rate data for sleep in your iPhone's Health app when you fall asleep wearing the AirPods Pro 3 without an Apple Watch. To track your heart rate with the Pro 3 earbuds, you must start a workout in the Fitness app.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:17:21.946000Z"
}