{
  "id": "latest-news-zdnet-com-2025-11-01-e8f499cd",
  "source_id": "latest-news-zdnet-com",
  "guid": "f313209f-cf9a-4d63-9c1a-2cf8214c8fe4",
  "title": "Two Apple devices you really shouldn't buy this month (and 9 that are safe for now)",
  "url": "https://www.zdnet.com/article/two-apple-devices-you-really-shouldnt-buy-this-month-and-9-that-are-safe-for-now/",
  "published_at": "2025-11-01T11:00:00+00:00",
  "fetched_at": "2025-11-01T11:14:21.660803Z",
  "status": "rejected",
  "content": {
    "raw": "Before you buy that shiny new Apple product, let's look at Apple's release plans. Plus, here's how you might be able to save money on the AirPods Pro 3.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nTwo Apple devices you really shouldn't buy this month (and 9 that are safe for now)\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- A new iPad Pro is in the pre-order stage with the launch on October 22.\n- MacBook Pro gets a refresh too, also with a October 22 launch.\n- The Vision Pro headset also gets a performance boost thanks to an M5 chip upgrade\nAlthough Apple's biggest update of the year is the iPhone, it wasn't Apple's last update of the year. The iPad Pro and MacBook Pro needed a refresh ahead of the holidays.\nThe iPad Pro gets a boost to the M5 chip, and it also features a few new Apple chips -- the N1 networking chip and the C1X modem chip for cellular models. Prices start at $999 for the 11-inch model and $1,299 for the 13-inch model, and both are avaialble for preorder, with the tablets hitting the shelves October 22.\nAlso: The best Apple deals right now: Save on MacBooks, iPhones, and more\nThere are also new and updated MacBook Pro laptops. A new 14-inch base model gets the M5 treatment, while higher-end 14- and 16-inch models stick with the M4 Pro and M4 Max chips. The 14-inch M5 model starts at $1,599 and is available for preorder now.\nAlso, the Vision Pro gets an M5 update (and a new \"dual-knit\" band). Prices still start at $3,499, so it remains to be seen how any of this will affect sales.\nWhile all that seems like a big update, there are plenty more Apple updates rumored for 2025 and early 2026. These could include a budget iPhone 17e, an updated Home Hub, a HomePod Mini 2, an Apple TV, a MacBook Air, and an updated AirTag.\nThat's a lot left to update.\nSo, what's safe to buy now, and what's best avoided?\nThe 'don't buy' list\nThese are the Apple devices I recommend giving a pass for now, as we'll likely see refreshed versions soon:\n- Apple TV: Last updated in October 2022, this device is due for a refresh. Rumors suggest a fourth-gen Apple TV 4K will be announced before the end of the year.\n- HomePod Mini: Released in October 2020, this is officially Apple's oldest product. While there's nothing technically wrong with the device, it's hard to recommend paying full price for such old hardware, and rumors of an imminent update are circulating.\nThe 'do buy' list\nThese Apple devices are worth buying now, since it'll be a while before we see significant hardware upgrades.\n1. iPhone 17 series\nThe iPhone 17 is now available, sporting a faster A19 and A19 Pro processor, a better camera, and better battery...\nAlso: Should you upgrade to an iPhone 17 Pro from last year's model? I am - here's why\nThe reviews almost write themselves by now. For those with too much money, Apple now offers the iPhone 17 Pro Max with 2TB of storage for a reassuring $1,999. There's also a new iPhone model, the ultra-thin (well, excluding the big camera bulge at the top) iPhone Air, which seems to replace the iPhone Plus line and attempts to unify Apple's buzzwords.\n2. Apple Watch Series 11, SE 3, and Ultra 3\nThe entire line of Apple Watches has been upgraded, focusing on health metrics, especially hypertension alerting (a feature that's also coming to older Apple Watches). Again, these are in the preorder state at the time of writing.\nAlso: I tried the Apple Watch Series 11, Watch Ultra 3, and SE - what the keynote didn't tell you\nThere's a new Apple Watch at every price point, from $249 for the SE 3 to $899 for the Ultra 3 with the neat titanium Milanese band.\n3. AirPods Pro 3\nThe AirPods Pro 3 get some big upgrades, including improved noise cancellation, better audio quality, increased battery life, and a new feature -- heart rate detection. This is an interesting shift for Apple since it moves some of the core functionality found in the Apple Watch to another device.\nAlso: I replaced my AirPods Max with the AirPods Pro 3 for flights, and it's been a game-changer\nAre you excited to get your hands on the new AirPods Pro 3? I am, too, but you could save a few bucks by waiting until the Black Friday deals roll by. Traditionally, this is a product that gets discounted.\nWho knows? You might save yourself $50.\n4. iPad, iPad Air, and iPad Pro\nThe iPad Air, kitted out with the M3 chip, received a refresh in March. Prices start at $599 for the 11-inch version and $799 for the 13-inch version. At the time, the iPad also got a performance boost thanks to the A16 chip. Prices for this tablet start at $350.\nUpdated M5-powered iPad Pro tablets are now also available for preorder, and prices start at $999 for the 11-inch model and $1,299 for the 13-inch model.\n5. MacBook Pro\nThe MacBook Pro line get a somewhat confusing refresh. A new 14-inch base model gets the M5 treatment, while higher-end 14- and 16-inch models stick with the M4 Pro and M4 Max chips. The 14-inch M5 model starts at $1,599 and is available for preorder now.\n6. Mac Studio\nApple's pro-grade alternative to the Mac mini also saw a serious processing boost in March 2025, with the M4 Max and M3 Ultra offered in a range of configurations. Prices start at $1,999 but can reach $14,099 for a fully tricked-out system.\n7. iMac\nThe M4 iMac received a refresh to bring it up to speed with Apple Intelligence in October 2024. With specs ranging from an eight-core CPU and GPU, 16GB of RAM, and 256GB of storage priced at $1,299, all the way up to a 10-core CPU and GPU, 24GB of RAM, and 512GB of storage for $1,899, there's an iMac to suit most workloads and budgets.\n8. Mac Mini\nApple's smallest Mac got an upgrade in October 2024 to the M4 and M4 Pro processors. It's also the cheapest Mac you can buy, as a Mac Mini with the 10-core CPU and GPU model, 16GB of RAM, and 256GB of storage costs only $599.\n9. iPad Mini\nThe 2024 iPad Mini was introduced in October 2024, replacing the three-year-old model with one powered by an A17 Pro chip that's Apple Intelligence-ready. The device comes in a range of colors -- blue, purple, starlight, and space gray -- and multiple storage capacities -- 128GB, 256GB, and 512GB. Prices range from $499 to $799.\nUpcoming Apple products to watch\n1. Apple TV\nIt's coming, we're just not sure when. The device is rumored to use Apple's new networking chip, adding support for Wi-Fi 6E, and will be powered by the A15 chip, opening the door to Apple Intelligence features.\n2. AirTag Update\nI'm a massive AirTag fan, and since Apple released them, the market has exploded with third-party offerings. While only Apple can offer precision finding, there are now smaller, thinner, and even rechargeable finder tags.\nAlso: Should you buy the iPhone 16 or iPhone 17? How to decide which model to buy\nThe new AirTags are expected to use a new Ultra Wideband chip, which is expected to improve range and accuracy. Apple is also allegedly making the speaker more difficult to disable, a countermeasure to prevent tags from being used to stalk people.\nGiven how easily AirTags can be modified and how they can even be purchased pre-modified, this update will be a welcome change.\nTariff costs and trade wars\nTariffs still dominate the news. One moment they're on; next they're off; then they're on again with a list of ifs, buts, and exceptions that may or may not stick around.\nCNET: As Inflation From Trump's Tariffs Looms Large, I'm Watching 11 Key Products for Inflation\nAccording to Apple's July 31 earnings call, tariffs have cost the company approximately $800 million for the last quarter, with this figure expected to rise to $1.1 billion for the current quarter.\nIs Apple shouldering that tariff burden? Maybe not.\nApple has added $100 to the price of the iPhone 17 lineup, but tried to make things more opaque by stirring up the storage capacities. But storage prices are cheap -- roughly, the industry average price is about $16 for 128GB, and around $35 for 256GB -- so that doesn't account for all of the price. Also, Apple has switched up the chassis from titanium to aluminum, and titanium is considerably more expensive than aluminum, around 2.5 to 3 times more per pound depending on the alloy -- so that's quite a saving for a company making millions of iPhones.\nSo, is Apple swallowing the tariff costs? I'd say no, the consumer is paying.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:17:02.525478Z"
}