{
  "id": "latest-news-zdnet-com-2025-11-01-007d40d8",
  "source_id": "latest-news-zdnet-com",
  "guid": "738ef8b6-f1b6-4416-86f1-4dfe9ca77259",
  "title": "This tank of a phone has a built-in projector, but that's not why you should care about it",
  "url": "https://www.zdnet.com/article/this-tank-of-a-phone-has-a-built-in-projector-but-thats-not-why-you-should-care-about-it/",
  "published_at": "2025-11-01T08:15:33+00:00",
  "fetched_at": "2025-11-01T11:14:21.661206Z",
  "status": "rejected",
  "content": {
    "raw": "Tank by name, tank by nature, this smartphone takes overkill to another level.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis tank of a phone has a built-in projector, but that's not why you should care about it\nUnihertz 8849 Tank 4 Pro\nZDNET's key takeaways\n- The 8849 Tank 4 Pro is available now for $759.\n- It's a big, beefy handset with a giant battery and a bright 6.73-inch display.\n- Its mid-range CPU is compensated for with lots of RAM.\nFollow ZDNET: Add us as a preferred source on Google.\nEven before the release of the iPhone, it was clear that the smartphone would become a convergence device that took over the function of a whole host of other ones, from the portable MP3 player to the in-car satnav.\nBut I never thought that I'd see a smartphone packing a projector. Yes, a projector, long with a bewildering array of other cool features. The only drawback -- this thing is a tank!\nAlso: I traveled with a power bank that doubles as a hotspot for a week - here's my buying advice\nThe Unihertz 8849 Tank 4 Pro -- the world's first rugged smartphone to pack a 720p DLP (Digital Light Processing) projector is a huge smartphone -- measuring 174.9 x 87 x 22.5 mm and weighs a massive 530 grams (that's over a pound). This is built for durability with high levels of shock proofing, and is water and dustproof to IP68 and IP69 standards.\nBest mobile deals of the week\n- $350 (save $50)\n- $525 (save $125)\n- $300 (save $100)\n- $338 (save $291)\nOn the front is a huge 6.73-inch 3K/1440 x 3200 resolution 20:9 aspect ratio AMOLED 120Hz display that delivers silky smooth graphics and is capable of dealing with bright sunlight thanks to its 1,800 nits of brightness.\nOn the inside is a 3.35GHz octa-core MediaTek Dimensity 8300 chip and a Mali-G615 MP6 GPU that's running the Android 14 out of the box (mine upgraded to Android 15 with no problems) operating system, a task that it does smoothly.\nThere are also a bewildering array of cameras. There's a 50-megapixel main rear camera, a 50-megapixel telephoto camera, a 64-megapixel night vision camera for peering into low-light, and a 32-megapixel front-facing camera for selfies and video calls.\nWhen it comes to RAM and storage, there are two options -- the modest 16GB RAM (plus 16GB memory extension) with 512GB storage, and the all-out 18GB RAM (with an additional 18GB memory extension) with 1TB of storage.\nNote that for the model I have for testing and review is the 18GB version.\nAlso: I found a discreet gadget to track my expensive jacket, and can't travel without it\nOn the back of the Tank 4 Pro is a huge 1,200 lumen LED COB camping light that's insanely bright (not to mention hot), and capable of lighting up a massive area.\nThe battery is appropriately huge for such a big smartphone. Inside is a 11,600mAh which is more than enough to say that it has all-day battery life. I ran some benchmark tests and got over a day of web browsing from a full charge.\nNormally, the downside of a big battery is that it takes ages to charge. Not with the Tank 4 Pro. This can charge at up to 120W, and I found that the supplied charger and cable could take this battery from flat to full in around an hour.\nAlso: Using this handy laser tape measure for only a few minutes had me hooked - here's why\nThere's also that 100 lumens, 1280 x 720 pixel projector with built-in laser autofocus and automatic trapezoidal distortion correction that allows you to transform the screen into a big screen. This is great for people who want to protect a movie onto a blank wall, or put their ideas onto a screen at a meeting.\nThe projector works well, and the autofocus is definitely an improvement compared to other smartphone projectors I've come across, but one downside is that 100 lumens isn't enough for the projector to win against bright sunshine.\nUltimately, the Tank 4 Pro is solid when it comes to specs. While the processor is pretty middle-of-the-road, the 36GB of combined physical and virtual RAM does a lot of heavy lifting to keep this device running. It's not going to win you any bragging power when it comes to benchmarks, but it's enough to keep it running smoothy.\nOh, and it also features a 3.5 mm headphone jack for those who still use old-school headphones.\nZDNET's buying advice\nThe Unihertz 8849 Tank 4 Pro is not a phone for everyone. It's a massive, ruggedized handset kitted out with night vision, a big camping light, and a projector -- a pretty niche wishlist item when it comes to what people want.\nHowever, I've heard from enough people to know that there's a market for this sort of handset. It's a popular choice for people who go camping and RVing, and I've heard from a number of outdoor engineers who find a projector a handy tool.\nAlso: Drawer full of USB cables? This gadget helped me find the ones that work\nThe Tank 4 Pro isn't cheap, the 18GB RAM/1TB ROM version is $770, while the 16GB RAM/512GB ROM version is $690. That said, there's a lot of tech packed into this one-pound brick of a smartphone.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:17:37.405331Z"
}