{
  "id": "latest-news-zdnet-com-2025-11-01-d4f5e04c",
  "source_id": "latest-news-zdnet-com",
  "guid": "9a44f036-fff2-4c05-bf2c-771a2e3e2b84",
  "title": "My Sonos Arc Ultra faced an unexpected challenger - and the soundbar met its match",
  "url": "https://www.zdnet.com/article/my-sonos-arc-ultra-faced-an-unexpected-challenger-and-the-soundbar-met-its-match/",
  "published_at": "2025-11-01T12:00:36+00:00",
  "fetched_at": "2025-11-02T11:14:12.681317Z",
  "status": "rejected",
  "content": {
    "raw": "I compared the Sonos Arc Ultra and Marshall Heston 120 - here's what makes each one shine, and which might be the better fit for you.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nMy Sonos Arc Ultra faced an unexpected challenger - and the soundbar met its match\nFollow ZDNET: Add us as a preferred source on Google.\nIf you have $1,000 to spend on a soundbar, there are compelling options to choose from. Since its late 2024 release, the Sonos Arc Ultra has been at the top of the heap in this price range, but there are new competitors that give Sonos a run for its money. The Marshall Heston 120, for example, offers a unique design, cool features, and comes at the exact same price as the Sonos Arc Ultra.\nAlso: 5 ways to instantly boost your soundbar audio quality (without spending a dime)\nWhile Sonos sticks to the design status quo with sleek, modern elements, Marshall challenges the norm with bold, distinct design language. Sonos offers options for the tech-savvy, digital ecosystem fan, while Marshall keeps its focus on providing a wide range of wired, analog choices for music enthusiasts.\nHowever, despite their striking differences, both soundbars deliver an exceptional audio experience. So, is one better than the other? I've extensively used both the Marshall Heston 120 and the Sonos Arc Ultra, outlining their pros and cons to help you make an informed decision.\nSpecifications\nMarshall Heston 120 | Sonos Arc Ultra | |\nDimensions | 43.3 x 5.7 x 3.0 inches | 46.4 x 4.4 x 3.0 inches |\nColors | Black | Black, Cream |\nChannels | 5.1.2 | 9.1.4 |\nDrivers | Two 2 x 5-inch subwoofers, two 3-inch mid-woofers, two 0.8-inch tweeters, five 2-inch full-range drivers | One woofer, six mid drivers, seven tweeters |\nPorts | HDMI 2.1 eARC, HDMI input, USB-C (power only), Ethernet, RCA L/R, sub out | HDMI eARC, Ethernet |\nWireless connectivity | Wi-Fi 6, Bluetooth 5.3 | Wi-Fi 6, Bluetooth 5.3 |\nWireless compatibility | AirPlay 2, Google Cast, Spotify Connect, Tidal Connect | AirPlay 2, Spotify Connect |\nExpandability | Wired subwoofer only | Sonos speakers, sonos subwoofers |\nPrice |\nYou should buy the Marshall Heston 120 if...\n1. You want a design that complements your furniture\nThe Sonos Arc Ultra is a sleek and stylish soundbar, but if you want a design that's cool, then the Marshall Heston 120 is the way to go. A great design is actually kind of important in a soundbar – it's something that's going to live out in the open, in your living room, for all to see. Sure, I care more about audio quality than design, but I want something that's going to make a statement without being over the top.\nAlso: Marshall's first soundbar rocks as a mainstream alternative - Here's my take\nThe Heston 120 walks that line perfectly. It leans on Marshall's signature aesthetic, with a great-looking faux leather on its sides, and a textile mesh covering on the front and top. It's adorned with the Marshall logo and knobs on the top for its controls. It looks awesome and unique without looking silly.\n2. You like physical controls\nPhysical controls probably aren't the most important controls for a soundbar, as you'll use your remote more. But if you like using physical controls when you're listening to music on your soundbar, then the Heston 120 is the way to go. It has knobs on the top, like its amplifiers, and they look and feel great. To be clear, the Sonos Arc Ultra has physical controls too, and they work perfectly fine. But they're not as satisfying to use as those on the Heston 120.\n3. You want lots of wireless features\nSonos is known for integrating with smart homes, and it does so well -- but it doesn't connect to as many audio ecosystems as the Marshall Heston 120. Both have Apple AirPlay 2 support and Spotify Connect support, so if you're in those ecosystems, you'll get what you need with both. However, the Heston 120 builds on that with additional services.\nWith the Heston 120, you'll get support for Google Cast, which helps if you're in the Google ecosystem. You'll also get Tidal Connect, so if you're a Tidal user, you'll be able to listen to music easily.\nYou should buy the Sonos Arc Ultra if...\n1. You want better spatial audio\nBoth soundbars offer excellent audio and can deliver deep and powerful bass with solid response in the high end. But the Sonos Arc Ultra definitely has the edge. Its audio response is a little more detailed, and its bass gets slightly deeper than Marshall's.\nIn addition to the slightly better frequency response, the Sonos Arc Ultra offers a more immersive audio experience. Both soundbars can deliver solid immersion, utilizing drivers that utilize reflections to simulate surround sound. However, Sonos has more experience with this type of smart audio technology, and it is evident in the Arc Ultra, which, on its own, can produce a relatively immersive experience when playing content that supports Dolby Atmos and surround sound.\n2. You want to expand your system\nMaybe you don't want to use your soundbar alone -- in which case, the Sonos Arc Ultra is easily the better choice. The Marshall Heston 120 supports wired subwoofers, and Marshall offers one in-house-made sub, but that's it.\nThe Sonos Arc Ultra can connect to other Sonos speakers wirelessly, and you have more options. There are two Sonos subwoofers you can choose from, along with a number of different speakers you could use as surround speakers -- like the Sonos Era 100 or Sonos Era 300. Sonos even sells bundles with these speakers, allowing you to get a full surround sound system right out of the box.\nAlso: Here's why Sonos' TV Audio Swap is my all-time favorite headphone feature\nThe Sonos Ace headphones have a private listening feature built for Sonos soundbars, further expanding the Sonos device ecosystem. I have used a Sonos Arc Ultra with two Sonos Era 300 speakers and a Sonos Sub 4 for some time, and I have to say, it's a pretty awesome setup.\n3. You have other Sonos speakers\nEven if you don't plan on directly connecting other Sonos speakers to your Sonos Arc Ultra, the ecosystem effect can still play a role if you have other Sonos speakers. Being able to manage all of your wireless speakers in one ecosystem makes it easier to stream audio across them, especially if you use the Sonos app to do so. It also means that you can connect them together down the line if you so choose.\nFor example, you could use two Sonos Era 100 speakers in different rooms but then link them together to form a stereo pair for more immersive audio. Alternatively, in the case of the Arc Ultra, you could relocate to a larger home and decide to utilize those speakers as surround speakers in your living room.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-02T11:16:56.034824Z"
}