{
  "id": "latest-news-zdnet-com-2025-11-01-ed82227d",
  "source_id": "latest-news-zdnet-com",
  "guid": "2c4ebf5a-fa89-4dde-8539-4aa8d57eb5ba",
  "title": "This premium Android phone is $150 off before Black Friday - act fast since this deal won't last",
  "url": "https://www.zdnet.com/article/this-premium-android-phone-is-150-off-before-black-friday-act-fast-since-this-deal-wont-last/",
  "published_at": "2025-11-01T09:00:29+00:00",
  "fetched_at": "2025-11-01T11:14:21.661079Z",
  "status": "rejected",
  "content": {
    "raw": "The OnePlus 13 boasts top-tier performance from its Snapdragon 8 Elite chipset. For a limited time, both storage models are on sale..",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis premium Android phone is $150 off before Black Friday - act fast since this deal won't last\nFollow ZDNET to learn more about smartphones: Add us as a preferred source on Google.\nBlack Friday is only a few weeks away, and we're already seeing great deals pop up out of the woodwork. Case in point: the OnePlus 13. For a limited time, you can buy the 256GB OnePlus 13 for $750 in Black Eclipse and the 512GB OnePlus 13 for $850 in either Black Eclipse or Midnight Ocean (blue).\nWith purchase, you'll also receive a free gift: a Wood Grain Magnetic Half-pack Case and your choice between an official OnePlus Pioneer baseball cap or a Power of Community silver duffel bag.\nAlso: The 10+ best early Black Friday phone deals to grab now\nThe OnePlus 13 is the company's most recent flagship smartphone, and it's a top-notch device -- earning ZDNET's coveted Editors' Choice Award for April 2025. We praised the model \"because it nails all the fundamentals of a great smartphone experience while leading the market in some regards,\" ZDNET's Kerry Wan wrote in his review.\nIt features the powerful Snapdragon 8 Elite chipset, a 6,000mAh Silicon NanoStack battery, 80W fast charging, and a high resistance rating of IP69. This means the phone is completely sealed against dust and can survive brief submersion underwater. At a glance, this seems excessive, but according to Wan, \"it's a benefit that users will appreciate when they least expect it\".\nPhotography is another area where the OnePlus 13 shines. Its triple-lens system captures bright, highly detailed images, although post-processing can create overly saturated pictures. I also can't forget to mention the stylish design, which flaunts a vegan leather backing that makes the phone visually striking and comfortable.\nHow I rated this deal\nAs per ZDNET's rating system, I give the deal a score of 2/5. $150 off the 256GB OnePlus 13 is a decent discount, but it's not the lowest it has ever been. I have seen better, and there's a chance that a lower price may appear during Black Friday. A steeper price drop is not a guarantee, so I recommend taking advantage of this deal while it lasts.\nWhen will this deal expire?\nAs per OnePlus, this deal ends on November 5.\nDeals are subject to sell out or expire at any time, though ZDNET remains committed to finding, sharing, and updating the best product deals for you to score the best savings. Our team of experts regularly checks in on the deals we share to ensure they are still live and obtainable. We're sorry if you've missed out on this deal, but don't fret -- we're constantly finding new chances to score savings and sharing them with you at ZDNET.com.\nHow do we rate deals at ZDNET?\nWe aim to deliver the most accurate advice to help you shop smarter. ZDNET offers 33 years of experience, 30 hands-on product reviewers, and 10,000 square feet of lab space to ensure we bring you the best of tech.\nIn 2025, we refined our approach to deals, developing a measurable system for sharing savings with readers like you. Our editor's deal rating badges are affixed to most of our deal content, making it easy to interpret our expertise to help you make the best purchase decision.\nAt the core of this approach is a percentage-off-based system to classify savings offered on top-tech products, combined with a sliding-scale system based on our team members' expertise and several factors like frequency, brand or product recognition, and more. The result? Hand-crafted deals are chosen specifically for ZDNET readers like you, fully backed by our experts.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:17:21.948792Z"
}