{
  "id": "bleeping-computer-2025-10-29-53b47ead",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-media-creation-tool-broken-on-some-windows-pcs/",
  "title": "Microsoft fixes Media Creation Tool broken on some Windows PCs",
  "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-media-creation-tool-broken-on-some-windows-pcs/",
  "published_at": "2025-10-29T17:41:28+00:00",
  "fetched_at": "2025-10-30T12:41:41.074918Z",
  "status": "rejected",
  "content": {
    "raw": "Microsoft has confirmed that the Windows 11 Media Creation Tool (MCT) is working again on Windows 10 22H2 and Windows 11 25H2 systems. [...]",
    "full": "Microsoft has confirmed that the Windows 11 Media Creation Tool (MCT) is working again on Windows 10 22H2 and Windows 11 25H2 systems.\nMCT is a free tool that helps download the latest version of Windows and create bootable installation media for system recovery, clean installs, or upgrading to a new device.\nAs Microsoft confirmed earlier this month, MCT stopped working on up-to-date on Windows 10 PCs and Windows 11 Arm64 PCs after installing the Windows 11 2025 Update.\nAffected users would see the media creation tool close unexpectedly, with no error message, while on Windows 11 25H2 devices, it would display the \"We're not sure what happened, but we're unable to run this tool on your PC\" error message.\nAs a workaround, the company advised users to download a Disk Image (ISO) for x64 devices directly from Microsoft and switch to an AMD64 Windows 11 PC to create Windows bootable installation media.\nMicrosoft has now fixed these issues with the KB5067036 October 2025 preview update released this Tuesday.\n\"This issue was resolved in KB5067036. The Windows 11 Media Creation Tool was updated on October 28, 2025, and is available for download,\" Microsoft said.\n\"As always, bootable media can also be downloaded directly at this site, under the section titled 'Download Windows 11 Disk Image (ISO) for x64 devices',\" it added in a Windows release health dashboard update.\nThe KB5067036 optional cumulative update that fixed MCT also rolled out an updated Start Menu and the Administrator Protection feature.\nIn the same update, Microsoft resolved a known issue that caused Windows updates to fail, leading to 0x800F081F errors on Windows 11 24H2 systems.\nMicrosoft also warned customers last week that Windows updates released since August 29, 2025, are breaking authentication on systems that share Security Identifiers (SIDs) due to newly added security protections that enforce SID checks.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-30T12:44:01.224824Z"
}