{
  "id": "krebs-on-security-2025-10-29-8562ef42",
  "source_id": "krebs-on-security",
  "guid": "https://krebsonsecurity.com/?p=72424",
  "title": "Aisuru Botnet Shifts from DDoS to Residential Proxies",
  "url": "https://krebsonsecurity.com/2025/10/aisuru-botnet-shifts-from-ddos-to-residential-proxies/",
  "published_at": "2025-10-29T00:51:05+00:00",
  "fetched_at": "2025-10-29T17:54:14.252821Z",
  "status": "processed",
  "content": {
    "raw": "Aisuru, the botnet responsible for a series of record-smashing distributed denial-of-service (DDoS) attacks this year, recently was overhauled to support a more low-key, lucrative and sustainable business: Renting hundreds of thousands of infected Internet of Things (IoT) devices to proxy services that help cybercriminals anonymize their traffic. Experts say a glut of proxies from Aisuru and other sources is fueling large-scale data harvesting efforts tied to various artificial intelligence (AI) projects, helping content scrapers evade detection by routing their traffic through residential connections that appear to be regular Internet users. First identified in August 2024, Aisuru has spread to at least 700,000 IoT systems, such as poorly secured Internet routers and security cameras. Aisuru&#8217;s overlords have used their massive botnet to clobber targets with headline-grabbing DDoS attacks, flooding targeted hosts with blasts of junk requests from all infected systems simultaneously. In June, Aisuru hit KrebsOnSecurity.com with a DDoS clocking at 6.3 terabits per second &#8212; the biggest attack that Google had ever mitigated at the time. In the weeks and months that followed, Aisuru&#8217;s operators demonstrated DDoS capabilities of nearly 30 terabits of data per second &#8212; well beyond the attack mitigation capabilities of most Internet destinations. These digital sieges have been particularly disruptive this year for U.S.-based Internet service providers (ISPs), in part because Aisuru recently succeeded in taking over a large number of IoT devices in the United States. And when Aisuru launches attacks, the volume of outgoing traffic from infected systems on these ISPs is often so high that it can disrupt or degrade Internet service for adjacent (non-botted) customers of the ISPs. &#8220;Multiple broadband access network operators have experienced significant operational impact due to outbound DDoS attacks in excess of 1.5Tb/sec launched from Aisuru botnet nodes residing on end-customer premises,&#8221; wrote Roland Dobbins, principal engineer at Netscout, in a recent executive summary on Aisuru. &#8220;Outbound/crossbound attack traffic exceeding 1Tb/sec from compromised customer premise equipment (CPE) devices has caused significant disruption to wireline and wireless broadband access networks. High-throughput attacks have caused chassis-based router line card failures.&#8221; The incessant attacks from Aisuru have caught the attention of federal authorities in the United States and Europe (many of Aisuru&#8217;s victims are customers of ISPs and hosting providers based in Europe). Quite recently, some of the world&#8217;s largest ISPs have started informally sharing block lists identifying the rapidly shifting locations of the servers that the attackers use to control the activities of the botnet. Experts say the Aisuru botmasters recently updated their malware so that compromised devices can more easily be rented to so-called &#8220;residential proxy&#8221; providers. These proxy services allow paying customers to route their Internet communications through someone else&#8217;s device, providing anonymity and the ability to appear as a regular Internet user in almost any major city worldwide. From a website’s perspective, the IP traffic of a residential proxy network user appears to originate from the rented residential IP address, not from the proxy service customer. Proxy services can be used in a legitimate manner for several business purposes — such as price comparisons or sales intelligence. But they are massively abused for hiding cybercrime activity (think advertising fraud, credential stuffing) because they can make it difficult to trace malicious traffic to its original source. And as we&#8217;ll see in a moment, this entire shadowy industry appears to be shifting its focus toward enabling aggressive content scraping activity that continuously feeds raw data into large language models (LLMs) built to support various AI projects. &#8216;INSANE&#8217; GROWTH Riley Kilmer is co-founder of spur.us, a service that tracks proxy networks. Kilmer said all of the top proxy services have grown exponentially over the past six months &#8212; with some adding between 10 to 200 times more proxies for rent. &#8220;I just checked, and in the last 90 days we&#8217;ve seen 250 million unique residential proxy IPs,&#8221; Kilmer said. &#8220;That is insane. That is so high of a number, it&#8217;s unheard of. These proxies are absolutely everywhere now.&#8221; To put Kilmer&#8217;s comments in perspective, here was Spur&#8217;s view of the Top 10 proxy networks by approximate install base, circa May 2025: AUPROXIES_PROXY 66,097 RAYOBYTE_PROXY 43,894 OXYLABS_PROXY 43,008 WEBSHARE_PROXY 39,800 IPROYAL_PROXY 32,723 PROXYCHEAP_PROXY 26,368 IPIDEA_PROXY 26,202 MYPRIVATEPROXY_PROXY 25,287 HYPE_PROXY 18,185 MASSIVE_PROXY 17,152 Today, Spur says it is tracking an unprecedented spike in available proxies across all providers, including; LUMINATI_PROXY 11,856,421 NETNUT_PROXY 10,982,458 ABCPROXY_PROXY 9,294,419 OXYLABS_PROXY 6,754,790 IPIDEA_PROXY 3,209,313 EARNFM_PROXY 2,659,913 NODEMAVEN_PROXY 2,627,851 INFATICA_PROXY 2,335,194 IPROYAL_PROXY 2,032,027 YILU_PROXY 1,549,155 Reached for comment about the apparent rapid growth in their proxy network, Oxylabs (#4 on Spur&#8217;s list) said while their proxy pool did grow recently, it did so at nowhere near the rate cited by Spur. &#8220;We don’t systematically track other providers’ figures, and we’re not aware of any instances of 10× or 100× growth, especially when it comes to a few bigger companies that are legitimate businesses,&#8221; the company said in a written statement. Bright Data was formerly known as Luminati Networks, the name that is currently at the top of Spur&#8217;s list of the biggest residential proxy networks, with more than 11 million proxies. Bright Data likewise told KrebsOnSecurity that Spur&#8217;s current estimates of its proxy network are dramatically overstated and inaccurate. &#8220;We did not actively initiate nor do we see any 10x or 100x expansion of our network, which leads me to believe that someone might be presenting these IPs as Bright Data&#8217;s in some way,&#8221; said Rony Shalit, Bright Data&#8217;s chief compliance and ethics officer. &#8220;In many cases in the past, due to us being the leading data collection proxy provider, IPs were falsely tagged as being part of our network, or while being used by other proxy providers for malicious activity.&#8221; &#8220;Our network is only sourced from verified IP providers and a robust opt-in only residential peers, which we work hard and in complete transparency to obtain,&#8221; Shalit continued. &#8220;Every DC, ISP or SDK partner is reviewed and approved, and every residential peer must actively opt in to be part of our network.&#8221; HK NETWORK Even Spur acknowledges that Luminati and Oxylabs are unlike most other proxy services on their top proxy providers list, in that these providers actually adhere to &#8220;know-your-customer&#8221; policies, such as requiring video calls with all customers, and strictly blocking customers from reselling access. Benjamin Brundage is founder of Synthient, a startup that helps companies detect proxy networks. Brundage said if there is increasing confusion around which proxy networks are the most worrisome, it&#8217;s because nearly all of these lesser-known proxy services have evolved into highly incestuous bandwidth resellers. What&#8217;s more, he said, some proxy providers do not appreciate being tracked and have been known to take aggressive steps to confuse systems that scan the Internet for residential proxy nodes. Brundage said most proxy services today have created their own software development kit or SDK that other app developers can bundle with their code to earn revenue. These SDKs quietly modify the user&#8217;s device so that some portion of their bandwidth can be used to forward traffic from proxy service customers. &#8220;Proxy providers have pools of constantly churning IP addresses,&#8221; he said. &#8220;These IP addresses are sourced through various means, such as bandwidth-sharing apps, botnets, Android SDKs, and more. These providers will often either directly approach resellers or offer a reseller program that allows users to resell bandwidth through their platform.&#8221; Many SDK providers say they require full consent before allowing their software to be installed on end-user devices. Still, those opt-in agreements and consent checkboxes may be little more than a formality for cybercriminals like the Aisuru botmasters, who can earn a commission each time one of their infected devices is forced to install some SDK that enables one or more of these proxy services. Depending on its structure, a single provider may operate hundreds of different proxy pools at a time &#8212; all maintained through other means, Brundage said. &#8220;Often, you&#8217;ll see resellers maintaining their own proxy pool in addition to an upstream provider,&#8221; he said. &#8220;It allows them to market a proxy pool to high-value clients and offer an unlimited bandwidth plan for cheap reduce their own costs.&#8221; Some proxy providers appear to be directly in league with botmasters. Brundage identified one proxy provider that was aggressively advertising cheap and plentiful bandwidth to content scraping companies. After scanning that provider&#8217;s pool of available proxies, Brundage said he found a one-to-one match with IP addresses he&#8217;d previously mapped to the Aisuru botnet. Brundage says that by almost any measurement, the world&#8217;s largest residential proxy service is IPidea, a China-based proxy network. IPidea is #5 on Spur&#8217;s Top 10, and Brundage said its brands include ABCProxy (#3), Roxlabs, LunaProxy, PIA S5 Proxy, PyProxy, 922Proxy, 360Proxy, IP2World, and Cherry Proxy. Spur&#8217;s Kilmer said they also track Yilu Proxy (#10) as IPidea. Brundage said all of these providers operate under a corporate umbrella known on the cybercrime forums as &#8220;HK Network.&#8221; &#8220;The way it works is there&#8217;s this whole reseller ecosystem, where IPidea will be incredibly aggressive and approach all these proxy providers with the offer, &#8216;Hey, if you guys buy bandwidth from us, we&#8217;ll give you these amazing reseller prices,'&#8221; Brundage explained. &#8220;But they&#8217;re also very aggressive in recruiting resellers for their apps.&#8221; A graphic depicting the relationship between proxy providers that Synthient found are white labeling IPidea proxies. Image: Synthient.com. Those apps include a range of low-cost and &#8220;free&#8221; virtual private networking (VPN) services that indeed allow users to enjoy a free VPN, but which also turn the user&#8217;s device into a traffic relay that can be rented to cybercriminals, or else parceled out to countless other proxy networks. &#8220;They have all this bandwidth to offload,&#8221; Brundage said of IPidea and its sister networks. &#8220;And they can do it through their own platforms, or they go get resellers to do it for them by advertising on sketchy hacker forums to reach more people.&#8221; One of IPidea&#8217;s core brands is 922S5Proxy, which is a not-so-subtle nod to the 911S5Proxy service that was hugely popular between 2015 and 2022. In July 2022, KrebsOnSecurity published a deep dive into 911S5Proxy&#8217;s origins and apparent owners in China. Less than a week later, 911S5Proxy announced it was closing down after the company&#8217;s servers were massively hacked. That 2022 story named Yunhe Wang from Beijing as the apparent owner and/or manager of the 911S5 proxy service. In May 2024, the U.S. Department of Justice arrested Mr Wang, alleging that his network was used to steal billions of dollars from financial institutions, credit card issuers, and federal lending programs. At the same time, the U.S. Treasury Department announced sanctions against Wang and two other Chinese nationals for operating 911S5Proxy. The website for 922Proxy. DATA SCRAPING FOR AI In recent months, multiple experts who track botnet and proxy activity have shared that a great deal of content scraping which ultimately benefits AI companies is now leveraging these proxy networks to further obfuscate their aggressive data-slurping activity. That&#8217;s because by routing it through residential IP addresses, content scraping firms can make their traffic far trickier to filter out. &#8220;It&#8217;s really difficult to block, because there&#8217;s a risk of blocking real people,&#8221; Spur&#8217;s Kilmer said of the LLM scraping activity that is fed through individual residential IP addresses, which are often shared by multiple customers at once. Kilmer says the AI industry has brought a veneer of legitimacy to residential proxy business, which has heretofore mostly been associated with sketchy affiliate money making programs, automated abuse, and unwanted Internet traffic. &#8220;Web crawling and scraping has always been a thing, but AI made it like a commodity, data that had to be collected,&#8221; Kilmer said. &#8220;Everybody wanted to monetize their own data pots, and how they monetize that is different across the board.&#8221; Kilmer said many LLM-related scrapers rely on residential proxies in cases where the content provider has restricted access to their platform in some way, such as forcing interaction through an app, or keeping all content behind a login page with multi-factor authentication. &#8220;Where the cost of data is out of reach &#8212; there is some exclusivity or reason they can&#8217;t access the data &#8212; they&#8217;ll turn to residential proxies so they look like a real person accessing that data,&#8221; Kilmer said of the content scraping efforts. Aggressive AI crawlers increasingly are overloading community-maintained infrastructure, causing what amounts to persistent DDoS attacks on vital public resources. A report earlier this year from LibreNews found some open-source projects now see as much as 97 percent of their traffic originating from AI company bots, dramatically increasing bandwidth costs, service instability, and burdening already stretched-thin maintainers. Cloudflare is now experimenting with tools that will allow content creators to charge a fee to AI crawlers to scrape their websites. The company&#8217;s &#8220;pay-per-crawl&#8221; feature is currently in a private beta, and it lets publishers set their own prices that bots must pay before scraping content. On October 22, the social media and news network Reddit sued Oxylabs (PDF) and several other proxy providers, alleging that their systems enabled the mass-scraping of Reddit user content even though Reddit had taken steps to block such activity. &#8220;Recognizing that Reddit denies scrapers like them access to its site, Defendants scrape the data from Google’s search results instead,&#8221; the lawsuit alleges. &#8220;They do so by masking their identities, hiding their locations, and disguising their web scrapers as regular people (among other techniques) to circumvent or bypass the security restrictions meant to stop them.&#8221; Denas Grybauskas, chief governance and strategy officer at Oxylabs, said the company was shocked and disappointed by the lawsuit. &#8220;Reddit has made no attempt to speak with us directly or communicate any potential concerns,&#8221; Grybauskas said in a written statement. &#8220;Oxylabs has always been and will continue to be a pioneer and an industry leader in public data collection, and it will not hesitate to defend itself against these allegations. Oxylabs’ position is that no company should claim ownership of public data that does not belong to them. It is possible that it is just an attempt to sell the same public data at an inflated price.&#8221; As big and powerful as Aisuru may be, it is hardly the only botnet that is contributing to the overall broad availability of residential proxies. For example, on June 5 the FBI’s Internet Crime Complaint Center warned that an IoT malware threat dubbed BADBOX 2.0 had compromised millions of smart-TV boxes, digital projectors, vehicle infotainment units, picture frames, and other IoT devices. In July, Google filed a lawsuit in New York federal court against the Badbox botnet&#8217;s alleged perpetrators. Google said the Badbox 2.0 botnet &#8220;compromised more than 10 million uncertified devices running Android&#8217;s open-source software, which lacks Google&#8217;s security protections. Cybercriminals infected these devices with pre-installed malware and exploited them to conduct large-scale ad fraud and other digital crimes.&#8221; A FAMILIAR DOMAIN NAME Brundage said the Aisuru botmasters have their own SDK, and for some reason part of its code tells many newly-infected systems to query the domain name fuckbriankrebs[.]com. This may be little more than an elaborate &#8220;screw you&#8221; to this site&#8217;s author: One of the botnet&#8217;s alleged partners goes by the handle &#8220;Forky,&#8221; and was identified in June by KrebsOnSecurity as a young man from Sao Paulo, Brazil. Brundage noted that only systems infected with Aisuru&#8217;s Android SDK will be forced to resolve the domain. Initially, there was some discussion about whether the domain might have some utility as a &#8220;kill switch&#8221; capable of disrupting the botnet&#8217;s operations, although Brundage and others interviewed for this story say that is unlikely. A tiny sample of the traffic after a DNS server was enabled on the newly registered domain fuckbriankrebs dot com. Each unique IP address requested its own unique subdomain. Image: Seralys. For one thing, they said, if the domain was somehow critical to the operation of the botnet, why was it still unregistered and actively for-sale? Why indeed, we asked. Happily, the domain name was deftly snatched up last week by Philippe Caturegli, &#8220;chief hacking officer&#8221; for the security intelligence company Seralys. Caturegli enabled a passive DNS server on that domain and within a few hours received more than 700,000 requests for unique subdomains on fuckbriankrebs[.]com. But even with that visibility into Aisuru, it is difficult to use this domain check-in feature to measure its true size, Brundage said. After all, he said, the systems that are phoning home to the domain are only a small portion of the overall botnet. &#8220;The bots are hardcoded to just spam lookups on the subdomains,&#8221; he said. &#8220;So anytime an infection occurs or it runs in the background, it will do one of those DNS queries.&#8221; Caturegli briefly configured all subdomains on fuckbriankrebs dot com to display this ASCII art image to visiting systems today. The domain fuckbriankrebs[.]com has a storied history. On its initial launch in 2009, it was used to spread malicious software by the Cutwail spam botnet. In 2011, the domain was involved in a notable DDoS against this website from a botnet powered by Russkill (a.k.a. &#8220;Dirt Jumper&#8221;). Domaintools.com finds that in 2015, fuckbriankrebs[.]com was registered to an email address attributed to David &#8220;Abdilo&#8221; Crees, a 27-year-old Australian man sentenced in May 2025 to time served for cybercrime convictions related to the Lizard Squad hacking group.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": 92,
    "relevance_score": 94,
    "threat_category": "Botnet / DDoS",
    "summary": "The Aisuru botnet, originally known for record‑breaking DDoS attacks, has pivoted to renting out infected IoT devices as residential proxies. The botnet now supplies a large pool of IP addresses that enable data‑harvesting and AI training operations while evading detection.",
    "key_entities": [
      "Aisuru",
      "IoT devices",
      "KrebsOnSecurity.com",
      "DDoS",
      "Residential proxies"
    ],
    "ttps": [
      "T1105 – Ingress Tool Transfer",
      "T1071 – Standard Application Layer Protocol",
      "T1070 – Indicator Removal on Host",
      "T1053 – Scheduled Task/Job",
      "T1078 – Valid Accounts"
    ]
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {
    "processed_at": "2025-10-29T18:01:51.640069+00:00Z",
    "llm_provider": "unknown",
    "processing_method": "json_processing"
  },
  "updated_at": "2025-10-29T18:01:51.640706Z"
}