{
  "id": "zdnet-security-2025-10-29-1f2eb444",
  "source_id": "zdnet-security",
  "guid": "70195a3d-855e-4406-b862-0f2b1b6e2ab8",
  "title": "How to use MacOS snapshots to rescue your system when disaster strikes",
  "url": "https://www.zdnet.com/article/how-to-use-macos-snapshots-to-rescue-your-system-when-disaster-strikes/",
  "published_at": "2025-10-29T12:58:32+00:00",
  "fetched_at": "2025-10-29T17:53:54.843898Z",
  "status": "rejected",
  "content": {
    "raw": "Your Mac has an automatic system restore feature in case of emergencies. You just need to set it up.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nHow to use MacOS snapshots to rescue your system when disaster strikes\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET key takeaways\n- At some point, your Mac might go haywire.\n- With system restore points, you can roll that system back.\n- MacOS has this feature built in, and it's very easy to use.\nYou might think that MacOS is unbreakable, but in that assumption, you would be wrong. Things happen, either by way of an upgrade gone awry or a misconfigured option in Settings.\nAlso: Should you upgrade to M5 MacBook Pro from an M1? How the numbers add up\nEither way, when things go south, you'll be thankful that you set up automatic snapshots.\nWhat are automatic snapshots?\nSnapshots are a saved point in time when your computer is working properly and can be used to restore your system. With a snapshot, you can roll back the clock on your computer so it undoes whatever bad thing has been done.\nAlso: 5 simple ways to regain your data privacy online - starting today\nKeep in mind that snapshots aren't data backups. Because of this, you should not only set up automated snapshots but also configure scheduled data backups. Having both available will ensure you don't miss a beat should your OS go full wacky on you.\nWith MacOS, you have a built-in tool for creating automatic snapshots: Time Machine. Let me show you how to use this helpful tool.\nHow to create an automatic snapshot in MacOS\nWhat you'll need: The only things you'll need for this are a MacOS device and an external hard drive. Snapshots should always be saved to an external drive (an SSD) so they are accessible.\n1. Plug in your external drive\nThe first thing to do is plug in the external drive you want to use to store the backups. Make sure there's plenty of room on the drive. I highly recommend using an SSD and not an old-school platter drive.\n2. Open Time Machine\nClick the Launcher icon in your dock and search for Time Machine.\nWhen you see the launcher, click it to open Time Machine. If this is the first time you've opened Time Machine, you'll be prompted to plug in your external drive (you've already taken care of this). You will then be prompted to click Set Up Time Machine. Go ahead and do that as well.\nAlso: I doubled my PC's storage with this thumb-sized accessory. Here's how it works\nThis action will open System Settings to General > Time Machine.\n3. Add your backup disk\nIn System Settings > General > Time Machine, click Add Backup Disk.\nWhen you do this, you'll be prompted to set up the disk, so click Set Up Disk. In the resulting window, you'll then be able to configure the disk. You might, like me, be warned that your disk isn't large enough (I'm using this disk for demonstration only, as I don't want to harm my production snapshot disk).\nAlso: Confused on which cloud storage to get? My expert advice (and 3 I recommend)\nBy default, disk encryption is enabled. I suggest you leave that enabled to avoid someone having access to your snapshots. Type and verify an encryption password (making sure you use one that is unique and strong). After that, click Done. You will then be prompted to OK the erasing of the disk.\nDepending on the size of the disk, this can take some time because it's not only erasing and formatting but also setting it up for snapshots.\n4. Let the backups begin\nTime Machine will automatically be set to back up every hour.\nAlso: How I saved myself $1200 a year in cloud storage - in 5 sobering steps\nAlong with those backups will be the system snapshots. If you're OK with an hourly backup, you're done. If you want to change the frequency, click Options and then select the frequency of your choice from the drop-down at the top.\nHow to restore your system from a snapshot\nIf something does go awry, here are the steps to restore from a saved snapshot.\n- Shut down your Mac.\n- For an Intel-based Mac, press the power button and hold Command + R until the Apple logo appears.\n- On Apple Silicon Macs, hold the power button until the startup options screen appears, then choose Options > Continue.\n- In Recovery Mode.\n- Choose Time Machine System Restore.\n- Click Restore from Time Machine Backup.\n- For the backup location, select the external drive housing your backups.\n- If required (which it should be), type your admin password.\n- Select a local snapshot from the list (one that is prior to things going wrong).\n- Read and ignore the warning.\n- Click Continue.\nAlso: 9 essential Mac apps I can't live without - and why\nAnd that's all there is to setting up automated snapshots on MacOS. Should something go awry, you can rest assured that you can restore your system using a system restore point created before things went wrong.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:00:55.515752Z"
}