{
  "id": "zdnet-security-2025-10-29-5f848011",
  "source_id": "zdnet-security",
  "guid": "749bdc1b-8663-4ae1-b2d4-773a8a38c783",
  "title": "I found a discrete gadget to track my expensive jacket, and can't travel without it",
  "url": "https://www.zdnet.com/article/i-found-a-discrete-gadget-to-track-my-expensive-jacket-and-cant-travel-without-it/",
  "published_at": "2025-10-29T14:00:00+00:00",
  "fetched_at": "2025-10-29T17:53:54.842426Z",
  "status": "rejected",
  "content": {
    "raw": "AirTags are great, but they're not designed to attach onto bags or coats. Fortunately, there's a solution.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI found a discrete gadget to track my expensive jacket, and can't travel without it\nElevation Lab TagVault fabric mounting tag\nZDNET's key takeaways\n- Elevation Lab's TagVault is $14.99 on Amazon, and comes in two- and four-packs.\n- The tag is a discrete solution to installing AirTags in backpacks, jackets, or other fabric articles, and is tough enough to withstand a lot of abuse.\n- Put some thought into where you apply it, since the adhesive is removable but not reusable.\nFollow ZDNET: Add us as a preferred source on Google.\nApple AirTags changed my life. Not only did they reduce my day to day stress levels when I misplace my keys or wallet, but they're a great tool for helping you keep and eye on -- and even find -- things when traveling. But, as I've said many times before, AirTags aren't really designed to be discrete. In fact, they're designed to stand out to prevent them being used for stalking.\nBut there are times when discretion is a good thing. For example, if I'm using AirTags to track my luggage or backpack or expensive Gore Tex jacket, I don't want it to be easy to find and remove. Elevation Lab has the answer with its new TagVault Fabric Extreme fabric mounts.\nAlso: Can you make an AirTag last 10 years? It took me a seconds to do it\nI'm a big fan of Elevation Lab gear. They make the adapter that uses AA batteries to power an AirTag for a decade, along with a variety of things to make attaching AirTags to other things easier. And the TagVault Fabric Extreme is as good as everything else the company makes.\nThe idea is simple -- it's a little capsule attached to a piece of adhesive fabric -- but it's incredibly effective. You unscrew the capsule (like you would a big contact lens case), pop in the AirTag, screw the capsule back together, then decide where you want to attach the TagVault.\nWhen you've figured that out, peel the backing off the adhesive and attach it. This is a one way trip, so if you want a tidy, crease-free finish, be a bit more careful that I was when attaching it to the item in question!\nAfter that, you're done! According to the instructions, the adhesive takes 24 hours to achieve full stickability, but I'm here to tell you that it sticks well immediately.\nAlso: I never travel without this AirTag accessory - and it's saved me hundreds of dollars\nI've spent a lot of time coming up with ways to conceal AirTags in my stuff, going as far as to custom 3D print attachments for my Peli Air cases. But this is a far more convenient way, and it's a lot easier for when it comes time to replace the battery in the AirTag because I don't have to dig the tag out of some crevice.\nI've got these attached to a variety of things, from backpacks and suitcases to my expensive Gore Tex jacket (I usually stick them to the inside of a pocket or hear the bottom of the jacket at the back). They're tough tags that aren't bothered by things bashing into them, and the adhesive is super strong and good for a variety of surfaces, such as nylon, polyester, vinyl, rubberized fabrics, and Gore-Tex (they are not recommended for leather, fibrous fabric, or anything stretchy, or anything that has to go through the washing machine).\nAnd the adhesive doesn't seem to be bothered by rain or moisture in the least.\nI'm in the final stages of planning a long distance hike in Spain later this year, and you can be sure that these are being used on all my valuables\nZDNET's buying advice\nThe Elevation Lab TagVault Fabric Extreme tags come in singles, 2-pack, and 4-pack priced at $14.99, $24.99, and $39.99, respectively. They're a great, low-cost insurance policy against loosing of your valuables, and a great way to make use of AirTags.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:00:14.963821Z"
}