{
  "id": "zdnet-security-2025-10-29-d5de1038",
  "source_id": "zdnet-security",
  "guid": "ed7b02fd-0763-4a8e-86ba-d3b25ce03bff",
  "title": "OpenAI and Microsoft finally have a new deal - and it's all about AGI",
  "url": "https://www.zdnet.com/article/openai-and-microsoft-finally-have-a-new-deal-and-its-all-about-agi/",
  "published_at": "2025-10-29T13:35:05+00:00",
  "fetched_at": "2025-10-29T17:53:54.843168Z",
  "status": "rejected",
  "content": {
    "raw": "Sam Altman outlined a loose roadmap for what's to come, including Microsoft's role and OpenAI's goals for achieving superintelligence.",
    "full": "OpenAI and Microsoft finally have a new deal - and it's all about AGI\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- OpenAI finalized its restructuring, prioritizing AI.\n- Its nonprofit arm is now called the OpenAI Foundation.\n- The Foundation committed $25 billion to philanthropy.\nOpenAI began as a nonprofit startup, but when rumors surfaced that it would switch to a for-profit company, the company received a lot of criticism. The result was a plan to split the company into two arms: a nonprofit and a for-profit arm, which was finalized today.\nAlso: Grammarly changes its name to Superhuman - and its mission to AI wrangler\nThe company announced the completion of its recapitalization via a blog post and accompanying livestream on Tuesday. The nonprofit, now known as the OpenAI Foundation, will retain control of the for-profit entity, holding equity valued at approximately $130 billion or 26% of the public benefit corporation (PBC) known as OpenAI Group. With those resources, OpenAI emphasizes wanting to pursue philanthropic goals.\n\"The more OpenAI succeeds as a company, the more the nonprofit's equity stake will be worth, which the nonprofit will use to fund its philanthropic work,\" said Bret Taylor, Chair of the OpenAI Board of Directors, in the blog.\nFollowing this announcement, the company held a livestream, in which OpenAI CEO Sam Altman and Chief Scientist Jakub Pachocki discussed the future roadmap of the company and added more color on the acquisition.\nRestructuring and Microsoft's role\nThese philanthropic commitments include $25 billion allocated to two areas: curing diseases and technical solutions for AI resilience, which the company refers to as its efforts to maximize the benefits of AI while minimizing its risks.\nMeanwhile, long-term partner Microsoft has increased its investment in the company, holding a stake in the OpenAI Group PBC valued at approximately $135 billion, which is equivalent to 27% of the company on an as-converted diluted basis. The key tenets of the partnership agreement remain unchanged, with OpenAI continuing as Microsoft's frontier model partner, and Microsoft retaining IP rights and Azure API exclusivity until OpenAI creates AGI, or human-level intelligence.\nAlso: Forget AGI - Meta is going after 'superintelligence' now\nThe companies added new provisions to the partnership. Some of the highlights are that OpenAI's declaration of AGI will have to be verified by an independent expert panel; Microsoft's IP rights to the models and products will be extended through 2032 and include models post-AGl; OpenAI can develop products with third parties (Microsoft can also pursue AGI alone and with third parties); and Microsoft's IP excludes consumer hardware.\nWhile the livestream did touch upon the restructuring, it mainly focused on highlighting that even though the business arm operates as a for-profit, it will maintain the company's mission, including building AI solutions to difficult problems. Altman and Pachocki placed a larger focus on the future direction of the company.\nA roadmap for the future\nAltman kicked off the livestream by highlighting the company's future mission: to ensure that artificial intelligence benefits all of humanity. With that, both Alman and Pachocki spent some time discussing goals for the company that could enable it to achieve its objectives, which included \"superintelligence\" and \"automating scientific discovery.\"\nAlso: What is Enterprise General Intelligence? How the next stage of AI affects you\nOpenAI mentioned that automating research is a key tenet of scientific discovery; Pachocki said AI could currently handle about 5-hour tasks. The diagram shown during the livestream indicated a point at which AI would be able to automate 5 years' worth of research. Although it may seem like that capability is far away, another timeline estimated that an Automated AI with capabilities equivalent to a research intern level will arrive by September 2026, and that Automated AI research will arrive by March 2028.\nThese ambitious estimates for the near-future capabilities of AI were perhaps the most notable aspect of the event. Another estimate suggested that AI could begin making small scientific discoveries by 2026 and medium discoveries by 2028, with Altman adding, \"Who knows what 2030 and 2032 are going to look like?\"\nWant more stories about AI? Sign up for AI Leaderboard, our weekly newsletter.\nOf course, with these ambitious goals come risks and concerns -- anticipating these, Pachocki addressed safety and alignment goals, which include value alignment, goal alignment, reliability, adversarial robustness, and systemic safety. Altman also discussed the company's foundational platform principles, which include user freedom and privacy. They also discussed OpenAI's increased need for energy and data centers as a result of these goals.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:00:29.911166Z"
}