{
  "id": "zdnet-security-2025-10-29-578b0918",
  "source_id": "zdnet-security",
  "guid": "41f98a66-1e8d-41f3-9c5c-3f41056f1a7c",
  "title": "Microsoft's revamped Windows 11 Start menu is rolling out - but I'll stick with my favorite alternative",
  "url": "https://www.zdnet.com/article/microsofts-revamped-windows-11-start-menu-is-rolling-out-but-ill-stick-with-my-favorite-alternative/",
  "published_at": "2025-10-29T13:39:21+00:00",
  "fetched_at": "2025-10-29T17:53:54.842928Z",
  "status": "rejected",
  "content": {
    "raw": "The new Start menu overhauls the layout to address long-standing complaints. But you have options if you don't like it.",
    "full": "Microsoft's revamped Windows 11 Start menu is rolling out - but I'll stick with my favorite alternative\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- The new Windows 11 Start menu is now rolling out to all users.\n- The menu brings a more flexible layout to the Apps section.\n- Don't like it? You can still turn to a Start menu replacement.\nThe Windows 11 Start menu has been a divisive change from the get-go. Some people apparently love it, while others hate it. (Yes, I'm in the latter category.) Since the OS debuted in 2021, Microsoft has taken baby steps to try to address some of the menu's flaws. But now, it's undergoing a more dramatic overhaul.\nFollowing a lengthy period in which the new menu was available only for testing among Windows insiders, the redesigned Start menu is now rolling out to all Windows 11 users. The revamped menu offers a more customizable and flexible layout meant to address the clumsiness of the Apps section.\nHow to get the new Windows 11 Start menu\nTo grab the update, head to Settings and select Windows Update. Make sure you've enabled the switch for \"Get the latest updates as soon as they're available.\" You should then see a preview update labeled KB5067036. Allow that to download and install. Reboot your PC, sign in, and then click the Start button.\nAlso: How to upgrade your 'incompatible' Windows 10 PC to Windows 11 - 2 free options\nIf the changes have reached your PC, you should see the new menu. If not, you may need to wait a few days as they're just now rolling out.\nHow it's different\nSo what will you find? Right off the bat, you'll notice that the Apps section is no longer a separate window that you have to click to open. Instead, this section is now integrated into the main page of the Start menu, so it's automatically visible and accessible.\nIn a nod toward customization, Microsoft offers three different views for the Apps section. With Category view, your installed apps are placed into folders that attempt to organize them based on type, similar to the App Library on iPhones and iPads. With List view, your apps are listed alphabetically and can display your frequently-used ones at the top. With Grid view, your apps also appear alphabetically, but with larger icons and more space between them, and with the most used ones at the top.\nJust click the drop-down menu for View to switch among the three layouts. Windows will remember which one you choose as your favorite, so you don't have to keep setting or resetting it. All three views are scrollable, letting you easily move up and down the menu.\nThe new menu also adapts to your screen size. On a large monitor or display, you can see more pinned apps, recommended apps, and categories.\nAlso: Microsoft said my PC was 'too old' to run Windows 11 - how I upgraded in 5 minutes anyway\nYour pinned apps still appear at the top of the menu for quick access. But you can select a button to show more or fewer of them. The goal here is to reduce the amount of scrolling and moving you have to perform just to change your view.\nThe new Start menu also includes a section for your mobile phone. Using the Phone Link app, you can connect and pair your phone with Windows. This new section allows you to access calls and texts from your connected iPhone or Android phone.\nHow to modify the new Start menu\nWant to tweak the new Start menu? Microsoft offers a few ways to do that.\nGo to Settings, select Personalization, and choose Start. You can tell Windows not to show recently-added apps, recommended apps, or most used apps. You can also put the kibosh on tips and shortcuts and links to websites from your browsing history. Plus, you can dispense with the mobile phone section if you don't want that hogging up your desktop.\nAlso: I'd choose this Windows gaming PC over other pro laptops for work - here's why\nThe latest preview update kicks in a slew of features and fixes for other apps, most notably File Explorer, the taskbar, the Click to Do feature on Copilot+ PCs, and voice access. But the biggest and most glaring change is the one for the Start menu.\nWindows 11 Start menu alternatives\nWith my disdain for the Windows 11 Start menu, I've used an alternative app for several years, specifically Stardock's Start11. I like this one because it offers a traditional two-column menu last seen in Windows 7 and well as a host of customization options. Two other solid Start menu replacements are StartAllBack and Open Shell Menu.\nI appreciate the changes to the built-in Start menu as I think they make it more usable. I don't use Start11 on my Windows 11 virtual machines, so the new menu will be most welcome when I'm working with my VMs. However, I'll continue to use Start11 on my core Windows 11 PCs. If you're still not sold on the Start menu even with the latest update, you may want to try one of the replacements to see if you prefer it.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:00:29.909954Z"
}