{
  "id": "zdnet-security-2025-10-29-2a6579cd",
  "source_id": "zdnet-security",
  "guid": "135db885-2971-4cfc-b3b0-dc5e4bda3521",
  "title": "How a system snapshot can save you when your OS goes awry - create one today",
  "url": "https://www.zdnet.com/article/how-a-system-snapshot-can-save-you-when-your-os-goes-awry-create-one-today/",
  "published_at": "2025-10-29T16:09:14+00:00",
  "fetched_at": "2025-10-29T17:53:54.840338Z",
  "status": "rejected",
  "content": {
    "raw": "System snapshots are the perfect complement to traditional backups. They can save the day when your computer goes awry or an update goes south. Here's how they work.",
    "full": "How a system snapshot can save you when your OS goes awry - create one today\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- A system snapshot ensures you always have the means to restore.\n- Some operating systems have built-in tools for automatic snapshots.\n- If your OS doesn't include a built-in tool, you should install one immediately.\nHave you ever updated your operating system or made a change, only to find your computer will no longer boot or isn't behaving as expected? When that happened, what did you do? Panic? Assume all was lost?\nIt doesn't have to be that way.\nAlso: 5 command line backup tools every Linux user should use for desktops and servers\nIf your operating system supports a certain feature (which most do), you have a path forward.\nSystem snapshots.\nWhat are system snapshots?\nSystem snapshots are exactly what they sound like: a saved point in time -- when your computer system was working as expected -- that can be restored in case of a PC emergency (or even a non-emergency). Say an upgrade goes south. If you've created a system snapshot (or your OS automatically created one) prior to running the upgrade, you could simply restore your machine to that earlier snapshot, and you're back in business.\nSome key points for snapshots include:\n- Snapshots capture an exact state of a system at the moment it's taken.\n- A snapshot can include the operating system's files, its configuration, and even the contents of memory.\n- Snapshots are usually stored on the same system as the original data, so they're very fast to create and use (and you don't have to worry about privacy risks).\n- Subsequent snapshots only store the changes made since the previous one was taken, so they are much smaller and quicker to create than a full backup.\nAlso: I ditched Linux for Windows 11 for one week - and found 9 big problems\nWhy not simply use a backup?\nFirst, full system backups tend to be very large and can take considerable time to create. They also require external storage for saving. More than anything, though, system snapshots are far easier to work with than a full system backup because most operating systems that support snapshots also include built-in tools (such as Windows' System Restore) for managing them.\nBenefits of snapshots\n- Offer rapid recovery from errors.\n- Minimize risk during changes.\n- Ideal for testing.\n- Complement traditional backups.\nAlso: Confused on which cloud storage to get? My expert advice (and 3 I recommend)\nIt's important to understand that snapshots shouldn't be used alone. If you truly value your data and files, you'll want to use snapshots in conjunction with data backups. Snapshots provide a fast, short-term recovery method, whereas backups offer long-term storage and protection against data loss.\nHow snapshots work\nHere's how system snapshots work:\n- The system creates a record of its current state. This record includes all relevant data and metadata.\n- The snapshot is created by one of two methods: \"Copy-on-write\" copies the original blocks that are about to be modified, and \"redirect-on-write\" redirects new writes to new blocks, thus preserving the data as it existed at the moment the snapshot was taken.\n- After the snapshot is created, all new changes or deletions are tracked, and only the blocks that have changed since the snapshot was created are stored separately.\n- When a restoration is required, the system uses the snapshot's metadata to reconstruct the data as it was at that specific point in time.\nWhich operating systems support snapshots?\nThe operating systems that support snapshots are Linux, MacOS, and Windows. With MacOS, snapshots are made possible via APFS, Linux uses systems like Btrfs, LVM, and ZFS, and Windows uses either NTFS or ReFS.\nAlso: How to use MacOS snapshots to rescue your system when disaster strikes\nWith the Linux OS, you have to install the operating system using either the Btrfs or ZFS filesystems, as ext4 does not support the feature. Btrfs is more reliable, whereas ZFS is faster. Linux also makes it possible to create snapshots either from the command line or from a GUI. MacOS works the same way: You can create a snapshot from the command line or by using the Time Machine GUI.\nLinux also has the Timeshift tool for taking snapshots of the system files. With Timeshift, you can roll back kernels, GPU drivers, etc. Let's say an update goes sideways and your system won't boot. If you save those snapshots to an external SSD, you can then boot into a live distribution, install Timeshift, and restore from the external drive.\nWithout snapshots, you'd be out of luck.\nIf you're serious about ensuring that your computer always works (aside from hardware failure), you should consider using snapshots along with data backups. With that one-two punch, you can rest assured that you'll always have the data you need and a running OS on which to use it.\nAlso: The easiest way to protect your Linux PC from disaster - no backup needed\nIt's very important that you either configure your OS to take regular, automatic snapshots (daily or weekly, depending upon your needs) or remember to create them manually. If your OS allows for automatic snapshots, I highly recommend you go that route. You don't want to need a system snapshot, only to find that you've forgotten to take any for weeks or months.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T17:58:57.029085Z"
}