{
  "id": "zdnet-security-2025-10-29-84a77a40",
  "source_id": "zdnet-security",
  "guid": "03d4f0ac-3a8a-4a4e-a706-f4efb0971ea9",
  "title": "Inside Canonical's plan to make Ubuntu 26.04 the Linux desktop that finally goes mainstream",
  "url": "https://www.zdnet.com/article/inside-canonicals-plan-to-make-ubuntu-26-04-the-linux-desktop-that-finally-goes-mainstream/",
  "published_at": "2025-10-29T14:30:06+00:00",
  "fetched_at": "2025-10-29T17:53:54.841598Z",
  "status": "rejected",
  "content": {
    "raw": "Canonical CEO Mark Shuttleworth and VP of Engineering Jon Seager share their vision for Resolute Raccoon.",
    "full": "Inside Canonical's plan to make Ubuntu 26.04 the Linux desktop that finally goes mainstream\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Shuttleworth still sees hope for a Linux desktop with broad appeal.\n- Seager stressed Canonical is improving its development pipeline.\n- Both executives believe in Rust for improved Linux security.\nAt the Ubuntu Summit 25.10 at Canonical headquarters in London, Mark Shuttleworth, founder and CEO, and Jon Seager, VP of engineering for Ubuntu, explained their vision and plans for 26.04, Resolute Raccoon, the next long-term support (LTS) of Ubuntu Linux.\nHere's what they told ZDNET about what you can expect.\nShuttleworth on the Ubuntu 26.04 vision\nShuttleworth told ZDNET that he's an open-source true believer. Canonical has been, and will continue to be, a company where users \"can work across the full open-source spectrum. If you want to use open source on the cloud, we will come to the cloud with you. And if you want to use it on tiny, little devices, we will be there for you as well.\"\nOn the desktop, Shuttleworth is aware that desktop Linux fragmentation is a serious problem: \"If we want Linux to be a true global alternative, we need to do something that has a lot of heft behind it, and we need not to tear each other down.\"\nAlso: I just found an obscure Linux distro that's outstanding on old hardware\nIronically, though, he credited Canonical's failed Unity desktop approach for helping the company become more profitable than ever, as the issue forced the business to focus on server, cloud, and IoT offerings.\nThat's not to say Shuttleworth is no longer a Linux desktop-believer: \"I would like to be part of open source winning the desktop.\" While Ubuntu 26.04 will continue to use GNOME for its default desktop, he had good things to say about the American Linux PC company System76 and its new Rust-based COSMIC desktop. In fact, System76 presented a COSMIC session at the Ubuntu Summit.\nShuttleworth continued: \"I'm a believer in the potential of Linux to deliver a desktop that could have wider and universal appeal.\" But he also thinks \"the open-source community needs to understand that building desktops for people who aren't engineers is different. We need to understand that the 'simple and just works' is also really important.\"\nAlso: Can't upgrade to Windows 11? This is the Linux distro alternative I recommend to most people\nIt's within this context that Shuttleworth and Seager are steering Ubuntu toward its next major release, Ubuntu 26.04 LTS, with an ambitious but cautious modernization plan. Their agenda emphasizes memory-safe foundational utilities, enhanced automation, community-centric documentation, and security features tailored for the desktop and cloud.\nSeager on the Ubuntu 26.04 details\nThese plans have been coming together since February, when the newly appointed Seager set out how, moving forward, Canonical and the Ubuntu developer team would steer a new course in building Ubuntu. The goal was to fundamentally rethink engineering practices for communication, automation, process, and modernization.\nSpecifically, for 2026 and beyond, Canonical aims to create a more transparent, accessible, and community-driven Ubuntu build process by consolidating documentation and communication channels, making it easier for new contributors to find paths to involvement. For example, the Matrix instant messaging based on the Ubuntu Community Matrix server will be Ubuntu developers' primary communication system.\nAlso: The easiest way to try out Ubuntu Linux\nCanonical is also consolidating its documentation for users and developers. Instead of an afterthought, Seager said he believes \"Documentation is a critical form of communication.\" Today, \"much of it is fragmented across different platforms, duplicated and/or contradictory, or simply difficult to find.\" Tomorrow, it will be unified into an accessible and accurate form.\nCanonical is also working hard on automating the build system for both the distribution and its packages. The goal is to shift away from error-prone, dull, but demanding processes to highly automated systems using modern development tooling.\nThe goal, Seager explained, \"is not just to automate as much as possible (thereby increasing our collective capacity), but also to simplify processes where we can. Much of Ubuntu's build process *is* automated, but those systems are disparate and often opaque to all but our most experienced contributors.\" By bringing them together into a consistent development pipeline, the whole build system will be improved.\nThe company is also streamlining and modernizing project workflows by adopting tools like Temporal for durable orchestration. Seager told ZDNET: \"Temporal is basically what I think will enable the Ubuntu org to build a distributed system that's quite complicated without needing to be distributed systems engineers.\" The goal is to handle scale while empowering contributors, leveraging well-documented, peer-reviewed processes that reduce bottlenecks and over-reliance on tribal knowledge.\nFinally, Ubuntu is adopting the memory-safe Rust language. Seager said the engineering team is focused on replacing key system components with Rust-based alternatives to enhance safety and resilience, starting with Ubuntu 25.10. He stressed that resilience and memory safety, not just performance, are the principal drivers: \"It's the enhanced resilience and safety that is more easily achieved with Rust ports that are most attractive to me\". This move is echoed in Ubuntu's adoption of sudo-rs, the Rust implementation of sudo, with fallback and opt-out mechanisms for users who want to use the old-school sudo command.\nAlso: This is my favorite Linux distro of all time - and I've tried them all\nIn addition to sudo-rs, Ubuntu 26.04 will use the Rust-based uutils/coreutils for Linux's default core utilities. This setup includes ls, cp, mv, and dozens of other basic Unix command-line tools. This Rust reimplementation aims for functional parity with GNU coreutils, with improved safety and maintainability.\nOn the desktop front, Ubuntu 26.04 will also bring seamless TPM-backed full disk encryption. If this approach reminds you of Windows BitLocker or MacOS FileVault, it should. That's the idea.\nSeager also told ZDNET that Snap-based applications will come with a granular permissions framework, \"permissions prompting,\" for desktop apps in Ubuntu 26.04.\nHe explained the approach: \"The intent is to combine powerful container-style security with upfront, user-driven approval. One of Snap's features is its sandbox, but it can also be irritating. If you try to do something and the sandbox prevents it, sometimes the app crashes, or it just simply doesn't do the thing it was supposed to.\" Moving ahead, \"You'll get a prompt saying, 'Firefox would like to access your Downloads directory. Is that okay?'\"\nAlso: While Windows 10 users panic, Ubuntu makes extending support easy - here's how\nThe framework isn't ready yet. Seager said this effort has \"a really deep piece of work right down through the kernel and AppArmor [the Linux security program] and snap and a desktop client.\" If all goes well, permissions prompting will be ready by the time Ubuntu 26.04 ships.\nHe added that Ubuntu 26.04 will once again push for \"the very latest version of GNOME [probably GNOME 48] and the very latest kernel,\" continuing its tradition of shipping up-to-date base components. If that approach means Canonical will need to support a Linux kernel that's not an LTS version itself, Canonical will do just that.\nThe new Ubuntu will also feature more Flutter-based apps. Flutter is a Google platform that uses the open-source Dart programming language. Flutter enables developers to create multiple-operation system apps for almost any platform from a single codebase. In Ubuntu 26.04, this capability will include the Ubuntu App Store, the Installer, and the Security Center.\nWhat do you think? Personally, I'm looking forward to the next Ubuntu. It sounds like a real winner.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T17:59:52.746736Z"
}