{
  "id": "zdnet-security-2025-10-29-043b9e7a",
  "source_id": "zdnet-security",
  "guid": "db621221-31a7-403b-9a8d-02675267aa70",
  "title": "Best early Black Friday deals under $100 2025: 10 sales out now",
  "url": "https://www.zdnet.com/article/best-early-black-friday-deals-under-100-2025/",
  "published_at": "2025-10-29T14:06:52+00:00",
  "fetched_at": "2025-10-29T17:53:54.842179Z",
  "status": "rejected",
  "content": {
    "raw": "Stick to your holiday budget this season with these giftable gadgets under $100, even before Black Friday officially begins.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest early Black Friday deals under $100 2025: 10 sales out now\nThe holiday shopping season will be here before we know it, and you may already be looking to find the best deals on gifts and gadgets that won't empty your wallet. If you want to stick to a strict budget this year, don't worry -- you can find some very useful tech products and other gadgets for under $100 that make great gifts, even before the Black Friday shopping weekend begins.\nAlso: The best early Black Friday Amazon deals we've found\nWe scoured retailers across the internet to find the best early Black Friday deals under $100 so you can start saving on your shopping list right now.\nBest early Black Friday deals under $100\n- Current price: $50 (50% off)\n- Original price: $100\nThis video doorbell has features like head-to-toe video, live view, and two-way talk, and alerts when a person or package is at your door. Especially with the holiday shopping season around the corner, a video doorbell is a great defense for porch pirates stealing packages.\n- Current price: $90 (40% off)\n- Original price: $150\nThe Studio Buds are sculpted to fit in the curvatures of your ear, without needing any stems or hooks to keep them snug. In addition, these earbuds operate with taps and holds, requiring less effort to play, pause, skip tracks, and pick up phone calls.\n- Current price: $100 (33% off)\n- Original price: $150\nThe Echo Show 8 makes a compelling case for a smart display for both Alexa fans and smart home enthusiasts. This latest smart display is notably faster than previous models in terms of touchscreen response and how quickly Alexa answers and processes requests.\nReview: Echo Show 8\n- Current price: $75 (50% off)\n- Original price: $150\nLooking to add a small TV to your guest bedroom for holiday guests? This 32-inch Toshiba TV is the perfect size for small spaces and comes with Fire TV streaming built right in, so you don't have to purchase a separate streaming device.\n- Current price: $18 (55% off)\n- Original price: $40\nIf you plan on traveling for the holidays and want to keep an eye on your pets at home, this indoor camera has color night vision, two-way audio, and motion detection for peace of mind while you're away.\nReview: Blink Mini 2\nYou can also opt to place it outside, and the spotlight is bright enough to illuminate people as they approach and light up pathways in the dark.\nMore early Black Friday deals under $100\n- Lenovo Tab One: $100 (save $50): This cheap, small tablet has a screen size of just 8.7 inches, making it the perfect tablet for reading.\n- Cosori TurboBlaze Air Fryer: $90 (save $30): Feed your holiday guests with this 9-in-1 air fryer that air fries, roasts, bakes, broils, dries, keeps food warm, and more.\n- JBL Flip 6 Bluetooth Speaker: $98 (save $32): The Flip 6 has an IP67 rating for dust and water resistance, which means you can safely use it to amp up the vibe in a variety of environments, regardless of the elements.\n- Logitech C920s Pro Webcam: $49 (save $21): Look better in work meetings, video calls, and more with this webcam that has auto-light correction and built-in dual microphones.\n- Soundcore by Anker Space One Headphones: $69 (save $30): These are a solid and stylish pair of headphones that have good noise canceling, and come with a host of features found on much more expensive headphones.\nFAQs\nWhen is Black Friday?\nBlack Friday always occurs the day after Thanksgiving in the US. This year, it falls on Friday, Nov. 28. However, you can expect deals the week leading up to the day, as well as all weekend long.\nAre deals really better on Black Friday?\nFor some big-name brands, Black Friday is the only time specific devices go on sale all year. It's also the time of year that you'll see the biggest discounts on bigger devices, such as phones, laptops, TVs, tablets, etc. So yes, it's definitely a better time to snag a deal than other sales events.\nHow did we choose these Black Friday deals?\nZDNET only writes about deals we want to buy -- devices and products we desire, need, or would recommend. Our experts looked for deals that were at least 20% off (or are hardly ever on sale), using established price comparison tools and trackers to determine whether the deal is actually on sale and how frequently it drops.\nWe also looked over customer reviews to find out what matters to real people who already own and use the deals we're recommending. Our recommendations may also be based on our own testing -- in addition to extensive research and comparison shopping. The goal is to deliver the most accurate advice to help you shop smarter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:00:14.958323Z"
}