{
  "id": "zdnet-security-2025-10-29-25ae2fe4",
  "source_id": "zdnet-security",
  "guid": "26fef99a-f4a8-42fb-ae6e-347085fa9bd6",
  "title": "I've been testing the top AI browsers - here's which ones actually impressed me",
  "url": "https://www.zdnet.com/article/ive-been-testing-the-top-ai-browsers-heres-which-ones-actually-impressed-me/",
  "published_at": "2025-10-29T13:03:00+00:00",
  "fetched_at": "2025-10-29T17:53:54.843414Z",
  "status": "rejected",
  "content": {
    "raw": "AI browsers promise to change how we search, shop, and work online. So, I've been trying them - and found 5 so far that really deliver.",
    "full": "I've been testing the top AI browsers - here's which ones actually impressed me\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET key takeaways\n- AI-powered web browsers are on the rise.\n- There are several different AI browsers to choose from.\n- One of these might be perfect for you.\nIt was only a matter of time before AI took over the web browser, and that time is now. It should come as no surprise that companies have jumped at the chance to incorporate AI into the tool people use more than any other.\nWith AI comes the agentic browser, which can handle many tasks for users. For example, you could tell your web browser to shop for a new black A-line dress with a ruffled hem for under $100. Your agentic browser will search the web for possibilities and report them back to you. You could have your browser search for the cheapest airfare to London, find concert tickets, research specific topics, and do much more.\nAlso: The top 20 AI tools of 2025 - and the #1 thing to remember when you use them\nSounds fascinating, right? It might also sound like an efficient way to work with a web browser.\nBut which AI-centric browsers should you try? Let's dive into the list of ones I've tested to see what's what.\n1. ChatGPT Atlas\nWhen you think of AI, most likely ChatGPT comes to mind. There's a good reason for that because ChatGPT is the most widely used AI service on the planet. Now imagine bundling that powerhouse AI service into a browser, and you get ChatGPT Atlas.\nChatGPT Atlas is based on Chromium (the same browser used as a foundation for Chrome), so using it should feel immediately familiar. And if you've used ChatGPT, you won't have any problem with the query system.\n(Disclosure: Ziff Davis, ZDNET's parent company, filed an April 2025 lawsuit against OpenAI, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.)\nWith Atlas, you can do standard AI queries from the main pane or from the sidebar, or you can also have ChatGPT Atlas summarize pages, help you with projects, and much more. Two particular Atlas features really stand out for me: Projects and Archives. You can create a new project centered around a certain task, topic, or just about anything, and then collaborate on it with others.\nAlso: I let ChatGPT Atlas do my Walmart shopping for me - here's how the AI browser agent did\nImagine you have a major research paper to do with a team, and you want to allow that team access to the project so they can help with the work. ChatGPT Atlas offers such a feature, and it's easy enough for anyone to use.\nArchives allow you to save chats and recall them later (by unarchiving them). I find this feature to be very handy because it prevents me from having to 1) deal with a large number of chats in one place, and 2) ensure that I don't lose important chats.\nOne thing that I've found to be a stumbling block with users is that they start a single chat and then use it for unrelated queries. With Archives, you can create single chats for a single topic and then archive them so they are out of the way but accessible.\nOther ChatGPT Atlas features include tab summarization, multi-step tasks, asking complex contextual questions, deep integration with ChatGPT, and more advanced features such as Agent Mode (which requires a subscription).\nChatGPT Atlas is available for MacOS, Windows, Android, and iOS.\nPricing:\n- Free: Advanced reasoning with GPT-5, limited messages and uploads, limited and slower image generation, limited deep research, limited memory and context.\n- Plus - $20 per month: Everything in Free plus advanced reasoning with GPT-5, expanded messaging and uploads, expanded and faster image creation, expanded deep research and Agent Mode, expanded memory and context, projects, tasks, and custom GPTs, limited access to Sora 1 video generation, Codex agent.\n- Pro - $200 per month: Everything in Plus plus pro reasoning with GPT-5, unlimited messages and uploads, unlimited and faster image creation, maximum deep research and Agent Mode, maximum memory and context, expanded projects, tasks, and custom GPTs, extended access to Sora 1 video generation, expanded Codex agent, research preview of new features.\n2. Perplexity Comet\nAnother AI browser built on Chromium, Perplexity Comet acts as your personal assistant and thinking partner, so you can make decisions faster, get up to speed quicker, get help managing your calendar and email, and find answers from your own browsing activity. If you've used the Perplexity search engine, then you understand how helpful Perplexity Comet can be.\nPerplexity includes a feature that many users will appreciate: ad blocking.\nWhen you enable ad blocking, you ensure that all links opened within Comet are done so ad-free. This is important because Perplexity is one of the best AI browsers on the market for showing its sources. Because of that, Perplexity Comet is considered one of the best AI browsers for research and does so with a high level of accuracy.\nAlso: I tried Perplexity's Comet AI browser, and I like where it's going (but it's not there yet)\nFrom my experience, Perplexity AI is one of the most accurate AI services on the market, and because it always cites its sources, it's easier to verify the veracity of its answers.\nSome of the other important features found in Comet are multi-step tasks that can function across multiple sources, a built-in assistant for providing real-time information, agentic task automation, and workday copiloting, which integrates with email and Slack to help you manage your schedule, collaboration, and communication.\nPerplexity Comet is only available for MacOS 14 and Windows 11.\nPricing:\n- Comet Free: Core browser and AI features.\n- Comet Plus - $5 per month: Provides access to content from partnered news outlets.\n- Comet Max - $200 per month: Everything in Plus as well as faster AI responses, advanced Perplexity features, and priority support.\n3. Kosmik\nIf you're like me and creativity rules your world, the Kosmik AI browser might be the one for you.\nThis is very much a visual-first AI browser that can create moodboards of visual content. Think of Kosmik as an AI-centric Pinterest-type tool with the added bonus of having a built-in web browser. Kosmik might be a bit too niche for the average user, but if you prefer working with imagery as a means to organize your day or life, Kosmik is right up your alley.\nWith Kosmik, you create universes based on a subject or a task.\nKosmik pulls information (and images) for that universe, where you can then add comments to it, import files, create frames, create stickers, and open web searches based on the subject. The way I see Kosmik is as a sort of AI-centric mind map to visualize your work. Kosmik is best suited for more creative people who think visually and need to organize a variety of content.\nAlso: Are AI browsers worth the security risk? Why experts are worried\nA really cool feature of Kosmik is that it allows you to break images away from the \"map,\" resize them, and even open the source of the images in a side panel.\nSome of the key features found in Kosmik include an infinite canvas (aka \"Moodboards\"), drag-and-drop images, website filtering to narrow down search results, auto-tagging and organizing based on topic, color, and style, and proactive suggestions for related images and/or articles. Kosmik is available for MacOS, Windows, and the web.\nPricing:\n- Free: One workspace, three members, unlimited universes and items (notes, bookmarks), up to 100 files imported, up to 15 MB per file, 50 AI requests per month.\n- Plus - $10.99 per month, or $6.99 per month if billed annually: Unlimited workspaces, workspace members, guests per workspace, universes and items (notes, bookmarks), file imports with no size limit, AI requests, and priority support.\n- Enterprise: Custom pricing; contact Kosmik for a quote -- includes everything in the Plus plan as well as custom integrations.\n4. Dia\nDia comes from The Browser Company, which created the now-defunct Arc, a game-changing browser that was ahead of its time. The Browser Company pulled that browser and opted to go the AI route by creating the Chromium-based Dia.\nDia is geared toward writing, learning, planning, shopping, and more. One of the best features of Dia is the ability to personalize it. With this feature, you can add information such as who inspires you, various bits of information Dia should know about you, how you want Dia to write, and even coding preferences.\nThere's also the Memory feature, which enables Dia to learn from your sites, chats, and preferences. One thing to keep in mind about the Memory feature is that while your activity is summarized on the Dia servers, it is only saved on your device. If you don't like the idea of a third party having access to your activity (even if only temporarily), I would suggest leaving this feature disabled.\nAlso: I loved Arc browser and was skeptical of its agentic Dia replacement - until I tried it\nOther features found in Dia include an address bar that doubles as a natural language chat interface, contextual awareness, custom AI-powered actions (called Skills), a conversational AI assistant, and tab-aware intelligence for analyzing and summarizing content across multiple open tabs. Dia is currently only available for MacOS.\nPricing:\n- Free: Chat on any tab, create custom Skills, mention tabs in any query, add attachments to any query, personalize Dia with Memory.\n- Pro - $20 per month: Everything in Free plus unlimited chat usage.\n5. BrowserOS\nBrowserOS is an open-source agentic browser capable of turning your words into actions. Describe a task in plain language, and BrowserOS will handle the rest for you. BrowserOS is a privacy-first alternative browser, based on Chromium, reimagined for the AI era. For me, the fact that BrowserOS is open-source makes it stand out.\nMore than that, BrowserOS uses on-device agents, so you don't have to worry that a third party will have access to your queries or data. That feature alone makes BrowserOS worth using over the competition (I'm very much in favor of local AI).\nYou can run a query on BrowserOS using natural language, and it then works with local AI agents to break down the query and perform the necessary actions. This feature can be used for scraping websites and extracting data, comparing product prices across different online retailers, and filling out forms and organizing information into a spreadsheet.\nAlso: The best secure browsers for privacy in 2025: Expert tested\nSome of the other features found in BrowserOS include agentic capabilities for automating web tasks, Chromium extension compatibility, local LLM support or user-provided API keys, and semantic history and bookmark searches. BrowserOS is available for Linux, MacOS, and Windows.\nPricing:\n- BrowserOS is free to install and use.\nWant more stories about AI? Check out AI Leaderboard, our weekly newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:00:29.914676Z"
}