{
  "id": "zdnet-security-2025-10-29-1aed4ee4",
  "source_id": "zdnet-security",
  "guid": "17eeb4c3-a7bf-4d67-ba14-3008eea735fb",
  "title": "6 hidden GNOME Search tricks every Linux user should try",
  "url": "https://www.zdnet.com/article/6-hidden-gnome-search-tricks-every-linux-user-should-try/",
  "published_at": "2025-10-29T15:29:30+00:00",
  "fetched_at": "2025-10-29T17:53:54.840839Z",
  "status": "rejected",
  "content": {
    "raw": "GNOME's built-in search tool can actually do quite a lot. Here's how I use it to work faster and smarter.",
    "full": "6 hidden GNOME Search tricks every Linux user should try\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET key takeaways\n- GNOME Search is more than just a search tool.\n- There are several added features you can use.\n- If you want the most efficient desktop, try these functions.\nI've used so many GNOME and GNOME-based desktops over the years that I can't even recall them all. One thing that has been constant over the years is that GNOME is far more useful than you might think. Sure, it looks minimal, but that's all about getting out of your way and not stripping down features.\nOne of the cool features of the GNOME desktop is the search functionality. At first blush, it seems the search tool is just a means to locate the app you want to run. Au contraire, mon ami.\nAlso: GNOME's new AI assistant can even run Linux commands for you - here's how\nThe GNOME search tool is much more flexible than that, and I'm going to show you some of the cool things you can do with it.\nConfiguring Search\nHold up. Before we get to showing off the search functionality, you have to know how to configure it. Within the Settings app, you'll find a Search entry in the left sidebar. Click that and you'll see several entries under Search Results. Go through that list and enable any or all features you want to include in the search functionality.\nAlso: The 4 best Linux desktops based on GNOME - and what I most like about each one\nYou can also arrange the order in which the search categories will be used. By doing this, you can make your searches more efficient. For example, if you regularly do file, web, software, and calendar searches, you'll want to drag those entries to the top.\nDone?\nLet's move on.\n1. File search\nThe file search functionality is probably one of the most useful options for GNOME search. With this feature, you can search for any file on your system (as long as you have it configured). Yes, if you want to search beyond the usual directories, you'll need to add it to the Default Locations section of GNOME search settings. By default, the search locations will be Home, Documents, Downloads, Music, Pictures, and Video. If you need to configure it beyond that, click Add Location in the Search Locations section in Settings > Search.\nAlso: 8 free Linux apps that make tricky tasks surprisingly easy - no command line required\nLet's say you have the file zdnet.txt, but you can't remember where you saved it. Open the search tool and type zdnet.txt, and not only will the location appear, but you can also open the file (using the default app for that file type) directly from the search results.\n2. Calculate\nCall up the GNOME Activities overview (by either hitting the Super -- aka Windows -- key or by clicking the small square of dots in the dock, panel, or favorites bar). Once you've done that, type a calculation, like 3.14156*3.14156. You should see the results appear immediately under the search bar. You can also do more complicated calculations, such as 2(3+4)/4(4+4), which equals 28 (according to GNOME search).\n3. Copy emojis\nIf you like to use emojis in your messages, documents, or whatever, GNOME search can help you. Say, for instance, you want to copy the laugh emoji. Open the search tool and type laugh. You can see all of the available emojis in the Characters app. If you don't find the Characters app or emojis don't appear in your search, you need to install the gnome-characters app, like so:\n- Ubuntu-based distributions: sudo apt-get install gnome-characters -y\n- Fedora-based distributions: sudo dnf install gnome-characters -y\nAlso: How I feed my files to a local AI for better, more relevant responses\n4. Web searches\nThis one gets a bit tricky. GNOME search is supposed to honor the default Firefox browser for web searches, but for some reason, it isn't. To get around that, you can install the Epiphany browser with the command:\nflatpak install flathub org.gnome.Epiphany\nOnce you've done that, make sure you've enabled Web in Settings > Search.\nAlso: New to Linux? 5 desktop environments I recommend you try first - and why\nWith that taken care of, open the Activities Overview and type a search string in the search field. You should see a link appear that you can click to reveal the results.\n5. Install applications\nLet's say you want to install the GIMP image editor. If you type gimp in the search field, you should see an entry appear with the GNOME Software icon. Click that entry and Software will open to GIMP, where you can click Install.\n6. Locate contacts\nIf you open the Activities Overview and type the name of a contact, you can then click the name to open their entry in the Contacts app.\nSadly, not all of the Search Results providers actually work. Even though there are providers for several different features, actions, and apps, you might find that the one you want to use doesn't work (such as Calendar and Weather).\nAlso: This beautiful Linux distro deserves to be better known - here's why\nHopefully, those provider issues can be resolved in a future update. Until then, happy searching.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T17:59:52.742507Z"
}