{
  "id": "zdnet-security-2025-10-29-7a5233e4",
  "source_id": "zdnet-security",
  "guid": "6ab5bf13-1d08-4422-b915-82abae682f06",
  "title": "Grammarly changes its name to Superhuman - and its mission to AI wrangler",
  "url": "https://www.zdnet.com/article/grammarly-changes-its-name-to-superhuman-and-its-mission-to-ai-wrangler/",
  "published_at": "2025-10-29T13:00:36+00:00",
  "fetched_at": "2025-10-29T17:53:54.843660Z",
  "status": "rejected",
  "content": {
    "raw": "The AI writing tool isn't going away - it's being joined by a suite of new tools, including an agent manager that can turn assistants on and off as needed.",
    "full": "Grammarly changes its name to Superhuman - and its mission to AI wrangler\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Grammarly has changed its name to Superhuman.\n- The company also debuted an AI assistant called Superhuman Go.\n- It's the latest company to reorient itself around AI.\nThe rise of generative AI in recent years has caused a massive strategic reorientation across the tech industry, as companies have scrambled to launch their own AI-powered products and services. Perhaps most memorably, Meta -- which three years ago changed its name from Facebook to signal its shift toward the metaverse (remember that thing?) -- announced that 2023 would be its \"year of productivity,\" focused in large part on a pivot toward AI.\nAlso: GitHub's new Agent HQ gives devs a command center for all their AI tools - why this is a huge deal\nNow, AI writing tool Grammarly has become the latest company to rebrand itself with an emphasis on AI.\nThe company announced Wednesday that it's changed its name to Superhuman, a direct nod to the idea that AI will supercharge human creativity and productivity, rather than replace them -- a pervasive marketing theme across the tech world. Here's what's new, how to try it, and what it indicates about where AI ROI is headed.\nThe Superhuman suite\nIn addition to the name change, the company is also launching a new AI assistant, dubbed Superhuman Go. Its primary function is to orchestrate several different agents and adaptively determine which one is best suited to assist users with a particular writing or editing task.\nAlso: Why open source may not survive the rise of generative AI\nSuperhuman Go is part of the company's new Superhuman suite, available now to all paid users, which also includes Grammarly -- it's not being retired, just absorbed into the new Superhuman product portfolio. You'll also get access to Coda (an AI-powered workplace productivity and collaboration platform that Grammarly acquired in December), and Superhuman Mail (a new feature that leverages AI agents to organize users' email inboxes).\nIn an interview with ZDNET, Luke Behnke, vice president of product for enterprise clients at Superhuman (formerly Grammarly), said that while the original name for the company worked well since its founding in 2009, it's become constrictive as the company's goals -- along with the priorities within the tech industry more broadly -- have evolved.\n\"We have bigger ambitions than grammar, and the name really wasn't suiting us anymore,\" he said, adding that Superhuman is \"a really beautiful name to describe the view that we have around humans continuing to be in control and at the center, [while] AI is there to make them better at what they are already doing -- and maybe give them powers they didn't think they had.\"\nAn 'air traffic control system' for AI\nAs Behnke's comments suggest, the rebrand to Superhuman is geared towards a vision of technology that strikes a delicate balance: helping human users to become more competent and confident writers through the automation of certain tasks, while still leaving room for enough friction to ensure that writing doesn't become too easy.\nAlso: I tested all of Edge's new AI browser features - and it felt like having a personal assistant\nIn other words, the driving idea behind the rebrand is to build and deploy AI tools that know how and when to provide a helping hand -- and, equally importantly, when to keep quiet. This was also the premise behind a fleet of new writing-assistant agents that the company released in August for students and working professionals.\nWith that broader vision in mind, Superhuman's mission moving forward, according to Behnke, will be to serve as an \"air traffic control system\" coordinating the behavior of a multitude of AI agents, both those offered by the company and from other third-party platforms. This system can deploy the agents a user needs when they're needed, for as long as they're needed, rather than leaving users to their own devices to blindly attempt at whatever problem they're trying to solve by haphazardly feeding prompts to a chatbot.\nAlso: Need the best AI content detector in 2025? Try these four tools (you probably already use one)\nYou can think of Superhuman Go, the company's new AI assistant, as the director of that air traffic control system, orchestrating agents and delegating them depending on the task at hand.\nHow it works\nA user drafting an email to a customer, for example, might receive suggestions from Go based on information the assistant pulled directly from a CRM platform. In another scenario, a team getting caught up in a long Slack thread might use Go to quickly ask each team member about their availability for a meeting and send out an invite to everyone's email.\nWant more stories about AI? Sign up for AI Leaderboard, our weekly newsletter.\nSuperhuman Go is available now for Chrome and Edge browsers, with availability on Mac, Windows, and mobile expected soon.\nAddressing the 'AI productivity gap'\nSuperhuman Go arrives alongside a mounting body of research showing that the vast majority of businesses using AI are not seeing measurable ROI from the technology, despite enthusiastic claims from developers promising quick boosts in organizational efficiency and output.\nAlso: Sick of your slides? Let Gemini make them - here's how\nReferring to this dilemma as the \"AI productivity gap,\" Superhuman is betting that its new AI assistant's ability to adaptively deploy itself based on individual users' context will help businesses make the most of AI.\n\"The key,\" Behnke says, \"is AI showing up when it's needed, and disappearing into the background when it's not.\"\nBehnke's belief that optimally useful AI will be that which knows when to speak up and when to shut up echoes a recent report from Forrester. It argues that we're now entering a phase of AI development in which the most useful systems are those that operate silently and efficiently in the background -- a sharp contrast to the sensationalism that's surrounded the technology since it exploded onto the cultural scene in 2022.\nAlso: Your colleagues are sick of your AI workslop\nBehnke goes so far as to predict that in the not very distant future, the basic user interface paradigm of consumer-facing AI tools will have evolved to the point that the question-and-answer prompt interface of today will seem quaint and unwieldy, like the buttons on a Blackberry.\n\"I think in five to 10 years, we'll say, 'Do you remember when we had to actually figure out how to prompt [AI] for an answer?' I think we'll find that to be very strange in the future,\" he says.\nThe race to make AI stick\nGrammarly's \"air traffic control\" play is also based on the belief that one of the hindrances preventing businesses from achieving ROI with AI is a surplus of tools; that there are just too many options available to users at a given time, and this results in a kind of analysis paralysis.\nAlso: Is your company spending big on new tech? Here are 5 ways to prove it's paying off\nIt's not the only company betting that businesses will be willing to pay for a service that takes this overabundance of tools and is able to turn it into streamlined simplicity. Last month, for example, the software company ServiceNow unveiled a new platform designed to help businesses manage their roster of agents. Just yesterday, GitHub launched an Agent HQ. In a similar but separate approach, Adobe announced a new service earlier this month that allows enterprise customers to build their own custom AI agents.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:00:55.511579Z"
}