{
  "id": "zdnet-security-2025-10-29-aaa67e4a",
  "source_id": "zdnet-security",
  "guid": "c7828b90-8a8e-489c-9e6f-19e51ca62304",
  "title": "Best early Black Friday Nintendo Switch deals 2025: 20+ sales out early",
  "url": "https://www.zdnet.com/article/best-early-black-friday-nintendo-switch-deals-2025/",
  "published_at": "2025-10-29T11:00:34+00:00",
  "fetched_at": "2025-10-29T17:53:54.844140Z",
  "status": "rejected",
  "content": {
    "raw": "Although Black Friday is still a few weeks away, you can find great Nintendo Switch and Switch 2 deals now. I've collected some of the best.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest early Black Friday Nintendo Switch deals 2025: I'm tracking my favorite discounts live now\nThe holiday shopping season is almost here, which means one thing: Black Friday deals are about to flood the web. It's the time of the year when you can score huge discounts on smartphones, laptops, and especially video games. Retailers are already rolling out early discounts on consoles, popular titles, and accessories. And few brands bring the deals quite like Nintendo.\nAlso: Best early Black Friday Walmart deals\n2025 has been a big year for Nintendo as the gaming giant launched a brand new console: the Switch 2. While the latest model has stolen the spotlight, the original Switch remains a great handheld device that continues receiving new releases and support. Whether you're shopping for your first console or planning to upgrade, I've rounded up the best early Black Friday Switch deals so you can get your holiday shopping done before the rush.\nBest early Black Friday Nintendo Switch deals\n- Current price: $500\nThe Switch 2 is a significant upgrade over the previous model, sporting better hardware, a larger, more vibrant touchscreen, and a revamped pair of controllers with optical sensors that allow them to function as computer mice. Switch 2 deals are tough to come by at this point in time, but I did find this bundle deal that packages the console with a copy of Mario Kart World. Also, this console is backwards compatible with the vast majority of your original Switch games.\n- Current price: $320 (9% off)\n- Original price: $350\nThe Nintendo Switch has been a massive success for the company, and for good reason. It is a versatile gaming device that supports three different playstyles, has an enormous game library, and has a long-lasting battery. I recommend that you buy the OLED model for its superior visual output. Colors are much more vibrant, and black hues are darker on this version of the Switch than on the original, which has an LCD screen.\n- Current price: $450 (10% off)\n- Original price: $500\nThis Nintendo Switch provides a lot of value for its price. In addition to the console, this bundle comes with Mario Kart 8 Deluxe preloaded on the device, a copy of Super Mario RPG, a free 12-month subscription to Nintendo Switch Online, a screen protector, a protective case, and more.\n- Current price: $70 (13% off)\n- Original price: $80\nThe Switch's Joy-Cons are praised for their versatility, comfortable design, and robust features like motion controls. It's not an exaggeration to say that the Joy-Cons are some of my favorite gaming controllers of all time. I have a pair and plan on continuing to use them until they fall apart. Over at Target, you can get a pair of refurbished controllers from Nintendo for 13% off.\n- Current price: $20 (35% off)\n- Original price: $30\nThe Switch's Charging Grip does multiple jobs at once. You can attach your Joy-Con to the grip and use them together as a more traditional controller for more comfortable gameplay. It can also be used to recharge the Joy-Cons while you play. There's a USB-C port around the back of the grip that feeds directly into the battery.\n- Current price: $40 (43% off)\n- Original price: $70\nMadden 26 is the latest entry in the long-running series. This entry introduces a \"new AI-powered machine learning system\" that takes real-world NFL data and converts everything into \"explosive gameplay.\" It aims to provide an experience so authentic that you'll feel like an actual head coach in the NFL leading your team to victory.\n- Current price: $55 (8% off)\n- Original price: $60\nSuper Mario Odyssey launched close to the release of the first Switch and quickly became a classic on the console. This entry sees Mario embark on another epic adventure to save Princess Peach from getting married to Bowser. It's also a return to form for the series since it is the first sandbox-style 3D Mario game since 2002's Super Mario Sunshine.\n- Current price: $25 (49% off)\n- Original price: $49\nRelive the glory days of arcades with this Marvel vs. Capcom collection. It packs six games on one cartridge, including the legendary Marvel vs. Capcom 2, X-Men: Children of the Atom, and Marvel Super Heroes. These classic titles have been revamped for high-definition visuals and come with modern features, including a training mode. Online play is supported, so you can play with people around the world.\n- Current price: $30 (49% off)\n- Original price: $59\nBecome vengeance; become the night. Batman Arkham Trilogy consists of three action-packed games where you play as Batman as he takes on the worst of Gotham City. The first game, Arkham Asylum, will task you with freeing the asylum from the clutches of the Joker. Arkham City, the second game, sees Batman trapped in a new maximum-security facility made up of parts of Gotham. Arkham Knight is the thrilling conclusion that pits Batman against his greatest challenge.\n- Current price: $90 (40% off)\n- Original price: $150\nBlock out the world and immerse yourself fully in the game. The HyperX Cloud III is a wireless headset. It houses 53mm drivers, a 10mm mic for crystal-clear voice chats, a comfortable design, and support for DTS Spatial Audio. As the cherry on top, this pair of headphones boasts a battery life of up to 120 hours on a single charge. I recommend the wireless version, but if you're looking to save some cash, there is also the Cloud III Wired Headset for $67.\nMore early Black Friday Nintendo Switch deals\n- Nintendo Switch Gray: $295 (save $66): Enjoy versatile gaming on the go. Walmart has the original Nintendo Switch for less than $300.\n- Nintendo Switch Lite - Turquoise: $199 (save $30): The Switch Lite, as its name suggests, is a lightweight version of Nintendo's handheld, sporting a smaller screen and controllers that cannot be removed.\n- Nintendo Switch Mario Kart 8 bundle: $460: This Best Buy bundle includes a Switch OLED, a copy of Mario Kart 8 Deluxe, and a free 12-month subscription to Nintendo Switch Online.\n- Nintendo Switch OLED Mario Red: $350 (save $40): If you're willing to buy a refurbished model, this Switch OLED model comes in striking Mario Red.\n- Nintendo Switch Pro Controller - Tears of the Kingdom Edition: $55 (save $20): The Pro controller offers better ergonomics than the standard Joy-Cons. This version is designed based on The Legend of Zelda: Tears of the Kingdom.\n- Turtle Beach Rematch Wireless Controller: $54 (save $6): Turtle Beach sports a colorful image of Invincible Mario on the front if you'd like a more vibrant Pro controller.\n- Donkey Kong Country: Tropical Freeze: $50 (save $10): The Kong Family embarks on another adventure to save their beloved DK Island from an army of icy invaders.\n- Dragon Quest III HD-2D Remake: $40 (save $20): This game is reimaging the old RPG classic from 1988, now with stunning 2D graphics. Travel the world, fight through dungeons, and save the kingdom from the Archfiend Baramos.\n- Sonic Mania: $16.25 (save $3.74): It's a blast from the past. Sonic Mania takes heavy inspiration from the first generation of the franchise, featuring speedy side-scrolling levels as Sonic and friends aim to stop Dr. Eggman yet again.\n- Splatoon 3: $49.99 (save $10): Splat your way to victory. The third entry in the franchise continues the series' intense battle modes while adding a new, extensive story mode and a wide range of customization.\n- Spyro Reignited Trilogy: $20 (save $20): Every title from the original PS1 trilogy is back in glorious 3D graphics. Each game is mostly faithful to the original, improving key areas for the modern audience.\n- Super Smash Bros. Ultimate: $50 (save $10): Super Smash Bros. Ultimate takes the party game series to a whole new level, featuring popular characters across the gaming industry. Engage in intense battles from online and off.\nFAQs\nWhen is Black Friday?\nIn 2025, Black Friday is set for Friday, November 28. It's one of the best times of the year to score deep discounts on Nintendo Switch consoles, games, and accessories from major retailers like Best Buy, Walmart, and Amazon. Many of these sales are expected to carry over until Cyber Monday, December 1.\nIs the Nintendo Switch really cheaper during Black Friday?\nAbsolutely. The Nintendo Switch is almost always cheaper on Black Friday and Cyber Week. Retailers also slash prices on popular console packages, accessories, and games, with saving that can easily reach $100 or more. This sales event is usually the price time to get a Switch or Switch 2. Nintendo rarely lowers the price on its devices and games, so it can be tough to find discounts during other parts of the year.\nHow did we choose these early Black Friday deals?\nAt ZDNET, we only highlight Nintendo Switch deals worth your money -- the same kind we'd consider ourselves. For this roundup, I specifically sought out Switch models, games, and accessories that were about 15% off or more. Black Friday is still several weeks away, so the significant discounts aren't available yet. Knowing this, I expanded my search to include lesser discounts to fill out the list. Although some price drops aren't as deep as others, they're still worth consideration because they offer unique value in other areas.\nI considered hands-on experience, real-world performance, and customer feedback. Every recommendation on this list is backed by careful research and expert insight so that you can confidently shop these early Black Friday sales.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:01:18.171237Z"
}