{
  "id": "zdnet-security-2025-10-29-099f56f8",
  "source_id": "zdnet-security",
  "guid": "a6d68b07-c481-49ed-a3e5-90d8d249eebb",
  "title": "The easiest way to protect your Linux PC from disaster - no backup needed",
  "url": "https://www.zdnet.com/article/the-easiest-way-to-protect-your-linux-pc-from-disaster-no-backup-needed/",
  "published_at": "2025-10-29T16:00:55+00:00",
  "fetched_at": "2025-10-29T17:53:54.840598Z",
  "status": "rejected",
  "content": {
    "raw": "If you want to always have a running state for your Linux desktop, create a snapshot. Here's how.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThe easiest way to protect your Linux PC from disaster - no backup needed\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET key takeaways\n- Snapshots are a crucial part of keeping your system running.\n- You'll want to install the free Timeshift app on your distribution.\n- Make sure to save your snapshots to an external drive.\nWhen you want to ensure you always have a running Linux system, snapshots are a necessity. Snapshots are a saved \"moment in time\" state of your system that is created (either manually or automatically) and can be used to roll back a system.\nThe difference between snapshots and backups\nThis is an important distinction you must know about. First off, a snapshot is a point-in-time copy of data that captures a system's current state, whereas a backup is a complete duplicate of specific data that is stored separately for recovery. As far as the purpose of each, a snapshot is for quick recovery, testing, and virtual environments, whereas a backup is for long-term data protection and disaster recovery.\nAlso: The most versatile Linux distributions you can install right now - and I've tried them all\nFor the most reliable recovery system, it is important that you have both snapshots and backups, each of which is handled differently.\nWe're going to talk about snapshots on Linux.\nAlso: 8 things you can do with Linux that you can't do with MacOS or Windows\nBefore we do, there's one very important thing you need to know. There are two primary paths for creating snapshots in Linux: Btrfs and rsync. When using a Linux distribution with Btrfs (such as openSUSE), snapshots take up considerably less space and are much faster. If your distribution doesn't use the Btrfs file system, you'll be limited to the slower, more space-consuming rsync.\nEither way you go, you'll still wind up with snapshots that can be used to roll back the system.\nHow to install Timeshift\nWhat you'll need: The only things you'll need are a Linux distribution and a user with sudo privileges.\nAlso: The only antivirus I trust on Linux - and it's free to use\nAgain, your best bet is a Linux distro that uses the Btrfs file system. You'll also want an external drive to which you will save your snapshots. If you save them to the local file system, you'll have trouble accessing them should things go wrong. Because I'm demonstrating this on a virtual machine, I will go ahead and save the snapshot to the local drive, so make sure not to do that.\n1. Open your distribution's app store\nInstead of installing Timeshift via the command line, let's install it via your distribution's app store. For example, on openSUSE (with the KDE Plasma desktop), open Discover and then search for Timeshift.\n2. Install Timeshift\nOnce you see the Timeshift entry, click Install. You'll be prompted for your user password. Once you successfully authenticate, the app will install.\nSetting up your snapshot\nIt's now time to set up your snapshot. Before you do, make sure you plug in your external drive. With that taken care of, it's time to configure.\nAlso: I'm a command-line pro, and this is the best terminal app I've ever used, thanks to AI\n1. Open Timeshift\nOpen your desktop menu and search for Timeshift. When you find the app icon, click on it to launch the tool.\n2. Select your type\nIn the first window of the Timeshift setup wizard, you'll be asked to either select Btrfs or rsync. If your distribution uses Btrfs, select it; otherwise, select rsync. If your distribution doesn't run on the Btrfs file system, Btrfs will be grayed out. Click Next to continue.\n3. Select the snapshot destination\nIn the next window, select the drive that will house your snapshots, and click Next.\n4. Select your snapshot levels\nIn the resulting window, you can configure how often you want the snapshots to be taken and how many of them you want to save. I highly recommend you save at least five. If you only save one and things go wrong after a snapshot is taken, you won't be able to roll back to a working state.\nYou can select multiple snapshot levels. For instance, you could run a daily snapshot and save five levels, and then add a monthly snapshot and only keep two.\nAlso: Want to save your aging computer? Try these 5 Linux distributions\nOnce you've taken care of this, click Next.\n5. Do not include home directories\nMy advice to you is not to include your home directories in the snapshot. Instead, you should do a backup of those directories. Leave the \"Include @home subvolume in backups\" option unchecked, and click Next.\nYou can then click Finish, and you're done. Timeshift will start automatically saving your snapshots.\nHow to use your snapshots\nTo roll back a system to a working state, you have to do the following:\n- Download the ISO for the distribution you are using.\n- Burn the ISO to a USB drive.\n- Shut down your computer.\n- Insert the USB drive.\n- Start the computer.\n- When the live instance opens, install Timeshift.\n- Open Timeshift.\n- Click Restore.\n- Select the snapshot you want to use.\n- Restore.\nAlso: Déjà Dup is as simple a backup tool as you'll find on Linux\nAnd there you go -- you have a snapshot system set up. Just remember to also set up a backup of your home directory (and whatever other directory houses critical data).\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T17:58:57.031120Z"
}