{
  "id": "bellingcat-bellingcat-com-2025-10-31-0a458a65",
  "source_id": "bellingcat-bellingcat-com",
  "guid": "https://www.bellingcat.com/?p=50091",
  "title": "‘Pattern of Extreme Brutality’: Tear Gas, Pepper Balls Among Weapons Deployed Against Protesters in Illinois",
  "url": "https://www.bellingcat.com/news/2025/10/31/illinois-immigration-protests/",
  "published_at": "2025-10-31T18:58:48+00:00",
  "fetched_at": "2025-11-01T11:11:50.953315Z",
  "status": "rejected",
  "content": {
    "raw": "To stay up to date on our latest investigations, join Bellingcat’s new WhatsApp channel&nbsp;here. This investigation is part of a collaboration between Bellingcat and Evident. You can watch Evident’s video here. Children in Chicago’s Old Irving Park neighbourhood were preparing for a Halloween parade on Oct. 25 when federal agents reportedly deployed tear gas on the street to disperse protesters opposing immigration-related arrests in the neighbourhood. “Those kids were tear gassed on their way to celebrate Halloween in their local school parking lot,” US District Judge Sara Ellis said in court on Tuesday, according to a CBS News report. “I can only imagine how terrified they were.”&nbsp; Images of tear gas being deployed in Old Irving Park during the arrest of multiple people in the neighbourhood. Source: X / Mondophotos and X / TVMigrante Ellis was questioning US Customs and Border Patrol Commander Gregory Bovino over this and other incidents that protesters allege violate a temporary restraining order (TRO) she issued earlier this month.&nbsp; The Oct. 9 TRO was issued after a group of journalists, faith leaders and protesters filed a lawsuit against the Trump administration over what they described as a “pattern of extreme brutality” by federal agents against peaceful protesters since Operation Midway Blitz – a multi-agency operation against “criminal illegal aliens” in Illinois – began on Sept. 2.&nbsp; Subscribe to the Bellingcat newsletter Subscribe to our newsletter for first access to our published content and events that our staff and contributors are involved with, including interviews and training workshops. When Judge Ellis asked Bovino to produce all use-of-force reports since Sept. 2 from agents involved in Operation Midway Blitz by the end of Tuesday, Bovino said it would be impossible because of the “sheer amount”. Ellis then ordered Bovino to turn over these reports, along with the accompanying body camera footage, by the end of Friday, Oct. 31. The court order places restrictions on federal agents’ crowd-control measures within the state, including their use of “riot control weapons” such as tear gas and pepper spray, the use of force against individuals and requiring people to leave public spaces that they lawfully have the right to be in.&nbsp; A subsequent court filing on Oct. 27 alleges that federal agents have violated the TRO “almost every day” since it was issued. “Immigration enforcement does not typically require the daily use of tear gas on civilians in residential areas,” the filing stated. Bellingcat’s analysis of social media videos from 28 events in Illinois from Oct. 9 to Oct. 27 found multiple examples of force and riot control weapons being used. In total, we found seven that appeared to show the use of riot control weapons when there was seemingly no apparent immediate threat by protesters and no audible warnings given. Nineteen showed use of force, such as tackling people to the ground when they were not visibly resisting. Another seven showed agents ordering or threatening people to leave public places. Some of the events identified showed incidents that appeared to fall into more than one of these categories.&nbsp; You can view the full dataset here.&nbsp; View this post on Instagram A post shared by Evident Media (@evidentmediaorg) It is important to note that the full context of an incident may be unclear from videos on social media alone. Bystanders often only begin filming when an arrest is already ongoing, for example, which can make it difficult to determine what happened in the moments before force was applied. Each of the events included in our dataset were verified to have taken place in Illinois in recent weeks with at least two sources – videos taken by different people, local reporting or statements from the Department of Homeland Security (DHS). The DHS –&nbsp;which oversees Customs and Border Patrol (CBP) as well as the United States Immigration and Customs Enforcement (ICE) – has justified the use of force or riot control weapons by saying that protesters were threatening or attacking agents.&nbsp; Bellingcat asked DHS whether it had any response to the TRO or allegations that agents had violated the TRO. In a response received after the publication of this piece, Assistant Secretary Tricia McLaughlin did not directly address the TRO but said DHS officers “only use crowd control methods as a last resort when repeated warnings have been given”.&nbsp; DHS also said, several times in its response, that its officers were “facing a 1000% increase in assaults against them”. This is a claim that the department has previously made when commenting on clashes with protesters during immigration operations in other cities such as Los Angeles and Portland. However, an NPR analysis of court records earlier this month only showed about a 25 percent rise in charges for assault against federal officers through mid-September, compared with the same period a year ago. Support Bellingcat Your donations directly contribute to our ability to publish groundbreaking investigations and uncover wrongdoing around the world. Donate The TRO does say that riot control weapons or force may be deployed in circumstances such as where there is an “immediate threat” of physical harm to the agents or others, multiple warnings have been given, or where “necessary and proportional” for an arrest. We did not include videos where it was obvious that such conditions had been met.&nbsp; Despite the limitations, videos taken by eyewitnesses are often the only evidence of such incidents, which may not be reported by media or may have concluded by the time journalists reach the scene. Riot Control Weapons In our analysis, we found videos showing the use of riot control weapons such as tear gas, pepper spray and other less-lethal weapons in seven events where protesters appeared to be posing no visible threat in the footage, and where no audible warnings appeared to be given.&nbsp; Among its provisions, the TRO prohibits the use of these types of weapons on people “who are not posing an immediate threat to the safety of a law enforcement officer or others” and also in cases where using them on intended targets would result in injury to those who aren’t posing any threat.&nbsp; One of these videos captured the moment Bovino threw what looked like a tear gas canister during the Oct. 23 clashes in the Little Village neighbourhood, during an operation where eight people were arrested, including a 16-year-old US citizen. Bovino and DHS have said that he was hit on the head by objects thrown by protesters before he threw the tear gas canister.&nbsp;&nbsp; Border Patrol Commander Gregory Bovino throwing a tear gas canister into a group of protesters in Little Village. Source: Instagram / @littlevillagelocal DHS posted a video on Facebook, claiming that it was evidence that “the use of chemical munitions was conducted in full accordance with CBP policy and was necessary to ensure the safety of both law enforcement and the public”.&nbsp; The video showed a rock skidding on the ground behind Bovino, but did not show the moment that it allegedly hit the Border Patrol chief on the head. A protester who filmed the encounter has reportedly disputed that Bovino was hit.&nbsp; Tear gas was also deployed on Oct. 12 in Albany Park, Oct. 14 in the East Side of Chicago, Oct. 24 in Lakeview and Oct. 25 in Avondale. Bellingcat reviewed footage of each of these incidents and could not see threats to the agents’ safety in the videos before tear gas was deployed, or that audible warnings were issued within the footage. Videos we reviewed also showed other types of riot-control weapons mentioned in the TRO. Another video from the Oct. 23 protests in Little Village, posted by a protester named Enrique Bahena, shows an agent shooting a less-lethal projectile directly at the person filming. An Oct. 26 court filing said Bahena was shot in the “neck from five feet away with a pepper ball”.&nbsp; A federal agent shooting in the direction of a person filming with a B&amp;T GL06 40mm less-lethal launcher in Little Village. Source: YouTube / @BlockClubChi Bellingcat’s analysis of the video, which appears to be the same one shown in screengrabs in the court filing, found that the video in fact shows the agent deploying a B&amp;T GL-06 40mm launcher, which can be used to launch chemical irritant rounds such as the one visible in the video.&nbsp;&nbsp; Top left: Federal Agent with B&amp;T GL06 40mm launcher (red box) before aiming. Source: Facebook / Draco Nesquik, annotation by Bellingcat; top right: reference image of a B&amp;T GL06 40mm launcher. Source: B&amp;T USA; bottom left: Border Patrol Agent at the same scene with a PepperBall gun. Source: Youtube / @BlockClubChicago, annotation by Bellingcat; bottom right: image from the manual of a TAC-SF PepperBall gun showing the general arrangement. Source: PepperBall Bahena said in an interview with local outlet Chicago Block Club that agents did not give warnings before they shot him “in the throat” and threw gas canisters at the group of protesters who were shouting at them to leave. He also said in the interview that protesters did throw objects at agents, but that this was after agents had already used force. B&amp;T technical specifications for their 40mm projectiles state that “shots to the head, neck, spine, or heart are to be avoided unless lethal force is justified”, and advise users to aim at the waistline.&nbsp; A DHS Office of Inspector General Report in 2021 states that “ICE’s use of force policy indicates that the 40MM launcher is deadly force when fired at someone, while the CBP use of force policy only directs officers not to target a person’s head or neck”. During this same event in Little Village, videos show other officers appearing to fire less-lethal weapons towards protestors. Left: A federal officer appearing to fire pepper balls at protestors in Little Village on Oct. 23. Source: Facebook / Ismael Cordova-Clough; right: zoomed in view of the same scene by Bellingcat The TRO restricts the use of Compressed Air Launchers or Munitions Launchers such as 40mm launchers to strike a person, including on the neck, unless they pose an “immediate threat of causing serious bodily injury or death”.&nbsp;&nbsp; In another incident on Oct. 22, an agent appeared to quickly roll down a window and spray what appeared to be a chemical irritant at protesters who were confronting federal officers near a Sam’s Club store in the Cicero neighbourhood of Chicago.&nbsp; The incident was captured in two separate livestreams, which show a few protesters near an unmarked dark grey Chevrolet Tahoe with no front licence plate. One of the protesters taps on the window of the vehicle. Someone then rolls down the window and sprays what appears to be a liquid very quickly before rolling the window back up as the car leaves the scene. One of the people filming said in the post for the livestream that this was pepper spray, although Bellingcat was unable to verify this.&nbsp; An officer spraying a chemical agent, said to be pepper spray, from the back seat of a vehicle. Source: Facebook/ Eddie Guillen (at 23:16) DHS did not respond directly to Bellingcat’s questions about whether it believed that the use of riot-control weapons – including during the Oct. 23 Little Village protests – was justified based on the terms of the TRO.&nbsp; Use of Force Bellingcat also reviewed multiple videos of agents using force in arrests that appeared to be related to Operation Midway Blitz, and identified those where the force shown being used looked potentially excessive and the person being arrested did not appear to pose an “immediate threat of physical harm to others” – a requirement in the TRO for using force such as tackling or shoving someone to the ground. On Oct. 10, a day after the TRO was issued, an ICE agent was seen dragging a teenage girl out of a car in Hoffman Estates, a suburb of Chicago, and tackling her to the ground while she shouted &#8220;I&#8217;m not resisting&#8221;. The teenager, reportedly an 18-year-old US citizen, was handcuffed and an officer appeared to put a knee on her back. DHS Assistant Secretary McLaughlin said in a post that the incident was a &#8220;burglary&#8221; arrest from 2024 which did not involve ICE – although this has been debunked by multiple news outlets. Bellingcat asked DHS about this specific incident and why McLaughlin’s post remains up on X despite multiple news outlets verifying that the incident took place this month in Hoffman Estates, but did not receive a response.&nbsp; Screenshot of a video of a teenager’s arrest in Hoffman Estates. Source: Facebook / Ismael Cordová-Clough This was not the only case where DHS’ version of events appears to contradict video footage of the incident posted on social media.&nbsp; On Oct. 22, a woman identified by DHS as Isabel Mata was arrested by Border Patrol agents in Little Village. A video of the incident shows multiple agents tackling her while one of them has his knee on her back to hold her to the ground. DHS stated Mata “allegedly threatened a law enforcement officer after stating she would put a hit out on Chief Gregory Bovino”. Bellingcat reviewed a video that showed the minutes before Mata was tackled by agents but did not hear any threat being made, even though Mata appeared to have been standing near the person filming. DHS initially did not respond to Bellingcat’s questions about this incident,&nbsp;but after publication it sent us the same statement it made on Oct. 24 with the allegation that Mata had threatened Bovino. Another video from Oct. 10 appears to show agents colliding with a car on Hubbard Street and dragging the driver out by her legs. The woman, identified as Dayanne Figueroa, told Newsweek that she was on her way to get coffee before work and &#8220;instead of handling the situation as a routine traffic incident”, masked armed agents forcibly removed her without questions or informing that she was under arrest. DHS reportedly told Newsweek that Border Patrol was making a targeted arrest when Figueroa&#8217;s vehicle blocked agents and struck an unmarked government vehicle. They also said she “violently resisted” and was arrested for assault on a federal agent. The video shows agents arresting someone, before one of their vehicles swerves into another lane and appears to hit Figueroa’s car. Multiple bystanders can be heard shouting that the agents hit Figueroa’s car first and that they were making a U-turn in the middle of the street. Left: Screenshot of a video showing Dayanne Figueroa’s arrest. Source: YouTube/ Fernando Figueroa; right: screenshot of video showing Isabel Mata’s arrest. Source: Facebook/ Ismael Cordová-Clough Bellingcat asked DHS about the conditions under which it would consider the use of force – such as tackling or shoving people to the ground – proportionate and necessary, but did not receive a direct response to this question.&nbsp; Dispersal Orders The TRO prohibits federal agents from “issuing a crowd dispersal order requiring any person to leave a public place that they lawfully have a right to be, unless dispersal is justified by exigent circumstances as defined by Department of Homeland Security Use of Force Policy”.&nbsp; Bellingcat has asked DHS about when agents are justified in telling people to get off the streets, or people in cars to stop following them, and whether there are any laws preventing people from following or filming federal agents from a distance. DHS did not respond to these questions in their response after this story was published. However, we found several examples of agents telling people to leave public places when they did not appear to be impeding arrests in video footage.&nbsp; In a video recorded in Chicago’s Arlington Heights on Oct. 24, a masked man with a rifle tells someone filming to “get the f*** across the street” and “get back to your car”. The person filming is shouting that agents have assaulted a woman and slapped her phone out of her hands, and the video appears to show a woman in a scuffle with a masked agent. A separate video from the same location and date shows agents arresting a man who is on the ground.&nbsp; Left: screenshot of a video appearing to show a federal agent in a scuffle with a woman in Arlington Heights. Source: Facebook/ GMV Podcast; right: the same agent seen involved in an arrest nearby on the same day. Source: TikTok / @luisjavi04 In some of these cases, agents appear to be pointing non-lethal weapons at civilians while ordering them to leave public spaces. A video from Oct. 16 shows agents telling protesters to “get out of the street”, pointing pepper spray at them and threatening them with arrest in Chicago’s Evanston neighbourhood. A plainclothes agent filmed pointing pepper spray at a protester in Evanston. Source: &nbsp;Instagram / orchidstrueblue A similar incident took place in Rolling Meadows on Oct. 19 when an officer was pictured pointing a pepper ball gun from a moving vehicle at a person filming him in a parking lot. A federal judge reportedly said the incident was &#8220;troubling&#8221; and has called for answers.&nbsp; On Oct. 20, in Berwyn, an agent pointed a gun at a woman who said she was pregnant. By the woman’s account, the agents were chasing after two people and the video shows her honking to alert those nearby. A DHS agent told Newsweek that the agent “acted to protect his life and safety of others around him and showed great restraint”. Left: Screenshot of a video showing a federal agent pointing a pepper ball gun from a moving car at a protester. Source: TikTok / ericcervantes25; right: screenshot of a video of an agent pointing a gun at a woman in Berwyn. Source: TikTok / chiquibaby317 Judge Ellis’ TRO is set to expire on Nov. 6. There is a scheduled hearing the day prior, Nov. 5, to determine if the TRO should be converted into a preliminary injunction.&nbsp; Editor’s Note (Oct. 31): This story was updated to include a response by the Department of Homeland Security who responded to our request for comment after publication. Pooja Chaudhuri, Kolina Koltai, Youri van der Weide, Sebastian Vandermeersch, Melissa Zhu and Trevor Ball contributed research to this piece, alongside Fraser Crichton, Olivia Gresham, Bonny Albo and Vladimir Zaha from Bellingcat’s Global Authentication Project. Bellingcat is a non-profit and the ability to carry out our work is dependent on the kind support of individual donors. If you would like to support our work, you can do so&nbsp;here. You can also subscribe to our Patreon channel&nbsp;here. Subscribe to our&nbsp;Newsletter&nbsp;and follow us on Twitter&nbsp;here&nbsp;and Mastodon&nbsp;here. The post &#8216;Pattern of Extreme Brutality&#8217;: Tear Gas, Pepper Balls Among Weapons Deployed Against Protesters in Illinois appeared first on bellingcat.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:17:58.263859Z"
}