{
  "id": "latest-news-zdnet-com-2025-10-31-2fa6f58e",
  "source_id": "latest-news-zdnet-com",
  "guid": "ae7d9c4c-b5cc-43a6-aad5-412e532517ab",
  "title": "The best 5G phones in 2025: Is the iPhone 17 worth it?",
  "url": "https://www.zdnet.com/article/best-5g-phones/",
  "published_at": "2025-10-31T09:30:39+00:00",
  "fetched_at": "2025-10-31T11:15:56.596462Z",
  "status": "rejected",
  "content": {
    "raw": "We've tested almost all devices from brands like Apple, Samsung, and Google to find the best 5G phone for every kind of user.",
    "full": "The best 5G phones to buy in 2025\nWhy you can trust ZDNET\n'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest mobile deals of the week\n- $350 (save $50)\n- $525 (save $125)\n- $300 (save $100)\n- $338 (save $291)\nFrom Samsung surprising us with the Galaxy Z Fold 7 to Apple giving its base iPhone 17 more Pro features, this has been a great year for smartphones. They've also been pretty affordable with some of the best phones of 2025 are priced below $1,000. I've shortlisted phones starting at $300 and up to $1,800 in several form factors.\nWhether you need a pro-grade smartphone or want to save on expenses, you don't have to break the bank to get the best 5G experience. ZDNET tested and reviewed a plethora of 5G phones to help you choose the best device for your needs.\nGet more in-depth ZDNET tech coverage: Add us as a preferred Google source on Chrome and Chromium browsers.\nWhat is the best 5G phone right now?\nWe've tested dozens of devices, and our pick for the best 5G phone overall is the Samsung Galaxy S25 Ultra. It features the best display on a phone in 2025, a bunch of useful AI features, and plenty of power under the hood. All flagship phones have versatile cameras and big and sharp displays, but aspects like these set this Samsung phone apart from the rest.\nThe newiPhone 17 also comes close and wins in terms of value. This is the closest a base iPhone has gotten to its Pro sibling, and it is my go-to recommendation this year.\nHowever, the best 5G phone depends on what you want and how much you are willing to invest in it. For instance, some might need the best cameras, while others would like to have a foldable. We've picked the best 5G phones for every need.\nThe best 5G phones in 2025\nWhy we like it: The Samsung Galaxy S25 Ultra is the best Android phone we've tested. I like it for its display. The anti-reflective coating paired with the high contrast of Samsung AMOLED display makes it the best screen on a smartphone. It also offers the most polished set of AI features with Galaxy AI including real-time phone call translations, AI Select tool that offers contextual shortcuts based on on-screen content, and more.\nUnder the hood, you get an upgraded Snapdragon 8 Elite for Galaxy chipset for improved graphics and efficient performance. Samsung has done a great job at extracting the best of battery life from its 5,000mAh cell. This means you can expect the phone to last an entire day with ease.\nThe Galaxy S25 Ultra is made of a lightweight yet durable titanium frame and features Corning's Gorilla Armor 2. This is ideal for users who worry about damaging or scuffing up their devices. Another upgrade includes the presence of a 50MP ultrawide lens that produces greater detail and vividness when capturing landscape and macro shots.\nReview: Samsung Galaxy S25 Ultra\nWho it's for: The S25 Ultra's price is still fairly inaccessible at $1,300, but it regularly goes on sale for around $1,000. It is for those who want the best of Android in a big phone form factor.\nWho should look elsewhere: If you are coming from a previous-generation Galaxy S-series flagship and love the S Pen, this phone is not for you. The Galaxy S25 Ultra's S Pen no longer supports Bluetooth gestures. Plus, this is not the most ergonomic device due to its sharp edges. you can look at the Google Pixel 10 Pro XL if you want a comfortable to hold big Android phone.\nSamsung Galaxy S25 Ultra specs: Processor: Qualcomm Snapdragon 8 Elite for Galaxy | Display size: 6.9 inches | Storage options: Up to 1TB | Rear cameras: 200MP main, 50MP ultrawide, 50MP telephoto with 5x zoom, 10MP telephoto with 3x zoom | Front camera: 12MP | Battery: 5,000mAh | Price: Starting at $1,300\nWhy we like it: This is the closest Apple's base iPhone has gotten to its Pro sibling. The iPhone 17 adds several premium features including the 120Hz ProMotion display, 40W wired charging, and better performance, making it the most value-for-money phone out there.\nI love the display. It sports slimmer bezels, is bright enough to be legible under direct sunlight and is superlight to hold for day-to-day tasks. It isn't bulky at all. It also brings an all-new 18MP Center Stage front camera that can adaptively expand its framing to fit more people into shots. Having a square sensor also allows users to capture landscape selfies without needing to rotate the phone.\nAdd in solid battery life, the reliable A19 chip, and a fun color lineup, and you've got a well-rounded device that delivers excellent value. Apple left no stone unturned this time as it also upgraded the base model to 256GB without increasing the price.\nReview: iPhone 17\nWho it's for: The iPhone 17 is a great choice for anyone who wants a modern iPhone with high-end features but doesn't need the full Pro experience, or price tag. If you care about reliable cameras, one-handed usability, and excellent performance, the iPhone 17 is the phone for you.\nWho should look elsewhere: If you're a power user or creator who needs features like a telephoto camera, a vapor chamber cooling system, or more advanced videography features, you should look at the iPhone 17 Pro series.\niPhone 17 specs: Processor: Apple A19 | Display size: 6.3 inches with 120Hz refresh rate | Storage options: 256GB, 512GB | Rear cameras: 48MP wide, 12MP ultra-wide | Front camera: 18MP | Colors: Lavender, Sage, Mist Blue, White, Black | Weight: 177g | Starting price: $799\nWhy we like it: The Galaxy Z Fold 7 is the best foldable phone you can buy right now, and it will remain this way for another few months. Samsung gave it an ultra-thin form factor with a versatile camera system and an efficient processor.\nWhen I first started using the Galaxy Z Fold 7, I loved the design but was skeptical of the battery life. After all, it is just a 4,400mAh cell. But kudos to Samsung, the company has managed to extract the best efficiency from its Snapdragon 8 Elite for Galaxy processor to deliver an all-day battery life. It also sports a wider, more regular aspect ratio on the cover display, which is more intuitive and comfortable to use.\nWhile the foldable doesn't match its Ultra sibling spec-for-spec, the Z Fold 7 delivers excellent performance and satisfactory optics with its versatile camera system led by a 200MP primary sensor. It offers the best foldable experience, thanks to Samsung's feature-rich approach to software.\nReview: Samsung Galaxy Z Fold 7\nWho it's for: If you want a book-style foldable phone, this is the device to get. The Galaxy Z Fold 7 offers excellent in-hand feel, reliable performance, good battery life and a satisfactory set of cameras.\nWho should look elsewhere: It isn't the most affordable smartphone. You're mostly paying for the innovation factor with this phone. So, if you're more interested in value-for-money propositions, you should look elsewhere.\nSamsung Galaxy Z Fold 7 tech specs: Processor: Qualcomm Snapdragon 8 Elite | Display sizes: 6.5-inch exterior and 8-inch interior | Storage options: 256GB, 512GB, or 1TB | Rear cameras: 200MP wide, 12MP ultrawide, 10MP telephoto | Front cameras: 10MP front | Battery: 4,400mAh | Price: Starting at $2,000\nWhy we like it: The Moto Razr (2024) was our pick for the best compact Motorola phone last year and its 2025 variant carries on the legacy. The Razr 2025 is mostly a similar phone, but with an upgraded processor and bigger battery. So, you get smoother performance, better software longevity, and a longer battery backup.\nThis is my pick for the best flip phone because of its price. The Motorola Razr 2025 is a solid phone at an excellent price. You get a big 3.6-inch pOLED display with a 90Hz refresh rate, so it doesn't feel less functional than its more expensive sibling, the Motorola Razr Ultra. It also supports wireless charging and offers a good primary camera, decent performance, and intuitive user interface\nReview: Motorola Razr 2025\nWho it's for: The Motorola Razr 2025 is great for anyone in the market for a flip phone but doesn't want to spend $1,000. It offers just the right compromises to land at a good price-to-performance ratio. You won't be disappointed by the overall usability.\nWho should look elsewhere: There's not much to fault with the Razr, currently on sale for $600. However, if you want flagship performance on a flip phone, this isn't for you. You'll need to increase your budget or buy a flip phone for that requirement.\nMotorola Razr 2025 specs: Display: 3.6 inches (cover screen), 6.9 inches foldable display | Processor: MediaTek Dimensity 7400X | Cameras: 50MP primary, 13MP ultrawide | RAM: 8GB | Storage: 256GB | Battery: 4,500mAh\nWhy we like it: The iPhone 17 Pro Max might be expensive, but if you want your phone to last more than a day with ease, with no compromises, this is the phone to buy. It is rated for a battery life of 39 hours on video playback. From our tests, we found the phone lasted much longer than the standard 17 Pro and last year's 16 Pro Max.\nThe iPhone 17 Pro Max is the best iPhone overall due to its super-packed feature set. It is the iPhone model that sets a new standard for Apple this year and a worthy competitor to Samsung's S Ultra series and Google's Pixel Pro XL.\nThe iPhone 17 Pro Max looks and feels different from its predecessor. It is now made with aluminum instead of titanium and gets a pop of Cosmic Orange color. The most notable hardware change with the latest iPhone is the vapor cooling chamber. It works in tandem with the updated A19 Pro chip to optimize and maintain performance loads. This feature is ideal for photographers and videographers who often experience recording issues due to the iPhone overheating.\nReview: iPhone 17 Pro and Pro Max\nWho it's for: The iPhone 17 Pro Max is a flagship phone that commands a flagship price. It's made for those who are willing to pay for the best iPhone available. If you are, you get the best battery life on a 2025 smartphone alongside a very capable camera system and pro-grade video features.\nWho should look elsewhere: If you're shopping on a budget and don't mind a smaller screen, consider the $1,099 iPhone 17 Pro. It's $100 cheaper and with a 6.3-inch display. However, if your priority is just the battery life and want to spend as low as possible ,you can also look at the Motorola Moto G Power.\niPhone 17 Pro Max specs: Processor: Apple A19 Pro Bionic | Display size: 6.9 inches with 120 Hz refresh rate | Storage options: 256 GB, 512 GB, 1 TB, 2 TB | Rear cameras: 48 MP wide, 48 MP ultra-wide, and 48 MP 4× telephoto | Front camera: 18 MP | Colors: Cosmic Orange, Deep Blue, Silver | Weight: 233 g | Starting price: $1,199\nWhy we like it: The Google Pixel 9a is unlike Apple's iPhone 16e, meaning that it still starts at the same $499, despite the upgrades on the processor, display, and battery.\nThis Google budget phone features an updated design and borrows the Tensor G4 chipset from last year's flagship Pixel 9 Pro. While it scores lower numbers in benchmark tests than the flagship phone, it remains a capable device. I love the bigger 6.3-inch OLED screen, which is an improvement over Pixel 8a's 6.1-inch display.\nThe Google Pixel 9a offers a 120Hz refresh rate display and brings improved brightness. This makes the screen look more legible than before, especially in outdoor conditions. The new Google phone also has the biggest battery for an A-series Pixel phone, 5,100mAh, which will likely last you an entire day.\nThe Pixel 9a gets you a smooth and responsive day-to-day experience. It carries over the Titan M2 chip as well as a built-in VPN for added security. Google upgraded the optics, too. You get an improved 48MP main sensor and the same 12MP ultrawide-angle camera. The 13MP selfie shooter remains unchanged as well. These offer great camera processing, skin tones, and lovely lowlight results. It's great for hobbyist shutterbugs and professional photographers alike.\nWho it's for: If you are strictly on a budget but don't want to compromise on the flagship Google experience, the Pixel 9a is for you. Buy it for the longevity and experience.\nWho should look elsewhere: If you want the best display, battery life and performance under $500, the OnePlus 13r is a better choice, if you're ok with fewer software updates.\nReview: Google Pixel 9A\nGoogle Pixel 9a specs: Processor: Google Tensor G4 with Titan M2 | Display: 6.3 inches | Storage options: 128GB/256GB | Rear cameras: 64MP Quad PD Bayer, 13MP ultrawide, 13MP front | Battery capacity: Typical 4492mAh | Price: Starting at $499\nWhat is 5G, and do I need it in 2025?\n5G is the fifth-generation mobile network after 4G. Almost all 2025 smartphones support 5G, and for good reasons. The network delivers higher multi-Gbps peak data speeds with ultralow latency and more reliability than 4G. It has massive network capacity and increased availability.\nAccording to Qualcomm, 5G is set to impact \"every industry, making safer transportation, remote healthcare, precision agriculture, digitized logistics -- and more -- a reality.\" You need 5G on your phone for a more uniform user experience with faster speeds.\nBest 5G phones compared\nThere are a plethora of 5G phones in the market but these are some of the best that you can buy right now. The Galaxy S25 Ultra remains are top pick even at the end of the year, while the iPhone 17 is a surprisingly good value. Here's how all of these phones compare.\n| Best 5G phone | Price | Storage | Screen size | Battery size | Processor |\n| Samsung Galaxy S25 Ultra | $1,142 | Up to 1TB | 6.9 inches | 5,000mAh | Qualcomm Snapdragon 8 Elite for Galaxy |\n| Apple iPhone 17 | $799 | Up to 512GB | 6.3 inches | n/a | Apple A19 |\n| Samsung Galaxy Z Fold 7 | $1,500 | Up to 1TB | 6.5 inches and 8 inches | 4,400mAh | Qualcomm Snapdragon 8 Elite for Galaxy |\n| Motorola Razr (2025) | $600 | 256GB | 3.6 inches and 6.9 inches | 4,500mAh | MediaTek Dimensity 7400X |\n| Apple iPhone 17 Pro Max | $1,199 | Up to 2TB | 6.9 inches | n/a | Apple A19 Pro |\n| Google Pixel 9a | $485 | Up to 256GB | 6.3 inches | 5,100mAh | Google Tensor G4 |\n*MSRP at the time of writing\nWhich cheap 5G phone is right for you?\nConsider whether you prefer Apple or Android, if you care more about price or premium features, as well as how you'll be using the phone.\nOnce you address those needs, you can refer to the chart below to quickly find the right 5G phone for you.\n| Choose this 5G phone... | If you want... |\n| Samsung Galaxy S25 Ultra | A flagship full of extras. The Galaxy S25 Ultra is for those who want their phone to be packed with features to the brim. You get an excellent display, great performance, versatile set of cameras and S Pen. |\n| Apple iPhone 17 | A creator-centric phone at a budget. The iPhone 17 is the best phone for creators because it has no competition when it comes to filming, editing and processing with a smooth workflow at around $800. |\n| Samsung Galaxy Z Fold 7 | A productivity-focused 5G phone. The Galaxy Z Fold 7 is the best foldable of the year and becomes no brainer if you want a folding phone. |\n| Motorola Razr (2025) | The most compact 5G phone. Get the Razr 2025 if you want a flip phone without compromising on screen sizes. |\n| Apple iPhone 17 Pro Max | Best battery life on a phone. The iPhone 17 Pro Max will last you a day on heavy use and extend to almost two days on moderate use. It is also a prosumer-focused phone. |\n| Google Pixel 9a | Best budget 5G phone. The Pixel 9a should be your pick if you want an affordable 5G phone. |\nFactors to consider when buying a 5G phone\nWhen shopping for a new, or at least new-to-you, 5G phone, there are a few factors to keep in mind so you don't end up with a dud of a smartphone:\n- Display: Consider factors like reflectivity and smudges. A phone with 2,000 nits of brightness wouldn't be of much use if it attracts smudges easily. You'd also want to have a sharp and vibrant screen with a high refresh rate for gaming.\n- Performance: For many, smartphones are the center of our lives, which means the best ones are performant and can handle most, if not all, tasks you throw at them.\n- Camera: One of the most important features on smartphones in recent times; the consistency and reliability of a camera system can make or break the overall mobile experience. We test every device in broad daylight and in the darkest of nights when finalizing this list.\n- Battery: Every option in this guide should last you at least a day of moderate use. We also consider what devices support fast charging and/or wireless charging.\n- Value: Price points are noted, but the most important thing with buying a phone is getting your money's worth. With these picks, you can rest assured that you're getting the best bang for your buck.\nHow we test 5G phones\nAt ZDNET, we undertake an extensive phone testing process for every device. While testing and researching each 5G phone featured on this list, I kept these criteria in mind:\n- User experience: I rate user experience and reliability in high regard. Because what's a device if on-paper specifications don't translate to real-life advantages? I've used every phone on the list and written from my experience.\n- Display: I used these phones to surf the web, read on Kindle, Chrome and other apps, and scroll through social media. These were also used for watching movies and TV shows on streaming apps like Netflix and Amazon Prime.\n- Performance: Several factors affect a phone's performance, including user interface, LTE/5G signal, battery life, and more. Therefore, we typically begin our evaluations with a fully charged handset, with all background tasks closed, and with as stable of a mobile connection as possible.\n- Camera quality: ZDNET tests phone cameras by capturing hundreds of photos and videos of various subjects and in various lighting conditions. We also compare the output to that of older models.\n- Battery life and charging: It's also important for us to evaluate how long phones last under light, moderate, and heavy usage, how long they take to recharge, and how they do it (wired, wireless, or both).\n- Special features: These features distinguish tested devices from a bustling smartphone market and hopefully bring added value to users, not the opposite.\n- Pricing and availability: Beyond budget considerations, we also note if a phone is available in the US or only internationally.\nLatest news on 5G phones\n- If you are experiencing more typos than usual on your iPhone, you're not alone. There's a bug that enters unwanted characters while you type.\n- Samsung is rumored to launch the Galaxy S26 with a new in-house Exynos 2600 processor.\n- AT&T has some competitive offers on Google Pixel 10 phones right now. New and existing customers can get a Google Pixel 10 Pro or Pixel 10 Pro XL free when they trade in their old Pixel phone of any year and any condition.\n- Android users are getting a huge photo editing upgrade in Google Photos. Previously exclusive to the latest Pixel 10 lineup, you can now edit photos with a simple AI prompt.\nFAQs about 5G phones\nAre all smartphones 5G compatible?\nNo, not all smartphones are 5G compatible. It depends on the chipset they're using. However, almost all phones on sale in 2025 are 5G compatible. Annoyingly, most of these smartphones come with a \"5G\" moniker at the end of their names, which is a sure shot way of knowing that they are 5G compatible.\n4G, 5G, and LTE compared: Major differences explained\n3G was succeeded by LTE, which stands for \"Long Term Evolution\" towards the 4G standard. The term is used interchangeably with 4G, but they are not the same. LTE lies between 3G and 4G and filled the enormous gap in performance when the latter was rolling out to the masses. LTE was rated to offer up to 100Mbps speeds, while 4G could go up to 1 Gbps but remained mostly around 200Mbps, depending on the network.\nUnlike, previous generations, there are three kinds of 5G network, low-band 5G, mid-band 5G, and high-band 5G, all with different speeds and latency rates. The high band can go up to 20Gbps speed. The new network heavily depends upon reducing latency to get high-speed internet.\nWhy does my phone keep switching from 5G to 4G?\nIf you've noticed your smartphone switching between 5G and 4G throughout the day or as you travel, there's no need to panic. Since 5G cellular networks are still relatively new, they aren't as widespread as you may think they are thanks to clever advertising from mobile carriers. That means that depending on your location, your phone may not have access to a reliable 5G network, but a 4G connection will be available to keep you connected.\nShould I buy a refurbished 5G phone to save money?\nBuying a secondhand 5G phone can be a great way to save money on a new-to-you device, but there are a few things to keep in mind before you buy:\nBuying used means that products may not be under warranty anymore, or have very limited warranties that only cover certain things like theft and loss. This also means that you may want to spring for any extra device insurance or warranties that retailers offer on pre-owned devices, just in case you end up with hardware issues or a dud phone.\nBuying a refurbished phone also means that you have to pay attention to the condition of the 5G phone you're looking to buy secondhand. Many retailers that offer secondhand devices will often list their condition as: open-box, like- new, good, fair, and poor. Open-box usually means that an item was returned to the store by a previous customer for one reason or another. Open-box items usually will still have everything included with them like charging cables and documentation.\nOther condition tags are used for items that have been traded in as part of a purchase of a new device. These range from lightly used for a few months to something that looks like went through a tornado. It's important to keep an eye on what condition the used 5G phone you want to buy is in so you don't end up with something meant to be stripped for parts.\nCan I recycle my old smartphone?\nIf you don't trade in your previous smartphone when you purchase a new one, recycling your electronics is a great option to help reduce e-waste in landfills as well as clutter in your own home.\nYou can read our helpful guide on what to do with your old smartphone to find out more about how to prep your smartphone for sale, trade-in, or recycling.\nLatest updates\n- In our October update, we added fresh information on the already-mentioned products.\n- In our September 2025 update, we performed an overhaul and revamped the list completely by replacing all products.\nOther 5G phones to consider\nThere are a few really good 5G smartphones that didn't make it to the list due to either lesser software support or the overall value factor didn't match our pick. But you can also consider these 5G phones:\nThe Google Pixel 10 Pro is a good alternative to flagship Apple and Samsung phones.\nIt gets you an efficient LTPO display, satisfactory performance, MagSafe-like PixelSnap feature, and plenty of Gemini smarts alongside the signature Google software.\nIt also supports 100x ProRes AI zoom, which enhances the photos that are shot past 30x zoom.\nWhile not as powerful as the Moto G Power, this phone starts at just $250, making it a great budget-friendly option.\nIt is my go-to Motorola phone for those looking for an affordable pick.\nYou get a big screen, satisfactory cameras and a long-lasting battery life without any major compromises for that price.\nRelated review: Moto G 2025\nIf you're looking for a more premium flip phone experience, the Galaxy Z Flip 7 is a great Motorola Razr alternative.\nYou get a highly customizable One UI 8 software experience, but the cover screen is limiting when compared to the Razr Ultra. That said, Samsung manages to undercut its Moto rival by $200.\nYou get an all-day battery life, thanks to a bigger 4,300mAh cell, reliable cameras and two big and bright displays.\nReview: Samsung Galaxy Z Flip 7\nFor more, check out our top flip phone picks, our favorite Android phones, and how the new iPhone 17 models compare.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-31T11:19:22.436100Z"
}