{
  "id": "latest-news-zdnet-com-2025-10-31-4b80680c",
  "source_id": "latest-news-zdnet-com",
  "guid": "b61e5e3e-ffc6-431e-8358-277f430643d6",
  "title": "We put the best portable power stations to the test. Here's which ones provide the most power",
  "url": "https://www.zdnet.com/article/we-put-the-best-portable-power-stations-to-the-test-heres-which-ones-provide-the-most-power/",
  "published_at": "2025-10-31T10:00:36+00:00",
  "fetched_at": "2025-10-31T11:15:56.596297Z",
  "status": "rejected",
  "content": {
    "raw": "We rigorously tested eight top portable power stations from Jackery, Anker, Bluetti, EcoFlow, and more in our lab to find out which ones are the most efficient.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nWe put the best portable power stations to the test - and these 3 provide the most power\nFollow ZDNET: Add us as a preferred source on Google.\nWhen you think of the best portable power stations, you might think of how easy it is to carry them or travel with them. But what you might forget is that these smaller devices still provide lots of power, whether you're going off-grid, need a source of power during an outage, or are simply camping for the weekend.\nAlso: The best portable power stations for camping\nWe ran dozens of portable power stations through the gauntlet in our lab in Kentucky, where we evaluated how much power each station can provide compared to how much it draws to charge, to determine its overall efficiency. The portable power stations that stood out above the rest were the Jackery Explorer 2000 Plus, the DJI Power 1000, the Vtoman FlashSpeed 1500, and the Oupes Mega 1.\nPortable power stations were tested for power use over time, measured in watt-hours (the total amount of energy used or produced). We chose to compare the following eight portable power stations based on our editors' top picks and what we have personally gone hands-on with in real-world situations:\n- Jackery Explorer 2000 Plus (see at Amazon)\n- Bluetti AC70 (see at Walmart)\n- Vtoman FlashSpeed 1500 (see at Amazon)\n- Anker 757 Powerhouse (see at Walmart)\n- DJI Power 1000 (see at B&H Photo)\n- Oupes Mega 1 (see at Amazon)\n- Anker Solix C800 Plus (see at Amazon)\n- EcoFlow River 3 (see at Best Buy)\nHow we tested these portable power stations\nOur lab testing process is centered around measuring the charge and discharge processes of each portable power station, with emphasis on the number of watt-hours consumed and discharged, respectively, and the time required to complete each process. Once all data is gathered, we also compared units using a \"Round Trip Efficiency\" metric that describes how efficiently a unit provides power compared to how much it draws to charge.\nThe testing apparatus consists of the unit under test (UUT), a HOBO plug load data logger, a computer to save the logged data, and a 480W LED light to consume power. During a charge test, the UUT is plugged into the wall in line with the data logger, which measures and logs the power (watt-hours) being drawn by the unit. The log shows us how long this process takes, giving us our two key takeaways (power and time).\nAlso: How we test portable power stations at ZDNET\nWe primarily test for watt-hours in either direction because they provide the best indication of power usage over time. A unit that provides 100 watts for 10 hours provides 1000 watt-hours. If you instead plug in a 200W load, the unit will only run for five hours, which still ultimately multiplies out to a capacity of 1000 watt-hours. Additionally, the time it takes to charge is a key metric of interest to people, and we measure the time to discharge when connected to a 480W load to provide a standard frame of reference for discharge times.\nThe results\nTo best understand our data visualizations, the power stations that had higher watt-hours compared to time charged were the top performers. This means that for portable power stations to charge to 100% (Figure 1), the top performers were the Jackery Explorer 2000 Plus and the Vtoman Flashspeed 1500. Although their overall time to a full charge is higher than some of the other options, these two power stations offer the best power usage over time. Another solid option power station from Figure 1 is the DJI Power 1000, since both the time to charge and the watt-hours are almost the same.\nPower stations that take longer to charge compared to their overall watt-hours are less efficient. In the case of Figure 1, that means the EcoFlow River 3. However, if price is the more important factor to you, this portable power station happens to be the cheapest of the ones we tested, at just $249.\nFigure 2, which shows the time it took portable power stations to reach a 50% charge, yields similar results, except that the Oupes Mega 1 appears as a notable outlier. Like the DJI Power 1000, the Anker 757 Powerhouse also has almost the same time to charge to 50% as the watt-hours.\nAlso: The best cheap portable power stations\nOur tests might differ from your own experience, depending on how you use a portable power station. However, as a general baseline, our testing provides an expert analysis of how these portable power stations perform and identifies the use cases for which they are best suited.\nWhat's the difference between a portable power station and a generator?\nThe primary distinction between portable power stations and gasoline generators lies in their energy sources and operation. Portable power stations are equipped with batteries that are pre-charged with electricity before use. In contrast, gasoline generators rely on gasoline, which is burned in an engine to produce electricity.\nFactors to consider when choosing a portable power station\nPower stations are a significant investment, but they can ultimately upgrade your camping experience to allow for power off-grid. Before making our top picks, we considered several factors.\n- Weight: Bigger isn't always better, especially when it comes to camping. Will the portable power station be wheeled down a paved trail, or will you be moving it from your vehicle to your camp? Do you want something you could carry in a backpack for a day?\n- Battery capacity: If you plan to power an RV or bigger devices from your power station, you want as much battery capacity as you can afford, but for off-grid adventures, it's important to bear in mind that there's a penalty here in the form of weight.\n- Cost: Some units cost several thousand dollars, while others cost a couple hundred. Plus, add-ons like battery packs and solar panels also increase the price.\n- Charging: How do you plan on charging your power station? Are you mostly going to use AC power from an outlet, or do you want the independence of solar?\n- Battery Chemistry: Lithium-ion (Li-ion) is the traditional battery technology, but the newer lithium iron phosphate batteries (LiFePO4) are safer and have a much longer lifespan.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-31T11:18:52.121087Z"
}