{
  "id": "latest-news-zdnet-com-2025-10-31-886ee026",
  "source_id": "latest-news-zdnet-com",
  "guid": "575d8711-4f9c-4bea-8980-f0ae20a04381",
  "title": "Another European agency shifts off Big Tech, as digital sovereignty movement gains steam",
  "url": "https://www.zdnet.com/article/another-european-agency-ditches-big-tech-as-digital-sovereignty-movement-gains-steam/",
  "published_at": "2025-10-31T09:59:58+00:00",
  "fetched_at": "2025-10-31T11:15:56.596380Z",
  "status": "rejected",
  "content": {
    "raw": "European Union states are increasingly shifting toward European-based companies that offer open-source solutions. Here's why.",
    "full": "Another European agency shifts off Big Tech, as digital sovereignty movement gains steam\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Austria's Ministry of Economy has migrated to a Nextcloud platform.\n- It's the latest move in a European trend to shift away from Big Tech.\n- European governments and agencies want to control sensitive data.\nEven before Azure had a global failure this week, Austria's Ministry of Economy had taken a decisive step toward digital sovereignty. The Ministry achieved this status by migrating 1,200 employees to a Nextcloud-based cloud and collaboration platform hosted on Austrian-based infrastructure.\nThis shift away from proprietary, foreign-owned cloud services, such as Microsoft 365, to an open-source, European-based cloud service aligns with a growing trend among European governments and agencies. They want control over sensitive data and to declare their independence from US-based tech providers.\nAlso: Europe's plan to ditch US tech giants is built on open source - and it's gaining steam\nEuropean companies are encouraging this trend. Many of them have joined forces in the newly created non-profit foundation, the EuroStack Initiative. This foundation's goal is \" to organize action, not just talk, around the pillars of the initiative: Buy European, Sell European, Fund European.\"\nWhat's the motive behind these moves away from proprietary tech? Well, in Austria's case, Florian Zinnagl, CISO of the Ministry of Economy, Energy, and Tourism (BMWET), explained, \"We carry responsibility for a large amount of sensitive data -- from employees, companies, and citizens. As a public institution, we take this responsibility very seriously. That's why we view it critically to rely on cloud solutions from non-European corporations for processing this information.\"\nAustria's move and motivation echo similar efforts in Germany, Denmark, and other EU states and agencies. The organizations include the German state of Schleswig-Holstein, which abandoned Exchange and Outlook for open-source programs. Other agencies that have taken the same path away from Microsoft include the Austrian military, Danish government organizations, and the French city of Lyon.\nAlso: Inside Canonical's plan to make Ubuntu 26.04 the Linux desktop that finally goes mainstream\nAll of these organizations aim to keep data storage and processing within national or European borders to enhance security, comply with privacy laws such as the EU's General Data Protection Regulation (GDPR), and mitigate risks from potential commercial and foreign government surveillance.\nOpen-source software is seen as combining the virtues of faster development and better security, while providing companies and governments with more control, as general manager Thierry Carrez of the OpenInfra Foundation recently suggested: \"Open infrastructure allows nations and organizations to maintain control over their applications, their data, and their destiny while benefiting from global collaboration.\"\nThe US government is worried about this trend. American diplomats have complained to French and German officials ahead of November's Summit on European Digital Sovereignty about the European push for digital sovereignty. This high-level event will bring together EU institutions, member states, public and private sector leaders, and other key stakeholders to advance Europe's digital sovereignty agenda.\nWhile the US may not like it, with NextCloud's help, BMWET completed its migration in just four months. Although BMWET had already begun adopting Microsoft 365 and Teams before the project's start, the shift was still considered a success. That's because instead of reversing its path, the ministry implemented a hybrid architecture: Nextcloud handles internal collaboration and secure data management, while Teams remains available for external meetings.\nThe project emphasized integration with existing workflows, including seamless integration with Outlook email and calendar via Sendent's Outlook app. This approach minimized disruption and ensured user acceptance. However, not all migrations progress so well.\nFor example, in Austria, the Ministry of Justice decided to replace Office with LibreOffice. Yet the transition has run into trouble. It appears that the move of 20,000 desktops, which was prompted by a desire to reduce spending on Microsoft licenses, has been, as one person reported, an \"unprofessional, rushed operation.\" Some offices are still on Office, others on LibreOffice, and they're running into incompatible document format problems and misfires in e-mail systems.\nAlso: 10 open-source Windows apps I can't live without - and they're all free\nThe moral of the story is that any switch from one software suite to another requires careful handling by the IT department and helpdesk staff. Otherwise, you end up with unhappy users.\nThat said, BMWET's bold shift to Nextcloud appears to have gone well. This initiative demonstrates that adopting sovereign cloud solutions can be practical, user-friendly, and rapid in the public sector. However, as Austria's Justice Ministry experience has shown, simply shifting to an open-source approach without careful planning can get in the way of getting work done.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-31T11:19:09.438805Z"
}