{
  "id": "latest-news-zdnet-com-2025-10-31-0f6c0bcb",
  "source_id": "latest-news-zdnet-com",
  "guid": "c8643424-3809-4382-890a-0c2a6d0b58a0",
  "title": "Pinterest's new shopping assistant finds products to fit your tastes - see how it works",
  "url": "https://www.zdnet.com/article/pinterests-new-shopping-assistant-finds-products-to-fit-your-tastes-see-how-it-works/",
  "published_at": "2025-10-31T18:47:09+00:00",
  "fetched_at": "2025-11-01T11:14:21.662011Z",
  "status": "rejected",
  "content": {
    "raw": "Endless scrolling for that perfect something eventually gets old. Pinterest's AI wants to keep shopping fresh.",
    "full": "Pinterest's new shopping assistant finds products to fit your tastes - see how it works\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Pinterest launched a beta version of its AI-powered shopping assistant.\n- Pinterest Assistant uses your previous app behaviors to find new items.\n- The feature is available to US users aged 18 and above, with wider availability to follow.\nInstead of spending hours scrolling through your Pinterest feed looking for the perfect decor inspiration, outfit idea, nail set, or tattoo idea, you can ask Pinterest's new AI-powered assistant to find exactly what you're looking for.\nAlso: Not sure what to buy? Amazon's latest shopping tool can help you decide - here's how it works\nPinterest Assistant uses your saves, boards, collages -- and those of other users with similar tastes -- to find posts that match your interests and style. According to Pinterest, Pinterest Assistant differs from other chatbots because users don't need to know what they're looking for to find it. Instead, Pinterest Assistant offers \"visual, personalized and proactive recommendations.\"\nHow does it work?\nPinterest says it gathers information from users' interests to feed its visual discovery tool called Taste Graph, which provides AI-powered recommendations to users. Pinterest claims its AI shopping assistant is \"visual-first,\" utilizing real-time, conversational descriptors to deliver personalized recommendations to shoppers.\nTo more closely replicate real-life shopping experiences, users can verbally relay their requests to Pinterest Assistant. For example, Pinterest says, users can ask the Assistant questions like, \"Show me holiday party dresses that fit my style.\"\nPinterest Assistant is available in beta to users aged 18 and above in the US. Wider availability is planned for the coming weeks and months, according to Pinterest.\nPinterest isn't the only online shopping platform to explore AI-powered search results, making shopping easier for customers. Amazon Lens enables users to point their camera at a product and receive similar products listed on Amazon, as well as suggested questions and product summaries. Another Amazon shopping tool uses AI to curate recommended items based on your shopping history and personal preferences.\nAlso: Your Uber driver has a new side hustle: Training AI for cash\nWalmart and Sam's Club recently announced a partnership with OpenAI to integrate ChatGPT into shoppers' shopping experiences, offering personalized item recommendations and grocery list planning.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:18:31.712149Z"
}