{
  "id": "latest-news-zdnet-com-2025-10-31-879dcb34",
  "source_id": "latest-news-zdnet-com",
  "guid": "49cbeb6f-6334-4400-8edf-2e2622bb0762",
  "title": "Why AI coding tools like Cursor and Replit are doomed - and what comes next",
  "url": "https://www.zdnet.com/article/why-ai-coding-tools-like-cursor-and-replit-are-doomed-and-what-comes-next/",
  "published_at": "2025-10-31T15:09:00+00:00",
  "fetched_at": "2025-11-01T11:14:21.663170Z",
  "status": "rejected",
  "content": {
    "raw": "The newfangled programming tools don't have what it takes to go the distance. Here's why.",
    "full": "Why AI coding tools like Cursor and Replit are doomed - and what comes next\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- AI-based coding tools won't be able to compete with the LLM giants.\n- Observability is one possible way to differentiate the tools.\n- Some startups will get acquired, others will go out of business.\nSilicon Valley has spent billions of dollars funding startups that use artificial intelligence to generate computer code automatically, such as Replit, Cursor, Harness, Windsurf, Augment Code, and All Hands AI.\nDespite all that money, the startups may still end up going out of business or being acquired by much larger software companies. Cursor and the rest lack viable business plans to distinguish them from Anthropic, OpenAI, Google, Microsoft, and other foundation model providers, who control much of the underlying technology, according to a seasoned tech executive who's surveyed the field.\nAlso: OpenAI unveils 'Aardvark,' a GPT-5-powered agent for autonomous cybersecurity research\n\"Code generation is so close to the foundation model. I just don't think you can add enough value above that over time to make a business,\" said Jeremy Burton, CEO of software startup Observe, Inc., in a chat he and I had recently via Zoom.\nBurton has served in numerous enterprise tech capacities, including as a senior vice president of marketing at Oracle, president for enterprise security and data management at Symantec, CEO of startup Serena Software, and head of corporate development at Dell Technologies. He is currently the CEO of software maker Observe Inc., based in San Mateo, California, in Silicon Valley.\nCan't compete with the AI giants\n\"I think, ultimately, over time, those foundation models become good enough [at coding],\" said Burton. \"The pure plays, they're left in a situation where they no longer have enough differentiation from the foundation models to create businesses.\"\nAlso: So long, SaaS: Why AI spells the end of per-seat software licenses - and what comes next\nCursor and the rest have been focused on building various kinds of cloud-based \"integrated development environments,\" or, IDEs, a programming tool that lets programmers assemble lines of code, invoke programming libraries to add functions, and to test and debug the programs, and then put the final compiled program into production.\nThe tool makers or their parent companies have been flooded with venture capital funding because, as a survey by venture firm Menlo Ventures indicates, inside enterprises, product and engineering is the area that has been the second-largest user of AI to date behind IT operations.\nA total of $3 billion has flowed into key startups Data Robot Inc., parent of Cursor's creators; Replit Inc.; Cognition AI Inc., the owner of Windsurf; Augment Computing Inc., the owner of Augment Code; and All Hands AI Inc., according to data compiled by FactSet Systems.\nAlso: GitHub's new Agent HQ gives devs a command center for all their AI tools - why this is a huge deal\nCompanies with related technology pertaining to app deployment, such as Harness Inc., have also received hundreds of millions of dollars.\nAnd yet, the guts of how the programs function, the core task of code generation, relies on the foundation models invented by the giants.\n\"Most of those startups depend on Anthropic's model,\" Burton said. In Burton's view, Anthropic's Claude family of large language models is the best among the AI frontier model makers in solving the problem of automatic code generation. \"Anthropic models are better than anyone at code generation.\"\nAs a result, \"Code generation tools are going to struggle to keep ahead of Anthropic,\" he said.\nAlso: The best AI for coding in 2025\nAnthropic has built its own IDE on top of Claude, called Claude Code. \"Anthropic has got the foundation models. Claude Code is probably going to be good enough,\" said Burton.\nCode generated in Claude Code, or in Microsoft's App Builder copilot, \"is going to be done 'good enough' by the foundational model providers if all you need is an LLM [large language model], and access to a code repository (like GitHub),\" said Burton.\nObservability is the next frontier\nBurton's company, Observe, makes tools that can be lumped into the \"DevOps\" field that is populated by Datadog and Dynatrace and Cisco's Splunk. Observe's tools build a \"knowledge graph\" of an app's structure. The graph lets developers pinpoint problems in running applications, a broad capability known as \"observability.\"\nBurton believes the observability function will make Observe one of the survivors as a standalone company.\nAlso: 10 ChatGPT Codex secrets I only learned after 60 hours of pair programming with it\n\"To fix issues with your code, you ultimately will need more than access to GitHub; you need to see how that code is behaving in production,\" he told me.\n\"And that's observability. It's harder for the foundational model companies to go build a deterministic system to go manage hundreds of terabytes of telemetry than it is for them to just keep making that foundational model better, and getting better at code generation.\"\nObserve builds its tools on top of whatever data lake or other repository stores app data, such as Snowflake running on top of Amazon AWS's Iceberg tables. (Burton is a member of the board of directors of Snowflake.)\n\"We're better than anyone at managing more telemetry than anyone,\" said Burton, referring to the signals coming from the running app.\nAlso: The best free AI courses and certificates in 2025 - and I've tried them all\nThe Observe tool will investigate app problems on behalf of a developer and then suggest fixes for the programmer to review. \"This is a pretty wild departure from the troubleshooting flow of yesterday.\"\nCode tools will adapt or die\nThe fate of Cursor and Replit and the rest could follow a number of paths. Cursor recently announced it is developing its own AI models focused on code, an apparent attempt to lessen its dependence on Anthropic and other foundation models.\nBut startups may be challenged to spend enough to compete with Anthropic and the other AI model makers given the deep resources of the giants.\nAnthropic, which has received investment from Amazon, is using Amazon's biggest AI facility, Project Rainier, to develop the next versions of the Claude family. Amazon expects to dedicate a million of its Trainium2 AI chips to the effort, running in multiple AWS data centers connected to one another.\nBurton predicts the IDE makers may also try to build their own observability functions into the coding tool.\n\"In order to differentiate from the foundational models, the pure-play code-gen startups will have to go beyond being a thin layer on top of an LLM,\" he said. \"The obvious adjacency is observability.\" That suggests code tools makers such as Data Robot's Cursor could merge with DevOps companies such as Harness Inc. Burton expects the code tools may look to utilize Observe's capabilities to enhance their functionality.\nAlso: What Bill Gates really said about AI replacing coding jobs\nIt's also possible that Cursor and the others will get bought out by Dynatrace, Datadog, Splunk, or other established software firms. \"They are too expensive right now,\" Burton said of Cursor's corporate price tag in an acquisition situation. \"But, if their valuations dip based on competitive threats from LLM companies, then that would be a buying opportunity.\"\nAs long as investment from venture capital keeps pouring into the startups, additional funding will keep Cursor and the others going for a while, predicted Burton.\nUntil the music stops.\n\"The challenge is going to be when either their growth slows and/or the [AI] bubble bursts,\" he said. \"Valuations then plummet, there's no financing available, and you end up with a mix of fire sale acquisitions or bankruptcies when there are no dance partners left.\"",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-02T11:17:22.593287Z"
}