{
  "id": "latest-news-zdnet-com-2025-10-31-8e4dccf4",
  "source_id": "latest-news-zdnet-com",
  "guid": "b7eadec8-ee12-4850-8114-096cbfeb0744",
  "title": "So long, SaaS: Why AI spells end of per-seat software licenses - and what comes next",
  "url": "https://www.zdnet.com/article/so-long-saas-why-ai-spells-end-of-per-seat-software-licenses-and-what-comes-next/",
  "published_at": "2025-10-31T07:00:31+00:00",
  "fetched_at": "2025-10-31T11:15:56.596730Z",
  "status": "rejected",
  "content": {
    "raw": "The AI surge is forcing application vendors to restructure how they deliver and charge for solutions. Software companies will need to sell outcomes, not licenses.",
    "full": "So long, SaaS: Why AI spells end of per-seat software licenses - and what comes next\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Per-seat software licenses may soon be obsolete.\n- Most software will soon be purchased by agents.\n- Prepare for consumption-based pricing models.\nGoodbye, per-seat software licensing? Goodbye, software as a service? Vendors ahead in the artificial intelligence (AI) space -- the OpenAIs, the Anthropics -- may begin to eat application vendors' lunches, forcing the latter to restructure how they deliver and charge for solutions.\nThat's the gist of a McKinsey analysis of the disruptive new structure of the software industry, essentially marking the beginning of the \"post-SaaS\" era. AI agent-to-agent interactions will deliver software and services, ultimately leading to the decline of the per-seat pricing model, which has been the standard for software licensing for decades.\nAlso: 6 essential rules for unleashing AI on your software development process - and the No. 1 risk\nThe new model will be based on outcome- or usage-based models, the McKinsey team, led by Jeremy Schneider, stated. \"It is a foundational shift redefining what software is, who builds it, who uses it, and how companies are organized and operate.\"\nMore vendor switching and customer churn?\nFor software buyers and users, this means a restructuring of their relationships with even their most favored vendors. \"These advances could usher in an era marked by an acceleration of vendor switching and customer churn, a realignment of user segments and value pools, and an increase in corporate in-house or citizen development of software,\" Schneider and his co-authors predict.\nIncreasingly, software vendors are staking their future on AI, with 40% expecting AI to unlock more than 20% revenue growth beyond their current trajectory, McKinsey finds. Eleven percent anticipate revenue gains of more than 50%. They also anticipate significant reductions in their operating costs.\nAcross the industry, there is a general consensus that the software delivery model is undergoing a significant transformation, driven by AI and AI agents. \"The transition to agentic architecture will evolve at a pace significantly faster than the evolution of client/server-based applications to cloud computing,\" predicted George Brown, partner at Partner Economics. \"Companies cannot ignore a reduction of costs by more than 20%, as it will make them uncompetitive.\"\nAlso: 50 AI agents get their first annual performance review - 6 lessons learned\nThe most visible shift seen by users will be in the way they acquire and pay for software -- a consumption-based model for software licensing, versus the traditional per-seat model. Close to two-thirds of vendors in the McKinsey survey, 63%, said they believe AI \"will fundamentally change their business model in the next three to five years.\"\nThe traditional per-seat or per-user pricing will give way to consumption-based pricing, based on usage, tokens, output, or outcome.\nSelling outcomes, not licenses\n\"We're on the cusp of an industry where software companies need to sell outcomes, not licenses,\" said Ali Gohar, chief human resources officer at Software Finder. \"Customers should now demand that agreements be based on value for performance. Charging the same rate for someone who logs in once a week and someone who uses a service 12 hours a day doesn't add up. Usage rates give companies a chance to scale properly and get better deals. The trick here is understanding your own usage patterns before you invest.\"\nAlso: OpenAI unveils 'Aardvark,' a GPT-5-powered agent for autonomous cybersecurity research\nAgent-to-agent software transactions \"are expected to reduce seat counts by as much as 70%,\" said Brown. However, he doesn't see the sale of tokens, compute time, or agent development time as viable, since these monetization methods are \"hard to grasp for the average businessperson. This will transition to outcome-based payments or specific rental costs of agents for prescribed time-limited tasks.\"\nThis will lead to a fundamental transformation in how software solutions are used, valued, and integrated into their operations, said Natasha Chryssafi, senior director of product management at Wolters Kluwer tax and accounting. \"AI agents will increasingly act on behalf of users, automating tasks, making decisions, and collaborating across systems. This reduces the need for direct human interaction with software interfaces.\"\nImportantly, Chryssafi added, \"as AI agents take on more responsibility, appropriate human oversight, transparency, ethical use, and data governance will become critical. Customers will need assurance that systems operate reliably and responsibly.\"\nThe risk for customers\nThe risk to software customers is that vendors may \"repackage suite pricing as outcome bundles, betting you won't notice,\" said Ofir Bloch, vice president of strategic positioning at WalkMe. \"You could be getting locked packages with measurement systems you can't audit. Before you sign anything consumption-based, ask to see the performance data, and test single capabilities. Don't commit until you verify the vendor can measure what they're charging for. These systems still break when conditions change. It's workflow automation, not true agent autonomy.\"\nAlso: I've been testing AI content detectors for years - these are your best options\nThe idea of replacing per-seat licensing with outcome-based models isn't necessarily a new concept, according to the McKinley authors. \"Between 2015 and 2024, the number of consumption-based software companies more than doubled, and leaders such as Salesforce, Zendesk, Intercom, and LexisNexis are already monetizing their AI capabilities through these models, often unlocking significantly higher per-customer revenue than with traditional SKUs.\"\nIt may take some time for the rest of the industry to evolve and adjust.\n\"The technology stack required to fully realize this vision is not yet ready,\" said Rob Fuller, chief solutions officer at Blend360. \"Any model that involves internal agents interacting with external agents is highly immature, and at this stage, human use of agents is far more common and practical, aside from a few narrow and intentional exceptions.\"\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-31T11:20:07.133338Z"
}