{
  "id": "latest-news-zdnet-com-2025-10-31-d2d25d24",
  "source_id": "latest-news-zdnet-com",
  "guid": "7c1bf65a-91c0-4597-9e8b-a62a3cf022f9",
  "title": "Own a PS5? Changing these 3 settings gave my system a big performance boost",
  "url": "https://www.zdnet.com/article/own-a-ps5-changing-these-3-settings-gave-my-system-a-big-performance-boost/",
  "published_at": "2025-10-31T16:46:00+00:00",
  "fetched_at": "2025-11-01T11:14:21.662665Z",
  "status": "rejected",
  "content": {
    "raw": "With a few adjustments, you can quickly enhance your PS5 experience, from gaming to streaming to even online security.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nOwn a PS5? Changing these 3 settings gave my system a big performance boost\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Few quick changes can help your PS5 run more efficiently and last longer.\n- You'll notice smoother visuals and sharper colors across games.\n- Built-in privacy controls give you more protection while you're online.\nI consider myself a casual gamer at best, but I love my PlayStation 5. It's my primary entertainment hub, where I can bypass the ad-laden cable subscription (insidiously built into my apartment's rent) in favor of watching streaming platforms. And the PS5 supports some of the most talked-about video games in the industry.\nAlso: How much RAM do you really need in 2025? I broke it down for Mac and Windows users\nThe PS5 comes with sophisticated default settings, yet not every one of them is necessarily ideal for your purposes or best use. So, whether you're gaming or viewing media through your PlayStation console, here are some things to consider, with detailed steps to make things run smoother and more safely.\n1. Conserving your DualSense controller's battery life\nA common complaint among users is that the PS5's DualSense controller doesn't hold a charge very long when unplugged. However, you can make several changes to extend its wireless functionality.\nIn Settings (the gear icon in the upper right corner), go to Accessories > Controller (General) > Controller Indicators Brightness and change the setting to Dim.\nThenfind Trigger Effect Intensity as well as Vibration Intensity and switch them from Standard to Weak. (If you're ok with having no haptic feedback at all, you can turn both these settings entirely Off.)\nAlso: 4 PC parts I'm buying to upgrade my computer (and the 7 I'm keeping)\nToward the bottom of the menu, you'll see Controller Speaker. Adjust the slider bar to the left for minimal output. You can also access this through Sound > Volume.\nFinally, if you're not gaming and instead watching video content, then your DualSense is needlessly burning energy. Go to System > Power Saving > Set Time Until Controllers Turn Off, and select After 10 Minutes.\n2. Optimizing your screen and video output settings\nIf your TV supports VRR, 120Hz Output, and ALLM, these features should be enabled. Variable Refresh Rate (VRR) eliminates screen tearing and stuttering by dynamically adjusting your TV's refresh rate to match a game or movie production's frame rate for a cleaner visual experience. ALLM (Auto Low Latency Mode) essentially reduces input lag, making your actions with the controller appear on the screen faster.\nFollow this path: Settings > Screen and Video > Video Output and set VRR to Automatic. Also, enable Apply to Unsupported Games.\nWhile still on the Video Output submenu, you'll see options for ALLM and 120Hz Output. Change both of these to Automatic. Your TV will need to support HDMI 2.1 for these features to work, and the PS5 will tell you right away if your TV does not qualify.\nAlso: The best TVs for PS5 of 2025: Expert tested and reviewed\nScrolling further down, you'll find HDR (High Dynamic Range) for which you want to be sure Always On is selected. Just below that, Adjust HDR offers an opportunity to run a swift wizard that calibrates your display for colors, brightness, and black levels. Use the controller to pick Brighter or Darker in order to make an on-screen symbol barely visible. (This will make sense when you try it.)\nTwo more color settings appear at the bottom of this menu: Deep Color Output and RGB Range. Make sure these are both set to Automatic.\n3. Protecting your online visibility and personal data\nTo help protect your privacy while using your PS5, you can customize certain settings to control what information is visible to others, restrict who can communicate with you, and manage your account security. This includes limiting who can see your online status, gaming history, and profile information, as well as controlling access to your account and console.\nUnder Settings, head to Users and Accounts > Privacy > View and Customize Your Privacy Settings.\nHere, you can control who can see your real name, profile picture, friends list, game activity and history, and who can send friend requests or interact with you online. For each of the variables in this menu, I recommend choosing \"No One\" and \"Close Friends Only.\" This should significantly reduce unwanted friend requests or spam.\nAlso: How to clear your TV cache (and why you shouldn't wait to do it)\nIf you're like me, you don't feel a need to infuse Sony's database with more personal information than required, such as the voice data collected through your DualSense controller's microphone.\nUnder Privacy, scroll down to \"Control how your data is collected and used\" to access three options: Data You Provide, Personalization, and Voice Data Collection.\nFor the former (Data You Provide), change the setting to Limited. For Personalization, I recommend turning off all four of the sub-options, including Standard Personalization. For the latter, switch to Don't Allow for Voice Data Collection.\nBottom line\nThe PlayStation 5 offers dozens of customizable settings that can tailor your gaming and viewing experience to your particular preferences. You could spend an hour roving through the Settings menu to experiment with various options, tweaking them to your liking.\nI've found these three factors to be most essential in getting the best out of the console while safeguarding my personal information.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:19:00.109936Z"
}