{
  "id": "latest-news-zdnet-com-2025-10-31-cd1c5366",
  "source_id": "latest-news-zdnet-com",
  "guid": "34859919-20c8-4d8c-9e91-a92b9f9de5c4",
  "title": "Buying an Android smartwatch? I found one that's highly functional and affordable",
  "url": "https://www.zdnet.com/article/buying-an-android-smartwatch-i-found-one-thats-highly-functional-and-affordable/",
  "published_at": "2025-10-31T16:38:00+00:00",
  "fetched_at": "2025-11-01T11:14:21.662792Z",
  "status": "rejected",
  "content": {
    "raw": "Most smartwatches last a day or two - the TicWatch Pro 5 Enduro pushes close to four.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBuying an Android smartwatch? I found one that's highly functional and affordable\nMobvoi TicWatch Pro 5 Enduro\nZDNET's key takeaways\n- The Mobvoi TicWatch Pro 5 Enduro is available in Obsidian black for $349 (but on sale for $157 at the time of writing).\n- This Google Wear OS smartwatch offers long battery life, dual-display technology, and a sapphire glass display.\n- The watch currently runs Wear OS 3.5 and is available in one larger size.\nFollow ZDNET: Add us as a preferred source on Google.\nFor the past couple of years, I've been switching between various Google and Samsung Galaxy Watch models to pair with my Android, as Google's Wear OS is the best wearable experience, in my opinion. One feature I've come to appreciate in a smartwatch is a long-lasting battery, and one of the best in that category is the Mobvoi TicWatch Pro 5 Enduro.\nAlso: The best smartwatches 2025: I wore these for weeks and found the perfect one for your wrist\nI've been running, rowing, biking, and sleeping with the TicWatch Pro 5 Enduro smartwatch for months now, and its marathon battery life solves my biggest issue with Wear OS smartwatches.\nBest smartwatch deals of the week\n- $200 (save $100)\n- $500 (save $150)\n- $359 (save $70)\n- $200 (save $100)\nOnce-weekly charging\nIts massive 628mAh battery has a unique dual display design for low-power standby use. That equates to an advertised 90 hours -- nearly four days -- of battery life in smart mode and up to 45 days in Essential Mode. Even better yet, just 30 minutes of fast charging provides up to two days of battery life.\nAlso: Got a Samsung smartwatch? This 30-second fix will keep it running like new\nWhen I run outside, I use the outdoor running mode with GPS tracking enabled, and my consumption calculations indicate that the Pro 5 Enduro should provide up to 15 hours of GPS tracking. I typically run a couple of times per week (30-45 minutes each time) and row on the Hydrow a couple of times while wearing the watch to track my 24/7 activity and sleep.\nI've been charging the watch once weekly with this usage pattern, so the four days or 90 hours of typical usage seem accurate.\nFor comparison, the Google Pixel Watch 3 dies on me during the second day, while the Samsung Galaxy Watch 5 Pro will get me into the third day before running out of juice. The TicWatch Pro 5 Enduro is the clear winner for battery life, and if a long-lasting battery is your primary need, I couldn't recommend the watch more.\nThe Snapdragon W5 Plus Gen 1 Wearable Platform contributes to the impressive battery life and will support a future upgrade to Wear OS 4, despite currently running on Wear OS 3.5. This caveat is one thing to note, as, unfortunately, Mobvoi hasn't displayed a track record of timely updates. Since Wear OS was released in the fall of 2023, this new model should have launched with Wear OS 4 out of the box, let alone Wear OS 5.\nAlso: Why I recommend this Garmin model to most smartwatch users - especially at this price\nBeyond battery life\nThe dual-display technology with interactive and customizable ultra-low-power display options is exceedingly useful. You can choose from 18 background colors to highlight the always-on display, which is on the top layer of the watch and shows key metrics such as the number of steps taken, heart rate, battery life, time, and date.\nIn this dual-display mode, spinning the large rotating crown button brings up a full-display heart rate reading, blood oxygen level, and compass heading.\nWhile working out, this ultra-low power display layer will light up in six colors that reflect your current heart rate zone. This feature is super useful for checking which zone you're in at a glance without having to focus on small numbers in the middle of a workout. This mode also pairs with third parties, such as Strava and Nike Run Club, with data like heart rate, pace, and elevation, with the ultra-low power display.\nThe TicExercise app offers over 100 workout types with various metrics such as recovery time, GPS tracking, speed, and VO2 Max. Unfortunately, you can't customize the data screens for the various workouts. This may be fine for casual athletes, but I would prefer to see some basic customization to prioritize the most important data. Thankfully, since this is a Wear OS watch, you can download third-party services like Strava to optimize your experience.\nOnce your workout is complete, the TicHealth application provides exhaustive data about your performance and health metrics, such as daily and weekly goals, sleep details, heart rate history, and much more. TicHealth is one of the significant updates in this watch over the TicWatch Pro 5 model released in late 2023.\nOther improvements\nOther improvements in the Enduro model over the Pro 5 model are the redesigned rotary knob, the use of sapphire crystal glass on the display instead of Gorilla Glass, a larger and clearer user interface display, and further third-party integration with the ultra-low-power display.\nAlso: I tested the Apple Watch Series 11 for a week - here's my buying advice now\nIn addition, the TicWatch Pro 5 Enduro has more than 7,000 watch faces available, and if you use the TimeShow app, the face can be changed daily. The large 1.43-inch display supports all Wear OS apps, including Google Maps, Messages, Wallet, Keep Notes, and much more. Phone calls and messaging work well through a connected phone, and the voice-to-text function performs flawlessly, too.\nThe Pro 5 Enduro measures 50.15 x 48 x 11.95 mm and weighs just 44.7 grams with its 7000 series aluminum and fiberglass nylon case. The sapphire crystal display is resistant to scratches and the 24mm watch band is very comfortable with handy quick-release pins. The watch is also quite durable with a 5 ATM rating and MIL-STD-810H certification.\nAlso: Samsung's newest Galaxy Watch 8 got me running again (and it's already on sale)\nThe device's global navigation satellite system (GNSS) is included for accurate tracking, and Wi-Fi and Bluetooth 5.2 provide easy connectivity to your phone and network. However, the watch itself does not have cellular capability.\nZDNET's buying advice\nIf you're looking for a Google Wear OS smartwatch with long battery life, the Mobvoi TicWatch Pro 5 Enduro is your best option. The dual display provides some interesting use cases for the ultra-low power mode, and the watch's app provides comprehensive data.\nAlso: I compared the best smartwatches by Google and Samsung - here's how Pixel wins out\nIt has a more traditional watch form factor than the small and sleek Google Pixel Watch 4, seemingly built for more rugged experiences. However, it is a good-looking watch with tons of customizable options.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:19:00.111098Z"
}