{
  "id": "latest-news-zdnet-com-2025-10-31-5286cf95",
  "source_id": "latest-news-zdnet-com",
  "guid": "89ace6d1-f291-4741-85f5-0a02a9534126",
  "title": "The best Google phones in 2025: How does the Pixel 10 Pro Fold stack up?",
  "url": "https://www.zdnet.com/article/best-google-phone/",
  "published_at": "2025-10-31T10:00:48+00:00",
  "fetched_at": "2025-10-31T11:15:56.596212Z",
  "status": "rejected",
  "content": {
    "raw": "The Google Pixel 10 lineup introduces several small changes, but should you consider buying them? We tested every available model and found the best Pixel phones for every kind of user.",
    "full": "The best Google phones in 2025: How does the Pixel 10 Pro Fold stack up?\nWhy you can trust ZDNET\n'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest mobile deals of the week\n- $350 (save $50)\n- $525 (save $125)\n- $300 (save $100)\n- $338 (save $291)\nThe Google Pixel 10 lineup is a worthy follow-up to an already-good Pixel 9 series. It introduces features like PixelSnap, and a telephoto camera on the base variant. You also get the signature clean software experience and some genuinely useful artificial intelligence features. The Google phone series includes four devices -- Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL and the Pixel 10 Pro Fold.\nThe new phones also include meaningful camera smarts with the help of Google Gemini and a processor boost. We have tested all available Pixels to help you decide which is the perfect choice for you currently. With Black Friday sales just around the corner, this is the best time to upgrade.\nGet more in-depth ZDNET tech coverage: Add us as a preferred Google source on Chrome and Chromium browsers.\nWhat is the best Google Pixel phone right now?\nAt ZDNET, we've reviewed all Google phones, and our current pick for the best Google Pixel phone is the Pixel 10 Pro XL. It faces tough competition from the new Galaxy S25 Ultra, but you get versatile cameras, a bunch of new AI features, an updated design, MagSafe-like PixelSnap, and support for up to seven years of software, security, and Pixel Drop updates. However, it's not the only good Pixel phone that you can buy right now.\nAlso: The best phones you can buy\nThe best Google Pixel phones of 2025\nWhy we like it: Google has three phones named Pixel 10 Pro this year, but the Pixel 10 Pro XL is the true big phone with a 6.8-inch AMOLED display. It features a more polished experience with the new Tensor chipset, free Gemini AI features, and a lot more.\nThe iPhone-like design with flat sides remains okayish in the hand. These make it feel more premium to hold without being uncomfortable, thanks to the curved edges. Overall, I love how it looks.\nThe Google Pixel 10 Pro XL is powered by the Tensor G5 chipset. It's responsible for my favorite AI features like 100x ProRes AI zoom, better camera processing, and more. It still gets warm during demanding tasks, but I haven't faced stutters or lag on the Google flagship. It is paired with 16GB of RAM and comes with up to 1TB of storage.\nI also like Video Boost -- which helps better record videos in low light, and Add Me, which lets you add yourself in group photos. The front camera is better than ever as well. The phone's triple camera array, paired with the company's computational prowess, makes the Pixel 10 Pro XL the best device overall from Google.\nWho it's for: If you want the biggest Google phone but don't want to spend on a foldable and need flagship cameras, the Pixel 10 Pro XL is for you. It won't disappoint you.\nWho should look elsewhere: If you want the best of Google cameras but have small hands, the Pixel 10 Pro XL could be a challenge to use. In that case, you should opt for the Pixel 10 Pro.\nReview: Google Pixel 10 Pro XL\nGoogle Pixel 10 Pro XL specs: Processor: Google Tensor G5 | Display: 6.8 inches | Storage options: 256GB, 512GB, 1TB | Rear cameras: 50MP main, 48MP ultrawide with macro, 48MP telephoto, 42MP front | Battery capacity: 5,200 mAh | Price: Starts $1,199\nWhy we like it: The Google Pixel 10 Pro is a one-of-a-kind Android phone for those who want the best optics but in a smaller size. While the Galaxy S25 Plus and Galaxy S25 Ultra have camera differences, the Pixel 10 Pro's cameras are the same as the $100 more expensive Pixel 10 Pro XL.\nCompared to the regular Pixel 10, the Pixel 10 Pro features a more efficient LTPO display, a better telephoto sensor, a bigger 42MP selfie shooter, 16GB of RAM, and more camera features like 8K video recording, 100x ProRes AI Zoom, and more. There are plenty of reasons to warrant the extra $200 price tag over the base Pixel 10.\nThis is also an excellent iPhone alternative. If you want to shift to the Android world and have multiple MagSafe accessories at home, the PixelSnap feature will let you use them on your new Android phone without any issues.\nWho it's for: You should buy the Google Pixel 10 Pro if you want all the best Google features and performance but in a 6.3-inch screen size and form factor. It will receive the same seven years' worth of software, security, and Pixel Drop upgrades.\nWho should look elsewhere: If you prioritize battery life, the Pixel 10 Pro might not be for you. It'll last you a day but if you're a power user, the Pixel 10 Pro XL would serve you better, or if you're fine with a small screen but need a reliable battery life, the $500 Pixel 9a is a good choice.\nReview: Google Pixel 10 Pro camera review\nGoogle Pixel 10 Pro specs: Processor: Google Tensor G5 | Display: 6.3 inches | Storage options: 128GB, 256GB, 512GB, 1TB | Rear cameras: 50MP main, 48MP ultrawide, 48MP telephoto, 42MP front | Battery capacity: 4,870 mAh | Price: Starting at $999\nWhy we like it: I love the Pixel 10 because it is more similar to the Pro series than ever. It is the same size as the Pixel 10 Pro and is powered by the same processor, packs a similar capacity and screen, and adds a telephoto sensor to its optics. So, you get a similar experience on a more affordable phone.\nSeveral AI features like Pixel Studio, Pixel Screenshots, and Add Me are part of the Pixel 10. However, you miss out on 100x ProRes AI Zoom. In some ways, the smaller Pixel is an even better phone than the larger Pro XL, such as in ergonomics and the in-hand feel. The ability to reach from one corner of the screen to the other without having to fidget around creates a better in-hand user experience.\nThe Pixel 10 costs $200 less than the Pixel 10 Pro and $300 less than the Pixel 10 Pro XL. This makes it one of the best phones in its price category.\nWho it's for: The Pixel 10 is the best Google phone for most people because you get to experience most of the upgrades for less than $1,000. The optics are as reliable as before, and you get even better camera tuning. The Pixel 10 also packs 12GB of RAM and supports the new PixelSnap feature.\nWho should look elsewhere: If you want a bigger screen and battery, the Pixel 10 Pro XL would suit you better. And if you are a power user, the Apple iPhone 17 might be worth considering.\nReview: Google Pixel 10\nGoogle Pixel 10 specs: Processor: Google Tensor G5 | Display: 6.3 inches | Storage options: 128GB, 256GB | Rear cameras: 50MP main, 13MP ultrawide, 10.8MP telephoto and 10.5MP front | Battery capacity: 4,970 mAh | Price: Starting at $799\nWhy we like it: The Google Pixel 9a is the latest affordable Google phone and unlike Apple's iPhone 16e, the it still starts at the same $499, despite the upgrades on the processor, display, and battery.\nThe new Google budget phone features an updated design and borrows the Tensor G4 chipset from the Pixel 9 Pro. While it scores lower numbers in benchmark tests than the flagship phone, it remains an extremely capable device.\nI like the bigger 6.3-inch OLED screen -- versus the Pixel 8a's 6.1-inch screen. It supports a 120Hz refresh rate display and brings improved brightness. This makes the screen look more legible than before, especially outdoors. The new Google phone also has the biggest battery for an A-series Pixel phone -- 5,100mAh, which will likely last you an entire day.\nIt also offers a smooth and responsive day-to-day experience. It carries over the Titan M2 chip as well as a built-in VPN for added security. Google upgraded the optics, too. You get an improved 48MP main sensor and the same 12MP ultrawide angle camera. The 13MP selfie shooter remains unchanged as well. These offer great camera processing, skin tones, and lovely lowlight results. It's great for hobbyist shutterbugs and professional photographers alike.\nWho it's for: If you are strictly on a budget but don't want to compromise on the flagship Google experience, the Pixel 9a is for you.\nWho should look elsewhere: If you want the best display, battery life and performance under $500, the OnePlus 13r is a better choice, especially if you're ok with no wireless charging support.\nReview: Google Pixel 9A\nGoogle Pixel 9a specs: Processor: Google Tensor G4 with Titan M2 | Display: 6.3 inches | Storage options: 128GB/256GB | Rear cameras: 64MP Quad PD Bayer, 13MP ultrawide, 13MP front | Battery capacity: Typical 4492mAh | Price: Starting at $487\nWhy we like it: The most important design change on the foldable Google phone came with the Pixel 9 Pro Fold last year. It was similar to the OnePlus Open and not the former Pixel Fold. I loved the new 20:9 aspect ratio cover screen, which was the same as the Pixel 9 Pro. You could run apps without facing any scaling issues. The Pixel 10 Pro Fold retains this design language.\nThe Pixel 10 Pro Fold gets you decent cameras and a bigger battery than before. It is also powered by a more efficient Tensor G5 processor, which should keep the battery life in check. The new Google foldable carries the same new AI features as the Pixel 10 series including PixelSnap and Camera Coach. Like the other new Pixel phones, it'll get seven years of software, security, and Pixel Drop updates.\nWho it's for: If you want a folding phone with the signature Google experience, the Pixel 10 Pro Fold is for you.\nWho should look elsewhere: The Pixel 10 Pro Fold isn't the best foldable smartphone. Samsung delivered an outstanding foldable with the Galaxy Z Fold 7 this year, and it is hard to beat the 215g form factor.\nAlso: Google Pixel 10 Pro Fold vs. Samsung Galaxy Z Fold 7\nGoogle Pixel 10 Pro Fold specs: Processor: Google Tensor G5 | Display: 6.4 inches (outer) and 8.0 inches (inner) | Storage: 256GB, 512GB, 1TB | Rear cameras: 48MP main, 10.5MP ultrawide, 10.8MP telephoto, and 10MP selfie shooter on both cover screen and inner display | Battery capacity: 5,015mAh | Price: $1,799\nWhich is the right Google Pixel phone for you?\nIf you're interested in a Google Pixel phone, it's nice that there aren't too many options available to confuse you or overwhelm your decision-making process. The first consideration is price. If you have a maximum amount you are willing to spend on a phone, then the price can dictate which is right for you.\nThankfully, when it comes to the software experience, Google provides about the same experience across all of the actively supported Pixel phones. You'll see some exclusive AI and camera features here and there, but the general experience is roughly the same.\n| Choose this Google Pixel phone | If you want... |\n| Google Pixel 10 Pro XL | The best of Google in the biggest size possible for good battery life and large screen with tons of AI features, and a temperature sensor. |\n| Google Pixel 10 Pro | Google's best camera system in a small size, 1TB storage and no compromises. A Pro phone in a compact form factor. |\n| Google Pixel 10 | A more affordable Pixel phone with a similarly outstanding camera, colorful body choices, and a handy form factor. It also features some of the AI features found on the Pro. |\n| Google Pixel 9a | The best budget pick of the Google phones, with a starting price of $499, a 120Hz display, and wireless charging support. |\n| Google Pixel 10 Pro Fold | Google's foldable overhaul that lets you switch between a compact 6.3-inch display and a productivity-enhancing 8.0-inch display. The Pixel 10 Pro Fold remains pricey, but it undercuts the Samsung Galaxy Z Fold 7 by $200. |\nFactors to consider when choosing a Google Pixel phone\nWith several new Google Pixel phones being released each year, ZDNET spends at least two weeks with each model before deciding whether or not -- and where -- it ranks within this buying guide. The qualifications I look for when curating the picks include the following:\n- Availability: The biggest factor is availability; is what's being selected available to purchase directly from Google, a local carrier, or an online retailer? Is it in stock? Or can it only be purchased in used or renewed condition? With the picks on this list, each one can be bought new and sealed, guaranteeing that you'll receive the most reliable experience from the start.\n- Value: Just as important is the value that each Pixel phone brings. While all options on this list differ in price tiers, they each offer enough unique features, camera capabilities, and designs that make them worth paying for. If they're not worth it, they won't be on the list.\n- Performance: Naturally, I only pick models that yield good to excellent performance, from the way they handle day-to-day tasks to more intensive use cases like gaming and video editing.\nHow we test phones\nHere's a breakdown of every factor we consider before we make recommendations:\n- Design and ergonomics: How good a phone looks and feels plays a big role in many users' buying journeys, so we consider these aspects heavily when testing.\n- Performance: Several factors affect a phone's performance, including LTE/5G signal, battery life, and background tasks. Therefore, we typically begin our evaluations with a fully charged handset, with all background tasks closed, and with as stable of a mobile connection as possible.\n- Camera quality: ZDNET tests phone cameras by capturing hundreds of photos and videos of various subjects and in various lighting conditions. We also compare the output to that of older models.\n- Battery life and charging: It's also important for us to evaluate how long phones last under light, moderate, and heavy usage, how long they take to recharge, and how they do it -- wired, wireless, or both.\n- Special features: These features distinguish tested devices from a bustling smartphone market and hopefully bring added value to users, not the opposite.\n- Pricing and availability: Beyond budget considerations, we also note if a phone is available in the U.S. or only internationally.\nFor an extensive rundown of our testing methodology, be sure to check out our how we test phones article.\nLatest news on Google Pixel phones\n- The Google Pixel 10 Pro Fold went on sale Oct. 9 alongside the new Pixel Watch 4 and Pixel Buds 2a.\n- Google rolled out a September OTA update for the Pixel 10, 10 Pro, and 10 Pro XL. It fixes the issue with the screen turning black during transitions from a webpage in the in-app browser under certain conditions. The update also brought audio and general system stability improvements.\nFAQs on Google Pixel phones\nDo all of these Pixel phones have water and dust resistance?\nPeople use their smartphones everywhere today and having some level of dust and water resistance is important. You should not swim or intentionally submerge your phone for extended periods in water without a waterproof case. Warranties generally do not cover water damage. However, if you are outside in the rain, accidentally drop your phone in a puddle, or spill something on your phone, it should be able to survive such an incident.\nOn this list, all Pixel phones are IP68 rated for dust and water resistance. The Pixel 10 Pro Fold is the first book-style folding phone to bring this level of dust ingress protection.\nDo all of these Pixel phones support wireless charging?\nEvery Pixel model on this list supports wireless charging and all Pixel 10 series phones support MagSafe-like magnetic wireless charging.\nAlso: Is your Pixel battery draining faster than it should? This feature can help\nLatest updates\n- October 2025: Updated to indicate that the Pixel 10 Pro Fold is now on sale and available to purchase.\n- September 2025: Added the Google Pixel 10 series after our testing and replaced the Pixel 9 lineup throughout our best picks. Also, replaced the older alternative picks with newer options like the Apple iPhone 17 and Samsung Galaxy Z Fold 7.\n- August 2025: Added information about the upcoming Pixel 10 launch.\nOther phones worth considering\nNot only is the latest from Samsung an AI-centric handset, but the standard model is also one of the most compact devices on the market. If you want an Android alternative to the Pixel 10, the Galaxy S25 will give you a sharp and bright display, a versatile camera system, decent battery life, and a pop of vibrancy with Blue and Red color options.\nReview: Samsung Galaxy S25\nThe iPhone 17 is the best iPhone for most people. Apple did a tremendous job upgrading its base model. You now get a ProMotion display with a dynamic 120Hz refresh rate, two 48MP cameras, ever-reliable MagSafe, faster charging capabilities, and 256GB of base storage. If you want a Pixel alternative for less than $800, this is the phone to buy.\nReview: Apple iPhone 17\nThe Samsung Galaxy Z Fold 7 is the best foldable you can buy right now. As compared to the Pixel 10 Pro Fold, the Samsung foldable offers a better form factor due to its slimmer and lighter design. It also houses a more powerful processor and a bunch of helpful AI features. The Pixel 10 Pro Fold still has a bigger battery and IP68 rating, but if you want a foldable to feel like a regular slab phone, the Galaxy Z Fold 7 should be your pick.\nReview: Samsung Galaxy Z Fold 7\nFor more, check out our favorite phones in 2025, how Apple and Samsung's flagship phones compare, and five phones to try instead of the Pixel 10 Pro.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-31T11:18:52.120659Z"
}