{
  "id": "latest-news-zdnet-com-2025-10-31-89b4be56",
  "source_id": "latest-news-zdnet-com",
  "guid": "471f34b8-26af-4828-9565-04f2769395ab",
  "title": "The Pixel phone update that Android fans can be proud of - and how it beats iOS 26",
  "url": "https://www.zdnet.com/article/the-pixel-phone-update-that-android-fans-can-be-proud-of-and-how-it-beats-ios-26/",
  "published_at": "2025-10-31T10:57:00+00:00",
  "fetched_at": "2025-10-31T11:15:56.596044Z",
  "status": "rejected",
  "content": {
    "raw": "Android calls just got a major glow-up. Here's what Pixel users can try now.",
    "full": "The Pixel phone update that Android fans can be proud of - and how it beats iOS 26\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Google's new Calling Cards make Android calls feel more personal.\n- The feature lets Pixel users customize full-screen contact images.\n- Calling Cards don't back up yet, so setups won't transfer to new phones.\nAs a lifelong Android user, I've noticed over the years how incoming calls on my iPhone friends' devices were inviting, full-screen experiences. The contact image fills the screen, the person's face takes over the device, and somehow that makes the incoming call feel a bit more human. Not to mention, it makes it easy to glance at who's on the other end of the line before answering.\nOn Android, it's often been a small circle avatar surrounded by a bunch of empty space, much more utilitarian and fitting for Android as a whole, but lacking any real dynamic beyond that.\nAlso: I use this hidden Android security feature to turn off sensors with one tap - here's why\nBack in the early days of Android, this gap was even worse. You could upload high-resolution photos for your contacts, but the system would compress them into muddy, low-resolution squares that pixelated like crazy when a call came in. It's been a long-standing sore spot of mine, which is why Google's recent Calling Card feature makes me so happy.\nI've been customizing my contacts on the Pixel 10 Pro running the latest Contacts and Phone apps, and it feels like a meaningful fix to a decade-old problem.\nHow to set up Calling Cards\nCalling Cards let you create a full-screen visual identity for the people you talk to most. When a call comes in, instead of a dull circle and text overlay, a contact image of your choosing fills the display with their name standing out in a custom font and color. The effect feels instantly more personal and inviting.\nSetting one up is surprisingly simple, though the feature is exclusive to Pixel devices for now. There are a few ways to set up a Calling Card for yourself. First, when a call comes in, the updated dialer should prompt you with a large button asking you to create a Calling Card for that person. Tapping that takes you into the setup process.\nBut the best way to explore it without waiting for a call is through the latest version of the Contacts app. Open a contact, tap \"Try adding a calling card,\" and you'll enter a lightweight editor that includes a preview of your handiwork.\nFrom there, you can choose an image in three ways: take a new photo with the camera, select from your on-device gallery, or pull from your Google Photos cloud library.\nI prefer that last option because of its comprehensive nature, especially because I've already spent time labeling faces in the People and Pets section of the app. That makes it incredibly easy to sort through and find high-quality, well-framed shots for your favorite contacts.\nAlso: I tried every new AI feature on the Google Pixel 10 series - my thoughts as an AI expert\nOnce the image is chosen, you can pinch to zoom, crop, and tweak the framing to fit the tall rectangular format that appears during calls. Fonts for the contact's name are customizable, and so is the color of the caller's name.\nThat said, the color palette is a bit limited, in my opinion. I've found that lighter text can easily blend into bright backgrounds, and there's no option to apply an outline or shadow to separate text from the image.\nI'm hoping Google includes those options in a future update to improve readability. Picking the right color definitely takes a bit of trial and error, but when it clicks, it turns a once-boring call screen into something that feels personal and yours.\nI've discovered that tighter crops on faces usually work best. You want the person's face large enough to be instantly recognizable. It's also important to pick photos that are already reasonably close to the person's face. Otherwise, the image can become blurry or pixelated when zoomed in to fit the Calling Card format.\nAlso: How to clear your Android phone cache (and fix slow performance for good)\nMy obsessive tendency to get these things \"just right\" means I can spend more time choosing the perfect image than I'd like, but the work is worth it in the end.\nOnce you finalize the design, the system asks if you'd like to use the same image as the contact's standard profile picture. It's a nice touch, though I often prefer a different profile picture that fits the smaller, circular ratio better than some of the images that work best in the larger, rectangular Calling Card layout.\nThe new call experience\nAlongside Calling Cards, Google also changed the mechanics of answering calls. In place of a single button for answering calls is an elegant swipe gesture: slide right to answer, slide left to decline. It's a cleaner look and matches the visual refresh of the new call screen, not to mention the improved design dynamics of Material 3 Expressive.\nI heard that there was a way to switch back to the single-button approach for those who don't like the slider, but I came up empty trying to locate it. The move to a slider isn't just about aesthetics, as it's also meant to prevent phantom button presses from within a pocket or purse.\nThe action does take a bit to adjust to, but after a few days, I found the swipe motion ultimately feels smoother, especially since it now lives alongside the more expressive, image-heavy design of Calling Cards. The two changes belong together.\nAlso: This new Contacts app update solves a problem we've all had on Android phones\nAfter setting up Calling Cards for my most frequent contacts, I realized that I actually enjoy seeing calls come in now. There's a psychological element to it that's difficult to name, but when the call screen fills with a bright, curated image of the person calling, I find myself more inclined to answer. It adds a touch of warmth to a function that's very easy to take for granted.\nOne word of caution for those who switch phones regularly: at the time of this article, I confirmed that Google does not include Calling Cards with its system-wide backup. This means that buying a new Pixel phone likely means having to set up those Calling Cards again, and given the process takes time and attention, this could be a disappointing discovery with a new phone.\nAlso: I changed 12 settings on my Android phone to significantly increase the battery life\nFor anyone who wants to take advantage of it, the trick is just time and curation. I like to think of Calling Cards as a mini photo project that brings some of my favorite portraits of my friends and family front and center.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.\nFollow my latest tech reviews and projects across social media. You'll find me on YouTube at YouTube.com/@JasonHowell, on X (formerly Twitter) at @JasonHowell, and on Instagram at Instagram.com/thatjasonhowell.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-31T11:18:38.630458Z"
}