{
  "id": "latest-news-zdnet-com-2025-10-31-5e1f3942",
  "source_id": "latest-news-zdnet-com",
  "guid": "b5bd5a90-4642-4b1e-8c98-a75a1b5c2ca0",
  "title": "That $20,000 viral humanoid home robot? It's not what it seems",
  "url": "https://www.zdnet.com/article/that-20000-viral-humanoid-home-robot-its-not-what-it-seems/",
  "published_at": "2025-10-31T19:27:47+00:00",
  "fetched_at": "2025-11-01T11:14:21.661615Z",
  "status": "rejected",
  "content": {
    "raw": "The internet was abuzz this week over Neo, 1X's new housekeeping robot - but then the reviews rolled in.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThat $20,000 viral humanoid home robot? It's not what it seems\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- 1X's viral Neo humanoid robot isn't quite as good as it looks.\n- Neo costs $500 per month or $20,000 up-front.\n- The robot has to be controlled by a human.\nThere's a new humanoid robot making waves online, but even with a price tag of $20,000, this one might not be exactly what it seems.\nIn a 10-minute video posted to X, 1X debuted Neo, a housekeeping humanoid robot that handles everyday tasks like loading the dishwasher, vacuuming the floor, and folding laundry. As 1X describes it, the robot can \"provide assistance with everyday tasks...automates household chores, freeing time for priorities\" and even \"brings useful insight into every conversation.\"\nAlso: Best early Black Friday robot vacuum deals 2025: 20+ really good deals out now\n1X claims that you can schedule chores to occur at a specific time of day and that the robot, which has a 4-hour runtime, is quieter than a refrigerator and can even submerge its hands in water.\nThe video, which was honestly pretty impressive, quickly went viral.\nDetails quickly started surfacing, though, including a hands-on review from the Wall Street Journal that indicated this robot might be much less \"humanoid\" than the video looks. It turns out that the robot still needs to be controlled by a human -- a \"1X Expert\" -- wearing a VR headset.\n1X states that the employees operating the robots are based in the US, and that purchasing a robot entails a \"social contract\" that essentially allows a stranger to access your home.\nAll that might be OK, but from hands-on testing, the robot isn't even that great. According to the WSJ's review, Neo almost fell over while closing the dishwasher, took several minutes to fold a shirt, and had difficulty opening a refrigerator. The reviewer added that he \"didn't see Neo do anything autonomously.\"\nAlso: Companies are making the same mistake with AI that Tesla made with robots\nThe company CEO did say the robot will do \"most things autonomously\" by 2026.\nIf you're still interested and don't mind the \"social contract,\" two purchase options are available -- a standard $499 monthly subscription or a special $20,000 early-access one-time preorder that requires a $200 down payment.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-01T11:17:58.262672Z"
}