{
  "id": "latest-news-zdnet-com-2025-10-31-feb727a0",
  "source_id": "latest-news-zdnet-com",
  "guid": "1f018c32-b979-4287-b81e-0bab7c8dce97",
  "title": "Think twice before plugging these 7 appliances into an extension cord (and why)",
  "url": "https://www.zdnet.com/article/think-twice-before-plugging-these-7-appliances-into-an-extension-cord-and-why/",
  "published_at": "2025-10-31T11:11:00+00:00",
  "fetched_at": "2025-10-31T11:15:56.595769Z",
  "status": "rejected",
  "content": {
    "raw": "Extension cords are fine for everyday gadgets, but using them with some appliances - especially in colder weather - can be risky.",
    "full": "Think twice before plugging these 7 appliances into an extension cord (and why)\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Heavy-duty appliances overload cords, leading to dangerous overheating and fire risks.\n- Appliances over 1,800 watts need a dedicated wall outlet for safety.\n- Daisy-chaining extension cords is a major fire hazard and should be avoided.\nExtension cords are generally a safe solution for running power to electronics that are too far from the nearest wall outlet. But the operative word here is \"electronics,\" which is not as all-encompassing as some people might think.\nAppliances (like refrigerators and toaster ovens) are obviously electronic devices, but they're in a different class from most electronics because of the amperage demands they need to function.\nWhy you shouldn't plug everything into an extension cord\nExtension cords are manufactured with a maximum capacity to handle electrical current, which is determined by the size or gauge of the wire used in the cord. For instance, a 16-gauge extension cord can handle a maximum of 13 amps, while a 14-gauge cord can handle up to 15 amps (or 1,800 watts), the same as a standard wall outlet in the US.\nAlso: My favorite 8 smart home upgrades of the year (and why they've already paid for themselves)\nWhen an appliance demands more power than the extension cord can handle, it results in an overload, which could lead to overheating. You really don't want your cord's insulation to melt, exposing the live wires and potentially sparking a fire.\nAny appliance requiring more than 1,800 watts should be on a dedicated circuit -- never connected by an extension cord. And the following are seven household devices you'll definitely want to connect directly to an outlet.\n1. Refrigerators\nRefrigerators don't have heating elements and use less wattage than other kitchen appliances, but they still demand a fierce amount of power because they're constantly running. While the fire risk is a bit lower with fridges, an extension cord could still cause the fridge to modulate its power and malfunction.\nAlso: My picks for the best robot vacuums for pet hair of 2025: Roomba, Eufy, Ecovacs, and more\n2. Toasters or toaster ovens\nDespite their relatively small size, toasters consume significant energy and can be a fire hazard when plugged into extension cords. Toaster ovens are larger and require even more power, typically ranging from 1,200 to 1,400 watts. Keep your toast-making and small baking projects safe by opting for a wall outlet.\n3. Air fryers\nAir fryers are excellent for making leftover French fries crisp again. But that requires a lot of heat, and larger models can consume as much as 2,000 watts -- this poses a considerable fire risk when plugged into even a 14-gauge cord. The same applies to power strips.\nTo ensure safety, it's best to place the air fryer on the countertop and plug it directly into a dedicated wall outlet during use, even if that means pulling it out of the cabinet only when needed.\n4. Microwaves\nA microwave is another heavy-duty appliance that should have its own dedicated circuit due to high wattage. Compact microwaves, like those you find in hotel rooms or RVs, have an average wattage of 600 to 800 watts. Standard microwaves, typically installed in homes and workplace breakrooms, use 800 to 1,000 watts.\nAlso: I lowered my electric bill by changing these 5 TV settings. Here's why they work\nWhile the latter would often be installed amid cabinets with a dedicated circuit, some homes only offer counter space for such a hefty appliance. If that's your scenario, be sure to plug it directly into a ground fault circuit interrupter (GFCI) outlet in your kitchen.\n5. AC units\nAC units, whether portable or window-installed, use too much power for extension cords or power strips. So, be sure to attach them directly to a wall outlet as well. Before doing that, also be sure to use an online BTU (British Thermal Unit) calculator to determine the type you will need to cool your space effectively.\nCooling a typical bedroom -- about 150 square feet -- requires a unit capable of using 6,500 BTU or 1,905 watts. This amount of draw is far too high for an extension cord to handle and could result in a fire.\n6. Space heaters\nAs nice as it is to be able to quickly turn on and off that electric space heater, it's considered one of the riskier household appliances in terms of causing a fire. According to the Consumer Product Safety Commission (CPSC), portable space heaters are involved in an average of 1,700 fires per year in the United States, with some of those resulting from extension cord use.\nThat's because they typically produce around 5,120 BTUs per hour, easily strong enough to melt an extension cord plug.\n7. Extension cords\nWe've all done it: connecting one extension cord to another in an attempt to daisy-chain a device to a power outlet. This is a major no-no in the land of electricity distribution. It could lead to a circuit overheating, which then causes the cord to overheat and start burning. Although a cord isn't technically an appliance, it's important to know there's an inherent danger in connecting one to another.\nAlso: 7 crucial rules for setting up a home security camera - and risky spots to avoid\nThe bottom line is that extension cords shouldn't be used for any mechanism that draws more than 15 amps (1,800 watts), regardless of what it's used for or where the device is situated.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-31T11:18:13.884190Z"
}