{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-10-31-c65f63bf",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/cfpb-meta-probe-advertising",
  "title": "CFPB ends probe into Meta’s financial data advertising practices",
  "url": "https://therecord.media/cfpb-meta-probe-advertising",
  "published_at": "2025-10-31T15:18:39+00:00",
  "fetched_at": "2025-11-01T11:13:17.862800Z",
  "status": "rejected",
  "content": {
    "raw": "The Consumer Financial Protection Bureau has ended a probe into how Meta obtains and uses consumers’ financial data for targeted advertising.",
    "full": "CFPB ends probe into Meta’s financial data advertising practices\nThe Consumer Financial Protection Bureau (CFPB) has ended a probe into how Meta obtains and uses consumers’ financial data for targeted advertising, the company said on Thursday.\nThe disclosure was made in a quarterly report filed with the Securities and Exchange Commission and comes a year after Meta revealed the agency was mulling an enforcement action due to the practices.\nThe CFPB notified the tech giant of the decision to close its investigation on September 25, according to the filing.\nLast October, Meta said that it received a formal notification saying CFPB was probing “our alleged receipt and use for advertising of financial information from third parties through certain advertising tools.”\nThat filing said the investigation was solely focused on advertising for financial products and services and that the CFPB believed Meta’s practices potentially violated the Consumer Financial Protection Act, which shields consumers from unfair and deceptive financial practices.\nThe agency noted at that time that it might “file a lawsuit in the near-term and seek financial penalties and equitable relief,” according to Meta’s 2024 filing.\nThe CFPB has been in the crosshairs of the Trump administration, which tried to effectively shut it down in February before a federal judge intervened. In August, a federal appeals court ruled in favor of the administration, allowing the agency to be largely dismantled due to mass layoffs.\nThe CFPB and Meta did not immediately respond to a request for comment.\nSuzanne Smalley\nis a reporter covering privacy, disinformation and cybersecurity policy for The Record. She was previously a cybersecurity reporter at CyberScoop and Reuters. Earlier in her career Suzanne covered the Boston Police Department for the Boston Globe and two presidential campaign cycles for Newsweek. She lives in Washington with her husband and three children.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-02T11:17:08.634230Z"
}