{
  "id": "bleeping-computer-2025-10-28-33c297b4",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/microsoft/microsoft-sued-for-allegedly-tricking-millions-into-copilot-m365-subscriptions/",
  "title": "Microsoft sued for allegedly tricking millions into Copilot M365 subscriptions",
  "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-sued-for-allegedly-tricking-millions-into-copilot-m365-subscriptions/",
  "published_at": "2025-10-28T17:59:05+00:00",
  "fetched_at": "2025-10-29T17:54:25.986358Z",
  "status": "rejected",
  "content": {
    "raw": "The Australian Competition and Consumer Commission (ACCC) is suing Microsoft for allegedly misleading 2.7 million Australians into paying for the Copilot AI assistant in the Microsoft 365 service. [...]",
    "full": "The Australian Competition and Consumer Commission (ACCC) is suing Microsoft for allegedly misleading 2.7 million Australians into paying for the Copilot AI assistant in the Microsoft 365 service.\nEven though subscribers could have stayed on their existing plan without Copilot and at the same price, the ACCC says that Microsoft concealed that option and designed its communications to make users think that upgrading to the more expensive, AI‑integrated tier was the only way to keep their service active.\nThe legal action was taken after an investigation from the ACCC prompted by multiple complaints about Microsoft’s deceptive practices.\nForcing Copilot onto 365 subscribers\nMicrosoft 365 (formerly Office 365) is a subscription-based productivity suite offering access to Microsoft Office apps and cloud tools such as OneDrive, Teams, and SharePoint.\nOn October 31, 2024, Microsoft completed the integration of the Copilot AI tool into the Microsoft 365 service for Australian customers (global rollout continued through early 2025), providing AI assistance across apps such as drafting text, summarizing reports, and generating explanations through chats.\nFrom that date onward, existing Microsoft 365 subscribers who reached their renewal date or opted for auto-renewal, received messages from Microsoft that did not inform they could continue with their existing tier, without Copilot.\nCustomers would only see that option if they went through the service cancellation process, which ACCC comments isn’t something most people interested in continuing to use Microsoft 365 would do in the first place.\nAs a result, subscribers of the Microsoft 365 Personal tier faced a 45% price increase for Copilot, while those on the Microsoft 365 Family plan saw an increase of 29%.\nLegal violations\nACCC sees Microsoft’s practices as a breach of several sections of the Australian Consumer Law.\nAccording to the legal document, misleading millions of Microsoft 365 subscribers about their renewal options after Copilot was added to the service violates the following ACL sections:\n- Section 18 – Misleading or deceptive conduct\n- Section 29(1)(i) – False or misleading representations about the price of goods or services\n- Section 29(1)(l) – False or misleading representations about the need for goods or services\n- Section 29(1)(m) – False or misleading representations about the existence, exclusion, or effect of a condition or right\nThe ACCC now seeks from the Federal Court of Australia in New South Wales to impose civil penalties on Microsoft, issue injunctions to prevent similar conduct in the future, and order consumer compensation for affected subscribers.\nConsidering that Microsoft’s approach in communicating Copilot’s launch on the Microsoft 365 platform was similar worldwide, similar legal actions might be expected in other regions, too.\nBleepingComputer has contacted Microsoft to request a statement on ACCC’s lawsuit, and a spokesperson responded with the following comment:\n“Consumer trust and transparency are top priorities for Microsoft, and we are reviewing the ACCC's claim in detail. We remain committed to working constructively with the regulator and ensuring our practices meet all legal and ethical standards.”\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-30T11:14:40.919179Z"
}