{
  "id": "bleeping-computer-2025-10-28-0f7f93a5",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/microsoft/microsoft-copilot-now-lets-you-build-apps-automate-workflows/",
  "title": "Microsoft: Copilot now lets you build apps, automate workflows",
  "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-copilot-now-lets-you-build-apps-automate-workflows/",
  "published_at": "2025-10-28T17:59:18+00:00",
  "fetched_at": "2025-10-29T17:54:25.986235Z",
  "status": "rejected",
  "content": {
    "raw": "​Microsoft announced today a new Microsoft 365 Copilot agent called App Builder that can help users create and deploy apps \"in minutes.\" [...]",
    "full": "Microsoft announced today a new Microsoft 365 Copilot agent called App Builder that can help users create and deploy apps \"in minutes.\"\nAs Microsoft explained, this agent allows employees to build apps using their Microsoft 365 data, including documents, presentations, spreadsheets, and notes, \"just as easily as having a conversation.\"\n\"Describe what you need in natural language, and Copilot helps you build it. And because the outputs are integrated with your Copilot experience, they're secure, governed, and connected to your Microsoft 365 data,\" said Charles Lamanna, president of Business & Industry Copilot at Microsoft.\n\"Work with App Builder to create and refine dashboards, charts, calculators, lists, and any other interactive element you can dream up. You can preview and refine your app, over multiple edits and comments, without leaving Copilot.\"\nToday, Redmond also unveiled a new Workflows agent designed to help employees automate tasks such as calendar management, email sending, and sharing team updates.\nTo use it, users must describe what they want to automate and wait for Copilot to convert their prompts into automated flows across Outlook, Teams, SharePoint, Planner, and other services.\nThese new agents are also designed to align with Microsoft 365 Copilot's enterprise-grade security protections and will automatically enforce role-based access controls and individual permissions for data.\n\"They are available exclusively through Microsoft 365 which helps ensure all activity stays secure, compliant, and aligned with organizational policies,\" Lamanna said. \"For admins, management is streamlined with unified permissions, visibility, and controls across the organization. Access to these conversational AI building tools can be managed in the agent inventory section of the Microsoft 365 admin center, so there's no need for one-by-one guardrails.\"\nLamanna added that, for now, the App Builder and Workflows agents are available only to Microsoft 365 Copilot customers enrolled in the Frontier program.\nWhile App Builder is coming to the Agent Store for customers in the Frontier program this week, Workflows is already available there for Microsoft 365 Copilot users.\nToday's news follows Microsoft's September announcement that the Microsoft 365 Copilot app will be automatically installed on Windows systems outside the European Economic Area (EEA) region that have the Microsoft 365 desktop client apps.\nAs part of the same effort to expand Copilot's reach, it also revealed that Microsoft 365 Copilot agents will be added to the Edge sidebar starting in late September 2025, and it added a new setting that allows Microsoft 365 admins to pin the Microsoft 365 Copilot app to the Windows taskbar.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:02:12.495467Z"
}