{
  "id": "bleeping-computer-2025-10-28-4f27bd73",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/software/python-rejects-15m-grant-from-us-govt-fearing-ethical-compromise/",
  "title": "Python rejects $1.5M grant from U.S. govt. fearing ethical compromise",
  "url": "https://www.bleepingcomputer.com/news/software/python-rejects-15m-grant-from-us-govt-fearing-ethical-compromise/",
  "published_at": "2025-10-28T22:16:37+00:00",
  "fetched_at": "2025-10-29T17:54:25.985684Z",
  "status": "rejected",
  "content": {
    "raw": "The Python Software Foundation (PSF) has withdrawn its $1.5 million grant proposal to the U.S. National Science Foundation (NSF) due to funding terms forcing a compromise on its commitment to diversity, equity, and inclusion.. [...]",
    "full": "The Python Software Foundation (PSF) has withdrawn its $1.5 million grant proposal to the U.S. National Science Foundation (NSF) due to funding terms forcing a compromise on its commitment to diversity, equity, and inclusion.\nThe funding would come through NSF’s Safety, Security, and Privacy of Open Source Ecosystems program, an initiative that finances research and development efforts aimed at improving the resilience and trustworthiness of open-source software infrastructure.\nThe non-profit organization devoted to the Python programming language submitted its proposal in January 2025, hoping to to secure financial resources to address security vulnerabilities in Python and the Python Package Index (PyPI).\nSpecifically, the money would help develop automated malware-detection tools for PyPI package uploads, which have been introducing risks on the platform for the past couple of years.\nThe same tools would have been ported to other open-source ecosystems like NPM and Crate.io.\nAfter several months, the NSF approved the funding imposed restrictive clauses that led PSF’s board members to reconsider and ultimately reject money.\nSpecifically, the terms required recipients to affirm that they would not operate programs that “advance or promote diversity, equity, and inclusion (DEI).”\nAll PSF activities would be impacted by the clause, not just the grant-funded work, and a violation could permit requesting back the previously approved and transferred funds, creating a financial risk for the foundation.\nThe PSF states that DEI is central to its mission and values, and therefore is intrinsically incompatible with NSF funding under the proposed conditions.\n“The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers,” the Python Software Foundation says.\nHence, PSF’s board members have unanimously voted against accepting the funding, proceeding to withdraw their application.\nThis decision echoes a similar one taken by The Carpentries in June 2025, which had applied under the “Pathways to Enable Open-Source Ecosystems” (POSE) funding program, but which was subject to the same DEI-related restrictions.\nIn its announcement, the Python Software Foundation underlined that the need for financial support is now greater than ever, calling people to become PSF members, donate, and sponsor.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-29T18:01:51.645834Z"
}