{
  "id": "bleeping-computer-2025-11-04-5e1af744",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/media-giant-nikkei-reports-data-breach-impacting-17-000-people/",
  "title": "Media giant Nikkei reports data breach impacting 17,000 people",
  "url": "https://www.bleepingcomputer.com/news/security/media-giant-nikkei-reports-data-breach-impacting-17-000-people/",
  "published_at": "2025-11-04T16:28:19+00:00",
  "fetched_at": "2025-11-05T11:13:00.824953+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Japanese publishing giant Nikkei announced earlier today that its Slack messaging platform had been compromised, exposing the personal information of over 17,000 employees and business partners. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Image: Nikkei/Masayuki Kozono\nJapanese publishing giant Nikkei announced earlier today that its Slack messaging platform had been compromised, exposing the personal information of over 17,000 employees and business partners.\nNikkei is one of the largest media corporations worldwide, owns the Financial Times and The Nikkei, the world's largest financial newspaper. It has approximately 3.7 million digital paid subscriptions, as well as over 40 affiliated companies involved in publishing, broadcasting, events, database services, and the index business.\nThe media giant, which acquired the Financial Times in 2015, currently has 37 foreign editorial bureaus and over 1,500 journalists worldwide.\nIn a Tuesday statement, Nikkei stated that attackers gained access to employee Slack accounts by using authentication credentials stolen after an employee's computer was infected with malware.\nNikkei discovered the security breach in September, which prompted immediate security measures, including mandatory password changes.\n\"Potentially leaked information includes the names, email addresses, and chat histories for 17,368 individuals registered on Slack,\" the company said.\nDespite the scale of the incident, Nikkei said the stolen information doesn't fall under Japan's Personal Information Protection Law, which mandates reporting for certain data breaches. However, it voluntarily notified the country's Personal Information Protection Commission, citing its commitment to transparency and the incident's \"significance.\"\nThe publisher added that no information related to confidential sources or reporting activities was compromised during the incident, adding that personal data collected for journalistic purposes remains secure.\n\"No leakage of information related to sources or reporting activities has been confirmed. We take this incident seriously and will further strengthen personal information management to prevent any recurrence,\" Nikkei said.\nIn May 2022, Nikkei's subsidiary in Singapore was hit by a ransomware attack, which impacted a server that \"likely contained customer data.\"\nThree years earlier, in late September 2019, Nikkei lost approximately $29 million in a business email compromise (BEC) attack after a Nikkei America employee was tricked by scammers posing as a Nikkei executive into sending the funds to a bank account they controlled.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
      "enhanced_at": 1762341466.9093964,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:46.909701+00:00Z"
}