{
  "id": "bleeping-computer-2025-11-04-230d0463",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/european-police-dismantles-600-million-crypto-investment-fraud-ring/",
  "title": "Police arrests suspects linked to €600 million crypto fraud ring",
  "url": "https://www.bleepingcomputer.com/news/security/european-police-dismantles-600-million-crypto-investment-fraud-ring/",
  "published_at": "2025-11-04T15:09:22+00:00",
  "fetched_at": "2025-11-05T11:13:00.825217+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "European law enforcement authorities have arrested nine suspected money launderers who set up a cryptocurrency fraud network that stole over €600 million ($689 million) from victims across multiple countries. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "European law enforcement authorities have arrested nine suspected money launderers who set up a cryptocurrency fraud network that stole over €600 million ($689 million) from victims across multiple countries.\nThe fraudsters allegedly created fake cryptocurrency investment platforms that looked legitimate and promised high returns, and recruited victims through various means, including social media and cold calling.\nOnce the victims transferred their cryptocurrency, they were unable to recover their funds, while the criminals successfully laundered more than €600 million in stolen assets using blockchain tools.\nThe coordinated operation took place on October 27 and 29 in Cyprus, Spain, and Germany, and was coordinated by Eurojust, the European Union's judicial cooperation agency, from its headquarters in The Hague.\n\"Nine suspects were arrested at their homes in Cyprus, Spain and Germany on suspicion of their involvement in money laundering from fraudulent activities. At the same time, searches took place that resulted in the seizure of EUR 800 000 in bank accounts, EUR 415 000 in cryptocurrencies and EUR 300 000 in cash,\" Eurojust said on Tuesday.\n\"The members of the network created dozens of fake cryptocurrency investment platforms that looked like legitimate websites and promised high returns. They recruited their victims using a variety of methods such as social media advertising, cold calling, fake news articles and fake testimonials from celebrities or successful investors.\"\nLast month, European police arrested five additional suspects linked to another large-scale cryptocurrency investment fraud network that has stolen over €100 million ($118 million) from more than 100 victims since at least 2018.\nIn June, Spanish police apprehended five more suspects linked to the laundering $540 million (€460 million) from illegal cryptocurrency investment schemes and believed to have defrauded over 5,000 victims worldwide.\nOne month later, the Spanish police dismantled another investment fraud operation linked to damages exceeding $11.8 million (€10 million).\nThe U.S. Federal Trade Commission revealed earlier this year that Americans lost a record $12.5 billion to fraud in 2024, with investment scams resulting in the highest reported losses, totaling approximately $5.7 billion.\nThe 2026 CISO Budget Benchmark\nIt's budget season! Over 300 CISOs and security leaders have shared how they're planning, spending, and prioritizing for the year ahead. This report compiles their insights, allowing readers to benchmark strategies, identify emerging trends, and compare their priorities as they head into 2026.\nLearn how top leaders are turning investment into measurable impact.",
      "enhanced_at": 1762341480.732092,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:18:00.732357+00:00Z"
}