{
  "id": "bleeping-computer-2025-11-04-d14e17ab",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/data-breach-at-major-swedish-software-supplier-impacts-15-million/",
  "title": "Data breach at major Swedish software supplier impacts 1.5 million",
  "url": "https://www.bleepingcomputer.com/news/security/data-breach-at-major-swedish-software-supplier-impacts-15-million/",
  "published_at": "2025-11-04T16:53:27+00:00",
  "fetched_at": "2025-11-05T11:13:00.824674+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Swedish Authority for Privacy Protection (IMY) is investigating a cyberattack on IT systems supplier Miljödata that exposed data belonging to 1.5 million people. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The Swedish Authority for Privacy Protection (IMY) is investigating a cyberattack on IT systems supplier Miljödata that exposed data belonging to 1.5 million people.\nMiljödata is an IT systems supplier for roughly 80% of Sweden's municipalities. The company disclosed the incident on August 25, saying that the attackers stole data and demanded 1.5 Bitcoin to not leak it.\nThe attack caused operational disruptions that affected citizens in multiple regions in the country, including Halland, Gotland, Skellefteå, Kalmar, Karlstad, and Mönsterås.\nBecause of the large impact, the state monitored the situation from the time of disclosure, with CERT-SE and the police starting to investigate immediately..\nAccording to IMY, the attacker exposed on the dark web data that corresponds to 1.5 million people in the country, creating the basis for investigating potential General Data Protection Regulation (GDPR) violations.\n\"The Miljödata leak meant that a large portion of Sweden's population had their personal data published on the Darknet — in many cases, even sensitive information,\" stated IMY's head, Jenny Bård.\n\"The leak raises a number of questions about the level of security and what types of personal data were stored in the systems.\"\n\"Our main focus is to investigate any shortcomings that could provide lessons going forward, in order to reduce the risk of similar incidents happening again.\"\nDue to the extensive impact, IMY has decided to prioritize investigation targets in accordance to the criticality of their operations, limiting it to Miljödata, the City of Gothenburg, the Municipality of Älmhult, and the Region of Västmanland.\nMiljödata will be investigated in relation to security measures, while the municipalities will be examined for their data handling practices, with particular focus on children's data, protected identity subjects, and former employees.\nAdditional entities may be investigated in the future, but there are no such plans for now.\nAlthough no ransomware groups had claimed the attack when Miljödata disclosed the incident, BleepingComputer found that the threat group Datacarry posted the stolen data on its dark web portal on September 13.\nThe threat actors, who list an additional 12 victims on their website, provide a 224MB archive with data allegedly stolen from Miljödata.\nHave I Been Pwned has also added to its database the leaked Miljödata information, which contains names, email addresses, physical addresses, phone numbers, government IDs, and dates of birth.\nThe data breach alerting service reports that the leaked data corresponds to 870,000 people, which is roughly half the figure provided by IMY.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
      "enhanced_at": 1762341461.2519555,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:41.252262+00:00Z"
}