{
  "id": "bleeping-computer-2025-11-04-673649c4",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/apache-openoffice-disputes-data-breach-claims-by-ransomware-gang/",
  "title": "Apache OpenOffice disputes data breach claims by ransomware gang",
  "url": "https://www.bleepingcomputer.com/news/security/apache-openoffice-disputes-data-breach-claims-by-ransomware-gang/",
  "published_at": "2025-11-04T21:18:43+00:00",
  "fetched_at": "2025-11-05T11:13:00.823891+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Apache Software Foundation disputes claims that its OpenOffice project suffered an Akira ransomware attack, after the threat actors claimed to have stolen 23 GB of corporate documents. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The Apache Software Foundation disputes claims that its OpenOffice project suffered an Akira ransomware attack, after the threat actors claimed to have stolen 23 GB of corporate documents.\nApache OpenOffice is a free, open-source office suite that includes word processing, spreadsheets, presentations, graphics, and database tools. It's compatible with major file formats, such as Word and Excel, and runs on multiple operating systems.\nOn October 30th, the Akira ransomware gang claimed it had breached Apache OpenOffice and stolen 23 GB of data, including employee and financial information, as well as internal files.\n\"We will upload 23gb of corporate documents soon. Employee information (addresses, phones, DOB, driver licenses, social security cards, credit cards information and so on), financial information, internal confidential files, lots of reports about their problems with the application and so on,\" reads an entry for Apache OpenOffice on the Akira data leak site.\nHowever, the Apache Software Foundation has no idea what the ransomware gang is referring to, as it says it does not possess the types of data claimed to have been stolen.\n\"The Apache Software Foundation takes security of our projects' software very seriously, and we are currently investigating this claim. There has been no reported ransom demand to the Foundation orthe Apache OpenOffice project at this time.\" the Apache Software Foundation told BleepingComputer.\n\"Since Apache OpenOffice is an open source software project, none of our contributors are paid employees for the project or the foundation, so we don't even possess the set of data described in the claim.\"\n\"Therefore, we do not believe this claim is directed at the ASF's or Apache OpenOffice project's infrastructure itself. And, because OpenOffice is developed in an open and transparent manner on our developer mailing lists, all concerns about bugs and feature requests are already public.\"\nToday, the Foundation reaffirmed that its investigation has not found any evidence of a breach and that it has not contacted law enforcement or any cybersecurity experts.\nAt this time, there is no evidence that Apache OpenOffice or the Apache Software Foundation's systems were compromised, and the Akira gang has not leaked any of the data they claimed to have stolen.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
      "enhanced_at": 1762341433.8652635,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:13.865573+00:00Z"
}