{
  "id": "bleeping-computer-2025-11-04-d36b933b",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/russian-hackers-abuse-hyper-v-to-hide-malware-in-linux-vms/",
  "title": "Russian hackers abuse Hyper-V to hide malware in Linux VMs",
  "url": "https://www.bleepingcomputer.com/news/security/russian-hackers-abuse-hyper-v-to-hide-malware-in-linux-vms/",
  "published_at": "2025-11-04T14:00:00+00:00",
  "fetched_at": "2025-11-05T11:13:00.825767+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Russian hacker group Curly COMrades is abusing Microsoft Hyper-V in Windows to bypass endpoint detection and response solutions by creating a hidden Alpine Linux-based virtual machine to run malware. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The Russian hacker group Curly COMrades is abusing Microsoft Hyper-V in Windows to bypass endpoint detection and response solutions by creating a hidden Alpine Linux-based virtual machine to run malware.\nInside the virtual environment, the threat actor hosted its custom tools, the CurlyShell reverse shell and the CurlCat reverse proxy, which enabled operational stealth and communication.\nCurly COMrades is a cyber-espionage threat group believed to be active since mid-2024. Its activities are closely aligned with Russian geopolitical interests.\nBitdefender previously exposed Curly COMrades activities against government and judicial bodies in Georgia, as well as energy firms in Moldova.\nWith the help of the Georgian CERT, the Romanian cybersecurity firm uncovered more about the threat actor's latest operation.\nThe researchers found that in early July, after gaining remote access to two machines, Curly COMrades executed commands to enable Hyper-V and disable its management interface.\nMicrosoft includes the Hyper-V native hypervisor technology that provides hardware virtualization capabilities in Windows (Pro and Enterprise) and Windows Server operating systems, allowing users to run virtual machines (VMs).\n\"The attackers enabled the Hyper-V role on selected victim systems to deploy a minimalistic, Alpine Linux-based virtual machine. This hidden environment, with its lightweight footprint (only 120MB disk space and 256MB memory), hosted their custom reverse shell, CurlyShell, and a reverse proxy, CurlCat,\" Bitdefender explains in a report shared with BleepingComputer.\nBy keeping the malware and its execution inside a virtual machine (VM), the hackers were able to bypass traditional host-based EDR detections, which lacked network inspection capabilities that could detect the threat actor's command and control (C2) traffic from the VM.\nAlthough relying on virtualization to evade detection is not a new technique, the fragmented coverage of security tools makes it an effective approach on networks that lack a holistic, multi-layered protection.\nIn the Curly COMrades attacks, evasion was achieved by using the name 'WSL' for the VM, alluding to the Windows Subsystem for Linux feature in the operating system, in the hope of slipping unobserved.\nThe Alpine Linux VM was configured in Hyper-V to use the Default Switch network adapter, which passed all the traffic through the host's network stack.\n\"In effect, all malicious outbound communication appears to originate from the legitimate host machine's IP address,\" Bitdefender researchers explain.\nThe two custom implants deployed in the VM are ELF binaries based on libcurl and are used for command execution and traffic tunneling:\n- CurlyShell – Executes commands, runs inside the hidden Alpine VM and maintains persistence via a cron job. It runs in headless mode and connects to the command-and-control (C2) over HTTPS\n- CurlCat – Companion tool used when tunneling is needed, invoked by the shell implant to create a covert SOCKS proxy back to the operator. It wraps SSH traffic into HTTPS requests, allowing network pivoting while blending with normal operations noise.\nWhile investigating the incidents, the researchers also discovered that Curly COMrades used two PowerShell scripts for persistence and pivoting to remote systems.\n\"One was designed to inject a Kerberos ticket into LSASS, enabling authentication to remote systems and execution of commands,\" the researchers say.\nThe second script was deployed through the Group Policy feature and created a local account across machines on the same domain.\nThe researchers note that the sophistication level of the investigated Curly COMrades attacks reveal an activity tailored for stealth and operational security. The hackers encrypted the embedded payloads and abused PowerShell capabilities, which led to minimum forensic traces on the compromised hosts.\nBased on the observations in these attacks, Bitdefender suggests that organizations should monitor for abnormal Hyper-V activation, LSASS access, or PowerShell scripts deployed via Group Policy that trigger local account password resets, or creating new ones.\n7 Security Best Practices for MCP\nAs MCP (Model Context Protocol) becomes the standard for connecting LLMs to tools and data, security teams are moving fast to keep these new services safe.\nThis free cheat sheet outlines 7 best practices you can start using today.",
      "enhanced_at": 1762341502.6067462,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:18:22.607079+00:00Z"
}