{
  "id": "bleeping-computer-2025-11-04-9261214e",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/hackers-exploit-wordpress-plugin-post-smtp-to-hijack-admin-accounts/",
  "title": "Hackers exploit WordPress plugin Post SMTP to hijack admin accounts",
  "url": "https://www.bleepingcomputer.com/news/security/hackers-exploit-wordpress-plugin-post-smtp-to-hijack-admin-accounts/",
  "published_at": "2025-11-04T21:46:50+00:00",
  "fetched_at": "2025-11-05T11:13:00.823622+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Threat actors are actively exploiting a critical vulnerability in the Post SMTP plugin installed on more than 400,000 WordPress sites, to take complete control by hijacking administrator accounts. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Threat actors are actively exploiting a critical vulnerability in the Post SMTP plugin installed on more than 400,000 WordPress sites, to take complete control by hijacking administrator accounts.\nPost SMTP is a popular email delivery solution marketed as a feature-rich and more reliable replacement of the default ‘wp_mail()’ function.\nOn October 11, WordPress security firm Wordfence received a report from researcher ‘netranger’ about an email log disclosure issue that could be leveraged for account takeover attacks.\nThe issue, tracked as CVE-2025-11833, received a critical-severity score of 9.8 and impacts all versions of Post SMTP from 3.6.0 and older.\nThe vulnerability stems from the lack of authorization checks in the ‘_construct’ function of the plugin’s ‘PostmanEmailLogs’ flow.\nThat constructor directly renders logged email content when it is requested without performing capability checks, allowing unauthenticated attackers to read arbitrary logged emails.\nThe exposure includes password reset messages with links that allow changing an administrator’s password without the need of a legitimate account holder, potentially leading to account takeover and full site compromise.\nWordfence validated the researcher’s exploit on October 15 and fully disclosed the issue to the vendor, Saad Iqbal, on the same day.\nA patch arrived on October 29, with Post SMTP version 3.6.1. Based on WordPress.org data, roughly half of the plugin’s users have downloaded it since the release of the patch, leaving at least 210,000 sites vulnerable to admin takeover attacks.\nAccording to Wordfence, hackers started exploiting CVE-2025-11833 on November 1. Since then, the security firm has blocked over 4,500 exploit attempts on its customers.\nGiven the active exploitation status, website owners using Post SMTP are advised to move to version 3.6.1 immediately or disable the plugin.\nIn July, PatchStack revealed that Post SMTP was vulnerable to a flaw that allowed hackers to access email logs containing full message content, even from a subscriber level.\nThat flaw, tracked as CVE-2025-24000, had the same repercussions as CVE-2025-11833, allowing unauthorized users to trigger password resets, intercept messages, and take control of administrator accounts.\nSecrets Security Cheat Sheet: From Sprawl to Control\nWhether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start.\nGet the cheat sheet and take the guesswork out of secrets management.",
      "enhanced_at": 1762341422.9477668,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:02.948103+00:00Z"
}