{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-04-af25f8bf",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42277",
  "title": "Stoïk lanza su servicio MDR en España junto a CrowdStrike y SentinelOne",
  "url": "https://cybersecuritynews.es/stoik-lanza-su-servicio-mdr-en-espana-junto-a-crowdstrike-y-sentinelone/",
  "published_at": "2025-11-04T22:00:00+00:00",
  "fetched_at": "2025-11-05T11:14:32.579315+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Stoïk,&nbsp;primera insurtech de Europa especializada en riesgos cibernéticos para empresas con ingresos de hasta 1.000M de euros, amplía su oferta y&nbsp;lanza&nbsp;Stoïk MDR, solución que permite&nbsp;anticipar ciberataques mediante alertas y la detección de un EDR, combinado con la experiencia de un equipo interno que gestiona y responde a las amenazas en tiempo real. Esta nueva solución&nbsp;se integra dentro del ecosistema de protección 360° de Stoïk, que combina cuatro pilares que se refuerzan mutuamente: la prevención (Stoïk Protect), la detección y neutralización de amenazas (Stoïk MDR), la respuesta a incidentes (CERT interno) y la transferencia del riesgo (el seguro Stoïk). Este enfoque opera en un ciclo continuo de mejora, diseñado para&nbsp;reducir el riesgo de forma proactiva y minimizar el impacto financiero y operativo&nbsp;en caso de incidente. Con este lanzamiento,&nbsp;Stoïk hace accesible un nivel de ciberseguridad gestionada&nbsp;que habitualmente se reserva a grandes corporaciones. Las empresas pueden ahora beneficiarse de&nbsp;la potencia de un Centro de Operaciones de Seguridad&nbsp;(SOC) de primer nivel,&nbsp;sin tener que asumir los elevados costes de personal y herramientas&nbsp;que esto implica, y explotando de forma eficaz el volumen de alertas de una tecnología EDR. “El lanzamiento de Stoïk MDR nace directamente de nuestra experiencia. Al gestionar cientos de incidentes cada año, tenemos una visión única de lo que realmente debilita a las empresas. Stoïk MDR no es una herramienta más, es nuestra respuesta directa a los incidentes de ransomware que hemos gestionado para nuestros asegurados. La prueba de que este enfoque funciona es contundente ya que, hasta la fecha, el 100% de nuestros clientes de MDR ha evitado con éxito cualquier incidente de ransomware”, declara Juan Ignacio Ramallo, Country Manager Iberia de Stoïk. Tecnología de vanguardia y expertise humano, los pilares de este nuevo producto Para hacer posible esta defensa activa, Stoïk se apoya en dos pilares fundamentales. Por un lado, ha incorporado como&nbsp;socios tecnológicos estratégicos&nbsp;a dos plataformas líderes en ciberseguridad a nivel mundial, como son&nbsp;CrowdStrike y SentinelOne. En este sentido, su tecnología ofrece avanzadas capacidades de investigación forense para&nbsp;prevenir ataques, responder ante incidentes, llevar a cabo acciones de aislamiento, identificar amenazas mediante análisis de comportamiento (indicadores de ataque IoA y de compromiso IoC), machine learning e inteligencia artificial. Esto permite detectar ataques sofisticados y comportamientos maliciosos, incluso aquellos que escapan a las soluciones de seguridad tradicionales. Y, por otro lado,&nbsp;la respuesta a las amenazas recae en los especialistas en ciberseguridad del Centro de Operaciones de Seguridad (SOC) de Stoïk, quienes&nbsp;acumulan más de 30 años de experiencia en gestión de crisis cibernéticas&nbsp;y han resuelto cientos de incidentes para sus asegurados. Apoyándose en las mejores soluciones del mercado, utilizan su experiencia para evaluar las alertas recibidas y concentrarse en aquellas que puedan derivar en un incidente real.&nbsp;Es este equipo el que, una vez se detecta una ciberamenaza, gestiona y analiza las alertas,&nbsp;ofreciendo un servicio completo de detección y respuesta gestionada (MDR) que permite responder a esos ataques en tiempo real. “Con Stoïk MDR, nuestros corredores asociados tienen ahora la capacidad de combinar, en una única solución, la mejor cobertura de seguro con una defensa activa de primer nivel. Esto no solo reducela siniestralidad, sino que refuerza de forma decisiva su rol como asesores de riesgo integrales, indispensables para sus clientes en un entorno digital cada vez más hostil”, afirma Ramallo. Así, el MDR ayuda a que los expertos&nbsp;identifiquen rápidamente las amenazas y respondan de forma eficaz, reduciendo considerablemente el riesgo de siniestro. Y si un incidente provoca daños, la organización será indemnizada gracias a la póliza de seguros. Esta nueva propuesta sólo estará&nbsp;disponible para los asegurados de Stoïk y será comercializada por los corredores de seguros asociados, quienes podrán combinar una cobertura de seguro con una solución de ciberseguridad de alto nivel. La entrada Stoïk lanza su servicio MDR en España junto a CrowdStrike y SentinelOne se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Stoïk, primera insurtech de Europa especializada en riesgos cibernéticos para empresas con ingresos de hasta 1.000M de euros, amplía su oferta y lanza Stoïk MDR, solución que permite anticipar ciberataques mediante alertas y la detección de un EDR, combinado con la experiencia de un equipo interno que gestiona y responde a las amenazas en tiempo real.\nEsta nueva solución se integra dentro del ecosistema de protección 360° de Stoïk, que combina cuatro pilares que se refuerzan mutuamente: la prevención (Stoïk Protect), la detección y neutralización de amenazas (Stoïk MDR), la respuesta a incidentes (CERT interno) y la transferencia del riesgo (el seguro Stoïk). Este enfoque opera en un ciclo continuo de mejora, diseñado para reducir el riesgo de forma proactiva y minimizar el impacto financiero y operativo en caso de incidente.\nCon este lanzamiento, Stoïk hace accesible un nivel de ciberseguridad gestionada que habitualmente se reserva a grandes corporaciones. Las empresas pueden ahora beneficiarse de la potencia de un Centro de Operaciones de Seguridad (SOC) de primer nivel, sin tener que asumir los elevados costes de personal y herramientas que esto implica, y explotando de forma eficaz el volumen de alertas de una tecnología EDR.\n“El lanzamiento de Stoïk MDR nace directamente de nuestra experiencia. Al gestionar cientos de incidentes cada año, tenemos una visión única de lo que realmente debilita a las empresas. Stoïk MDR no es una herramienta más, es nuestra respuesta directa a los incidentes de ransomware que hemos gestionado para nuestros asegurados. La prueba de que este enfoque funciona es contundente ya que, hasta la fecha, el 100% de nuestros clientes de MDR ha evitado con éxito cualquier incidente de ransomware”, declara Juan Ignacio Ramallo, Country Manager Iberia de Stoïk.\nTecnología de vanguardia y expertise humano, los pilares de este nuevo producto\nPara hacer posible esta defensa activa, Stoïk se apoya en dos pilares fundamentales. Por un lado, ha incorporado como socios tecnológicos estratégicos a dos plataformas líderes en ciberseguridad a nivel mundial, como son CrowdStrike y SentinelOne. En este sentido, su tecnología ofrece avanzadas capacidades de investigación forense para prevenir ataques, responder ante incidentes, llevar a cabo acciones de aislamiento, identificar amenazas mediante análisis de comportamiento (indicadores de ataque IoA y de compromiso IoC), machine learning e inteligencia artificial. Esto permite detectar ataques sofisticados y comportamientos maliciosos, incluso aquellos que escapan a las soluciones de seguridad tradicionales.\nY, por otro lado, la respuesta a las amenazas recae en los especialistas en ciberseguridad del Centro de Operaciones de Seguridad (SOC) de Stoïk, quienes acumulan más de 30 años de experiencia en gestión de crisis cibernéticas y han resuelto cientos de incidentes para sus asegurados. Apoyándose en las mejores soluciones del mercado, utilizan su experiencia para evaluar las alertas recibidas y concentrarse en aquellas que puedan derivar en un incidente real. Es este equipo el que, una vez se detecta una ciberamenaza, gestiona y analiza las alertas, ofreciendo un servicio completo de detección y respuesta gestionada (MDR) que permite responder a esos ataques en tiempo real.\n“Con Stoïk MDR, nuestros corredores asociados tienen ahora la capacidad de combinar, en una única solución, la mejor cobertura de seguro con una defensa activa de primer nivel. Esto no solo reducela siniestralidad, sino que refuerza de forma decisiva su rol como asesores de riesgo integrales, indispensables para sus clientes en un entorno digital cada vez más hostil”, afirma Ramallo.\nAsí, el MDR ayuda a que los expertos identifiquen rápidamente las amenazas y respondan de forma eficaz, reduciendo considerablemente el riesgo de siniestro. Y si un incidente provoca daños, la organización será indemnizada gracias a la póliza de seguros.\nEsta nueva propuesta sólo estará disponible para los asegurados de Stoïk y será comercializada por los corredores de seguros asociados, quienes podrán combinar una cobertura de seguro con una solución de ciberseguridad de alto nivel.",
      "enhanced_at": 1762341418.747964,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:16:58.748243+00:00Z"
}