{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-04-ecfaef98",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42270",
  "title": "Pronósticos de ciberseguridad para 2026",
  "url": "https://cybersecuritynews.es/pronosticos-de-ciberseguridad-para-2026/",
  "published_at": "2025-11-04T22:00:00+00:00",
  "fetched_at": "2025-11-05T11:14:32.578905+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Un año más, Google Cloud ha presentado sus ‘Pronósticos de ciberseguridad para 2026’, un estudio elaborado con el objetivo de ayudar a las organizaciones de la región EMEA a prepararse para una serie de amenazas y desafíos específicos a los que se enfrentarán en 2026. Las conclusiones han sido recopiladas por expertos en seguridad de numerosos equipos de seguridad de Google Cloud y se centran en tres áreas fundamentales: el uso de la inteligencia artificial por parte de adversarios y defensores, la ciberdelincuencia como la amenaza global más disruptiva, y las operaciones continuadas de los actores estatales para alcanzar sus objetivos estratégicos. El uso de la inteligencia artificial por parte de adversarios y defensores El año 2026 marcará el comienzo de una nueva era en materia de IA y seguridad, tanto para los adversarios como para los defensores. Principalmente, se espera que su uso por parte de actores maliciosos pase de ser una excepción a convertirse en la norma, lo que transformará notablemente el panorama de las amenazas cibernéticas al acelerar operaciones como la ingeniería social, las operaciones de información y el desarrollo de malware. En 2026, los adversarios dejarán atrás el simple phishing basado en texto para aprovechar al máximo la IA generativa multimodal (deepfakes de voz, texto y vídeo) con el fin de crear suplantaciones convincentes y sensibles al contexto de ejecutivos, empleados o socios de confianza. Esto acelerará el éxito del vishing (phishing de voz) y permitirá ataques hiperrealistas de compromiso del correo electrónico empresarial (BEC) a gran escala. Mientras que los autores de amenazas aprovecharán la IA para aumentar la velocidad, el alcance y la eficacia de los ataques, los defensores también utilizarán agentes de IA para potenciar las operaciones de seguridad y mejorar las capacidades de los analistas. Sin embargo, esta transformación plantea nuevos retos, como los riesgos de los «agentes en la sombra» (Shadow Agents) y la necesidad de evolucionar la gestión de identidades y accesos. En ese sentido, los empleados que implementen agentes de IA autónomos sin autorización crearán canales invisibles y no controlados para datos confidenciales, lo que dará lugar a fugas y riesgos de cumplimiento. El problema subsiguiente de las herramientas de IA no controladas se convertirá en un desafío crítico de «agentes en la sombra» (Shadow Agents). La ciberdelincuencia sigue causando estragos a nivel mundial Las operaciones con motivaciones económicas, en particular el ransomware y el&nbsp; secuestro de datos, seguirán siendo una fuerza dominante y disruptiva. Constituirán, también, la categoría de ciberdelincuencia más perjudicial desde el punto de vista financiero a nivel mundial, impulsada por grandes grupos especializados que explotan a proveedores externos y vulnerabilidades de Día Cero en ataques en cascada de gran volumen. En paralelo, a medida que las organizaciones protegen los sistemas internos, más adversarios adoptarán como estrategia predeterminada atacar de forma sistemática la infraestructura de virtualización subyacente (hipervisores). Se trata de un punto ciego crítico en el que un solo compromiso puede otorgar a los atacantes el control sobre todo el patrimonio digital para llevar a cabo un cifrado masivo y una interrupción sistémica. Amenazas ciberfísicas y de otras clases Recientemente, la presidenta de la Comisión Europea, Ursula von der Leyen, ha declarado que Europa debe ir más allá de la defensa tradicional para contrarrestar la escalada de la guerra híbrida. De cara al próximo año, Europa debe prepararse para afrontar ataques ciberfísicos dirigidos a infraestructuras críticas, como las redes de energía, el transporte y las infraestructuras digitales. Y, muy probablemente, esos ataques ciberfísicos potenciales se combinarán con operaciones de información que buscarán minar la confianza de la población. Google Cloud prevé un aumento de las campañas de ciberespionaje orquestadas por agentes alineados con gobiernos como el ruso y el chino, que tendrán como objetivos a los gobiernos europeos, la defensa y organismos de investigación activos en sectores tecnológicos críticos y emergentes. Por otro lado, se espera que los agentes de amenazas redoblen su presión sobre las cadenas de suministro europeas, en especial sobre los proveedores de servicios gestionados y las dependencias de software, para ganar acceso a un gran número de objetivos conectados. Tendencias de los actores estatales Desde el punto de vista geopolítico, actores estatales como Rusia, China, Irán y Corea del Norte seguirán representando amenazas importantes y en constante evolución, impulsadas por intereses estratégicos distintos y empleando diversas tácticas cibernéticas: Rusia: Se espera que las operaciones cibernéticas de Rusia experimenten un cambio estratégico, pasando del apoyo táctico a corto plazo al conflicto en Ucrania a dar prioridad a los objetivos estratégicos globales a largo plazo. Esto incluye el desarrollo de capacidades cibernéticas avanzadas, la recopilación de inteligencia para apoyar los intereses políticos y económicos globales y la obtención de puntos de apoyo estratégicos dentro de los entornos de infraestructura crítica internacional. Corea del Norte: El aparato de amenazas cibernéticas de Corea del Norte intensificará sus operaciones, muy exitosas y lucrativas, contra las organizaciones y los usuarios de criptomonedas para generar ingresos. Aumentarán la innovación técnica, basándose en tácticas avanzadas de ingeniería social, como atraer a sus objetivos con falsas evaluaciones de contratación y utilizar vídeos deepfake para engañar a personal de alto valor. China: Se prevé que el volumen de operaciones cibernéticas relacionadas con China siga superando al de otras naciones en 2026, dando prioridad a las operaciones sigilosas y maximizando la escala operativa. Estos actores atacarán agresivamente los dispositivos periféricos, explotarán las vulnerabilidades de Día Cero y se centrarán en los proveedores externos. Irán: La actividad cibernética iraní en 2026 estará impulsada por los objetivos de estabilidad del régimen y el mantenimiento de la influencia regional en medio de los conflictos geopolíticos en curso. La escalada de tensiones regionales entre Irán, Israel y Estados Unidos seguirá alimentando el aumento del ciberespionaje, los ataques disruptivos y las operaciones de información, lo que significa que el riesgo de despliegue de programas de borrado sigue siendo elevado, como se observa en la acumulación de tácticas agresivas desde octubre de 2023. Los trabajadores informáticos de Corea del Norte amplían sus actividades Es probable que, para 2026, los trabajadores informáticos de Corea del Norte consoliden su presencia y expansión en Europa, con los consiguientes riesgos financieros y de espionaje para las organizaciones europeas En Estados Unidos, la presión de las fuerzas de seguridad, junto con una mayor concienciación, han conseguido reprimir sus operaciones. Como resultado, estos agentes se han reorientado hacia Europa, en donde tratan de conseguir empleo y mantener una fuente de ingresos para el régimen norcoreano. Las organizaciones deben prepararse para un aumento de las campañas de extorsión agresivas ya que, como se ha observado, estos trabajadores amenazan con divulgar datos confidenciales o código fuente. También se espera que aumente la sofisticación técnica de estos trabajadores, con nuevas destrezas en IA y blockchain. La adopción de infraestructuras corporativas virtualizadas y de entornos BYOD puede suponer un reto para las estrategias de seguridad tradicionales: a las empresas internacionales les puede resultar más difícil detectar a estos trabajadores. De hecho, se está formando rápidamente un ecosistema global —con la ayuda de facilitadores en el Reino Unido— que representa un riesgo creciente. Adaptarse al marco regulador En 2026, el marco regulador sobre IA y ciberseguridad dejará atrás sus fases preparatorias y entrará plenamente en vigor. Las organizaciones de la región EMEA deberán estar preparadas para ello. En agosto entrarán en vigor los requisitos más exigentes de la Ley de IA de la Unión Europea, en especial los relativos a los sistemas de IA de alto riesgo. Estas exigencias incluyen un desarrollo inmediato y exhaustivo de la gobernanza de la IA. Las empresas que operan en la UE están obligadas a poner en práctica sistemas robustos de gestión de riesgos, deberán garantizar la calidad de los datos —y que no contengan sesgos—, y tendrán que incorporar una supervisión humana de su tecnología. Esta regulación tiene un alcance extraterritorial y se acompaña de un régimen sancionador que contempla multas de hasta el 7% de la facturación mundial anual. Por tanto, las empresas se verán obligadas a demostrar rápidamente su cumplimiento y a reflejar la gobernanza de la IA de una forma adecuada en sus operaciones. Simultáneamente, la trasposición de la Directiva NIS2 (seguridad de las redes y sistemas de información) a la legislación nacional influirá poderosamente en el panorama de la ciberseguridad. Esta ampliación del alcance a los sectores “esenciales” e “importantes” convierte la ciberseguridad en una responsabilidad explícita de los consejos de administración. Las organizaciones tendrán nuevas obligaciones en lo tocante a la gestión de riesgos en sus cadenas de suministro y a las obligaciones de notificación de incidencias. En la UE, las sanciones podrán llegar al 2% de la facturación mundial. Además, se introduce la figura de la responsabilidad personal de los altos directivos. En el Reino Unido se está tramitando una ley de ciberseguridad y resiliencia de contenido similar. En definitiva, estos (y otros) desarrollos normativos impondrán cambios sistémicos en la gobernanza en 2026. Para navegar por este entorno complejo y en rápida evolución, las organizaciones deben dar prioridad a las estrategias de defensa proactivas y multicapa, invertir en la gobernanza de la IA y adaptar continuamente sus posturas de seguridad para protegerse contra las amenazas emergentes y garantizar la resiliencia operativa. La entrada Pronósticos de ciberseguridad para 2026 se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Un año más, Google Cloud ha presentado sus ‘Pronósticos de ciberseguridad para 2026’, un estudio elaborado con el objetivo de ayudar a las organizaciones de la región EMEA a prepararse para una serie de amenazas y desafíos específicos a los que se enfrentarán en 2026.\nLas conclusiones han sido recopiladas por expertos en seguridad de numerosos equipos de seguridad de Google Cloud y se centran en tres áreas fundamentales: el uso de la inteligencia artificial por parte de adversarios y defensores, la ciberdelincuencia como la amenaza global más disruptiva, y las operaciones continuadas de los actores estatales para alcanzar sus objetivos estratégicos.\nEl uso de la inteligencia artificial por parte de adversarios y defensores\nEl año 2026 marcará el comienzo de una nueva era en materia de IA y seguridad, tanto para los adversarios como para los defensores. Principalmente, se espera que su uso por parte de actores maliciosos pase de ser una excepción a convertirse en la norma, lo que transformará notablemente el panorama de las amenazas cibernéticas al acelerar operaciones como la ingeniería social, las operaciones de información y el desarrollo de malware.\nEn 2026, los adversarios dejarán atrás el simple phishing basado en texto para aprovechar al máximo la IA generativa multimodal (deepfakes de voz, texto y vídeo) con el fin de crear suplantaciones convincentes y sensibles al contexto de ejecutivos, empleados o socios de confianza. Esto acelerará el éxito del vishing (phishing de voz) y permitirá ataques hiperrealistas de compromiso del correo electrónico empresarial (BEC) a gran escala.\nMientras que los autores de amenazas aprovecharán la IA para aumentar la velocidad, el alcance y la eficacia de los ataques, los defensores también utilizarán agentes de IA para potenciar las operaciones de seguridad y mejorar las capacidades de los analistas. Sin embargo, esta transformación plantea nuevos retos, como los riesgos de los «agentes en la sombra» (Shadow Agents) y la necesidad de evolucionar la gestión de identidades y accesos.\nEn ese sentido, los empleados que implementen agentes de IA autónomos sin autorización crearán canales invisibles y no controlados para datos confidenciales, lo que dará lugar a fugas y riesgos de cumplimiento. El problema subsiguiente de las herramientas de IA no controladas se convertirá en un desafío crítico de «agentes en la sombra» (Shadow Agents).\nLa ciberdelincuencia sigue causando estragos a nivel mundial\nLas operaciones con motivaciones económicas, en particular el ransomware y el secuestro de datos, seguirán siendo una fuerza dominante y disruptiva. Constituirán, también, la categoría de ciberdelincuencia más perjudicial desde el punto de vista financiero a nivel mundial, impulsada por grandes grupos especializados que explotan a proveedores externos y vulnerabilidades de Día Cero en ataques en cascada de gran volumen.\nEn paralelo, a medida que las organizaciones protegen los sistemas internos, más adversarios adoptarán como estrategia predeterminada atacar de forma sistemática la infraestructura de virtualización subyacente (hipervisores). Se trata de un punto ciego crítico en el que un solo compromiso puede otorgar a los atacantes el control sobre todo el patrimonio digital para llevar a cabo un cifrado masivo y una interrupción sistémica.\nAmenazas ciberfísicas y de otras clases\nRecientemente, la presidenta de la Comisión Europea, Ursula von der Leyen, ha declarado que Europa debe ir más allá de la defensa tradicional para contrarrestar la escalada de la guerra híbrida. De cara al próximo año, Europa debe prepararse para afrontar ataques ciberfísicos dirigidos a infraestructuras críticas, como las redes de energía, el transporte y las infraestructuras digitales. Y, muy probablemente, esos ataques ciberfísicos potenciales se combinarán con operaciones de información que buscarán minar la confianza de la población.\nGoogle Cloud prevé un aumento de las campañas de ciberespionaje orquestadas por agentes alineados con gobiernos como el ruso y el chino, que tendrán como objetivos a los gobiernos europeos, la defensa y organismos de investigación activos en sectores tecnológicos críticos y emergentes. Por otro lado, se espera que los agentes de amenazas redoblen su presión sobre las cadenas de suministro europeas, en especial sobre los proveedores de servicios gestionados y las dependencias de software, para ganar acceso a un gran número de objetivos conectados.\nTendencias de los actores estatales\nDesde el punto de vista geopolítico, actores estatales como Rusia, China, Irán y Corea del Norte seguirán representando amenazas importantes y en constante evolución, impulsadas por intereses estratégicos distintos y empleando diversas tácticas cibernéticas:\n- Rusia: Se espera que las operaciones cibernéticas de Rusia experimenten un cambio estratégico, pasando del apoyo táctico a corto plazo al conflicto en Ucrania a dar prioridad a los objetivos estratégicos globales a largo plazo. Esto incluye el desarrollo de capacidades cibernéticas avanzadas, la recopilación de inteligencia para apoyar los intereses políticos y económicos globales y la obtención de puntos de apoyo estratégicos dentro de los entornos de infraestructura crítica internacional.\n- Corea del Norte: El aparato de amenazas cibernéticas de Corea del Norte intensificará sus operaciones, muy exitosas y lucrativas, contra las organizaciones y los usuarios de criptomonedas para generar ingresos. Aumentarán la innovación técnica, basándose en tácticas avanzadas de ingeniería social, como atraer a sus objetivos con falsas evaluaciones de contratación y utilizar vídeos deepfake para engañar a personal de alto valor.\n- China: Se prevé que el volumen de operaciones cibernéticas relacionadas con China siga superando al de otras naciones en 2026, dando prioridad a las operaciones sigilosas y maximizando la escala operativa. Estos actores atacarán agresivamente los dispositivos periféricos, explotarán las vulnerabilidades de Día Cero y se centrarán en los proveedores externos.\n- Irán: La actividad cibernética iraní en 2026 estará impulsada por los objetivos de estabilidad del régimen y el mantenimiento de la influencia regional en medio de los conflictos geopolíticos en curso. La escalada de tensiones regionales entre Irán, Israel y Estados Unidos seguirá alimentando el aumento del ciberespionaje, los ataques disruptivos y las operaciones de información, lo que significa que el riesgo de despliegue de programas de borrado sigue siendo elevado, como se observa en la acumulación de tácticas agresivas desde octubre de 2023.\nLos trabajadores informáticos de Corea del Norte amplían sus actividades\nEs probable que, para 2026, los trabajadores informáticos de Corea del Norte consoliden su presencia y expansión en Europa, con los consiguientes riesgos financieros y de espionaje para las organizaciones europeas En Estados Unidos, la presión de las fuerzas de seguridad, junto con una mayor concienciación, han conseguido reprimir sus operaciones. Como resultado, estos agentes se han reorientado hacia Europa, en donde tratan de conseguir empleo y mantener una fuente de ingresos para el régimen norcoreano.\nLas organizaciones deben prepararse para un aumento de las campañas de extorsión agresivas ya que, como se ha observado, estos trabajadores amenazan con divulgar datos confidenciales o código fuente. También se espera que aumente la sofisticación técnica de estos trabajadores, con nuevas destrezas en IA y blockchain.\nLa adopción de infraestructuras corporativas virtualizadas y de entornos BYOD puede suponer un reto para las estrategias de seguridad tradicionales: a las empresas internacionales les puede resultar más difícil detectar a estos trabajadores. De hecho, se está formando rápidamente un ecosistema global —con la ayuda de facilitadores en el Reino Unido— que representa un riesgo creciente.\nAdaptarse al marco regulador\nEn 2026, el marco regulador sobre IA y ciberseguridad dejará atrás sus fases preparatorias y entrará plenamente en vigor. Las organizaciones de la región EMEA deberán estar preparadas para ello.\nEn agosto entrarán en vigor los requisitos más exigentes de la Ley de IA de la Unión Europea, en especial los relativos a los sistemas de IA de alto riesgo. Estas exigencias incluyen un desarrollo inmediato y exhaustivo de la gobernanza de la IA. Las empresas que operan en la UE están obligadas a poner en práctica sistemas robustos de gestión de riesgos, deberán garantizar la calidad de los datos —y que no contengan sesgos—, y tendrán que incorporar una supervisión humana de su tecnología. Esta regulación tiene un alcance extraterritorial y se acompaña de un régimen sancionador que contempla multas de hasta el 7% de la facturación mundial anual. Por tanto, las empresas se verán obligadas a demostrar rápidamente su cumplimiento y a reflejar la gobernanza de la IA de una forma adecuada en sus operaciones.\nSimultáneamente, la trasposición de la Directiva NIS2 (seguridad de las redes y sistemas de información) a la legislación nacional influirá poderosamente en el panorama de la ciberseguridad. Esta ampliación del alcance a los sectores “esenciales” e “importantes” convierte la ciberseguridad en una responsabilidad explícita de los consejos de administración. Las organizaciones tendrán nuevas obligaciones en lo tocante a la gestión de riesgos en sus cadenas de suministro y a las obligaciones de notificación de incidencias. En la UE, las sanciones podrán llegar al 2% de la facturación mundial. Además, se introduce la figura de la responsabilidad personal de los altos directivos. En el Reino Unido se está tramitando una ley de ciberseguridad y resiliencia de contenido similar. En definitiva, estos (y otros) desarrollos normativos impondrán cambios sistémicos en la gobernanza en 2026.\nPara navegar por este entorno complejo y en rápida evolución, las organizaciones deben dar prioridad a las estrategias de defensa proactivas y multicapa, invertir en la gobernanza de la IA y adaptar continuamente sus posturas de seguridad para protegerse contra las amenazas emergentes y garantizar la resiliencia operativa.",
      "enhanced_at": 1762341416.5063176,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:16:56.506670+00:00Z"
}