{
  "id": "huntress-blog-huntress-com-2025-11-04-a10b281c",
  "source_id": "huntress-blog-huntress-com",
  "guid": "https://www.huntress.com/blog/live-hacking-microsoft-365-kyle-hanslovan",
  "title": "Live Hacking Into Microsoft 365 with Kyle Hanslovan",
  "url": "https://www.huntress.com/blog/live-hacking-microsoft-365-kyle-hanslovan",
  "published_at": "2025-11-04T16:00:00+00:00",
  "fetched_at": "2025-11-05T11:15:01.168434+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Learn how cybercriminals bypass Microsoft 365 MFA and steal credentials in a live hacking demo. Discover defense strategies to protect your systems.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "If you think your Microsoft 365 setup is secure, you’re probably betting on cybercriminals breaking in through locked doors. But what if they're strolling through the front entrance like legitimate users (and trust us, they are) with stolen credentials and bypassing your MFA? No warning signs. No red flags.\nIs your defense strategy ready?\nLearn to spot these attacks before they go HAM, in a Microsoft 365 live hacking demo on November 13.\nHere’s your sneak peek\nHuntress CEO, Kyle Hanslovan—a former NSA operator and legendary ethical hacker—will host a live hacking demo that takes you behind the scenes of today’s modern cyberattack techniques. This isn't another fluffy PowerPoint presentation filled with what-ifs. Kyle will simulate real attacks in real time, showing you exactly how hackers do things like:\n-\nTarget employees with sophisticated social engineering tactics\n-\nQuickly steal credentials directly from Chrome and Edge browsers\n-\nBypass Microsoft 365 MFA functionality\n-\nRapidly compromise interconnected systems\nYou'll watch these attacks unfold, understand why they work, and learn strategies to shut them down in your environment.\nJoin us live: No FOMO, just awesome freebies\nCome hang out with us live. You’ll get free access to:\n-\nIdentity Security Assessment for Microsoft 365: Uncover hidden vulnerabilities in your systems with a comprehensive assessment designed to reveal weak spots before hackers find them.\n-\nSetup instructions for your own live demo: You'll get instructions to recreate Kyle's demo and deliver your own live hacking session. Nothing drives home the importance of cybersecurity like seeing an attack happen in real time.\nPlus, you'll learn the specific defense strategies that power down each attack tactic Kyle walks you through. No BS advice or generic tips allowed—just actionable steps you can run with right away.\nNow’s the time to defend smarter\nRemember when your biggest security woes were malicious macros in Word documents that logged your keystrokes and lurked through your webcam? Well, that was way back in 2020, and those days are long gone. Cybercriminals have upgraded their toolkit, and they're using techniques and resources, like AI and credential marketplaces, to exploit the go-to software for businesses everywhere: Microsoft 365.\nYour team depends on Microsoft 365 running smoothly for email, file sharing, collaboration—basically all your daily operations. That makes it a massive target for cybercriminals. And when they get in, they don't just steal data. They create new accounts to persist under the radar, make email forwarding rules, impersonate your C-suite execs, redirect payments to their own accounts, drop ransomware, and bring operations to a grinding halt.\nThe truth is, most businesses don't know where their vulnerabilities are until it's too late. This webinar gives you a front-row seat to see how attackers think and operate, so you can shore up your defenses way before any damage is done.\nMark your calendar, save your spot\nCybersecurity shouldn’t be scary or out of reach. When you understand how attacks work, you can build smarter defenses and protect what matters most.\nCome get shady with us, bring all your tough questions, and walk away with a solid plan to challenge modern cybercriminal tradecraft. Register now.",
      "enhanced_at": 1762341472.7703915,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:52.770654+00:00Z"
}