{
  "id": "infosecurity-magazine-2025-11-04-68394545",
  "source_id": "infosecurity-magazine",
  "guid": "https://www.infosecurity-magazine.com/news/french-police-seize-16m-euros/",
  "title": "French Police Seize €1.6m Amid Crypto Scam Network Crackdown",
  "url": "https://www.infosecurity-magazine.com/news/french-police-seize-16m-euros/",
  "published_at": "2025-11-04T15:50:00+00:00",
  "fetched_at": "2025-11-05T11:13:52.620878+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Nine alleged crypto scammers arrested in Cyprus, Germany and Spain",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "An international network of crypto scammers has been taken down in Europe following operations led by the Belgian, French and Cypriot police forces.\nIn an official statement on November 4, Laure Beccuau, a French state prosecutor, revealed that nine individuals were arrested in their home in Cyprus, Germany and Spain.\nThe suspects are accused of being involved with an international cryptocurrency investment scam and money laundering network.\nSix were subject to European arrest warrants issued by French investigating judges.\nThese arrests followed a law enforcement operation conducted between October 27 and 30 by authorities in France, Belgium and Cyprus, with the collaboration of Eurojust.\nAuthorities also seized €800,000 in bank accounts, €415,000 in cryptocurrency wallets, €300,000 in cash and a set of luxury watches worth €100,000 – a total of €1.6m ($1.84m) in seized assets.\n\"Several real estate properties are currently being appraised,” state prosecutor Beccuau added.\n$700m in Profit Money Laundered Via Cryptocurrencies\nThe investigation started in 2023, when prosecutors from the Paris-based National Jurisdiction for Combating Organized Crime (JUNALCO) sent a wave of complaints from victims of crypto investment scams to a unit of the National Cybercrime Fighting Center (C3N) and the National Gendarmerie’s Crypto-Assets team.\nUpon analysing the attack chain, the French investigators found that the criminals contacted their victims through several channels, including social media advertising, phone calls and fake news articles sponsored across different communications platforms.\nThe end goal was to make the victims spend money on one of the dozens of fake crypto-investment platforms the malicious actors controlled. These platforms appeared legitimate and promised attractive gains.\nBeccuau mentioned that there were “several hundreds of victims” in France and across Europe, who have never been able to get their money back.\nThe investigators also found that the malicious actors made at least $700m (€610m) in laundered crypto assets with this scheme.\nFrench prosecutors opened a judicial investigation on June 4, 2025, allowing law enforcement to deploy the operation.\nThe suspects face six charges, each with between five and 10 years in prison and between €1875 and €1m ($2153-$1.15m) in fines.\nIn a LinkedIn post, Johanna Brousse, deputy state prosecutor and head of JUNALCO, said, “Another victory in the fight against cybercrime! Thanks to exemplary European judicial cooperation, criminal networks are relentlessly tracked down, well beyond our borders.”",
      "enhanced_at": 1762341477.5562215,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:57.556534+00:00Z"
}