{
  "id": "infosecurity-magazine-2025-11-04-510cb382",
  "source_id": "infosecurity-magazine",
  "guid": "https://www.infosecurity-magazine.com/news/openai-assistants-api-sesameop/",
  "title": "OpenAI Assistants API Exploited in 'SesameOp' Backdoor",
  "url": "https://www.infosecurity-magazine.com/news/openai-assistants-api-sesameop/",
  "published_at": "2025-11-04T15:00:00+00:00",
  "fetched_at": "2025-11-05T11:13:52.621166+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Instead of relying on more traditional methods, the backdoor exploits OpenAI’s Assistants API for command-and-control communications",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Threat actors are weaponizing the OpenAI Assistants Application Programming Interface (API) to deploy a backdoor and manage compromised devices remotely.\nThe backdoor was discovered by Microsoft Incident Response’s Detection and Response Team (DART) researchers in July 2025 while responding to a sophisticated security incident, where the threat actors had maintained a presence within the environment for several months.\nThe investigation uncovered a complex arrangement of internal web shells leveraging multiple Microsoft Visual Studio utilities that had been compromised with malicious libraries.\nThese sophisticated mechanisms were responsible for running commands relayed from persistent, strategically placed malicious processes, as well as a backdoor that DART researchers named ‘SesameOp.’\nInstead of relying on more traditional methods, the backdoor exploits legitimate OpenAI’s Assistants API for command-and-control (C2) communications between the threat actors and the compromised devices.\nThe Assistants API is expected to be deprecated by OpenAI in August 2026 and replaced by the Responses API.\nMicrosoft DART researchers shared their findings about SesameOp in a report published on November 3.\nSesameOp Uses OpenAI Assistants API to Fetch Commands\nSesameOp is a covert backdoor purpose-built to maintain persistence and allow a threat actor to stealthily manage compromised devices.\nThe backdoor mechanism is made of a loader in the form of the dynamic link library (DLL), Netapi64.dll, and a NET-based backdoor, OpenAIAgent.Netapi64, that leverages OpenAI as a C2 channel.\nThe DLL file is heavily obfuscated using Eazfuscator.NET and is designed for stealth, persistence and secure communication using the OpenAI Assistants API.\nNetapi64.dll is loaded at runtime into the host executable via a defense evasion method called .NET AppDomainManager injection, as instructed by a crafted .config file accompanying the host executable.\nMeanwhile, OpenAIAgent.Netapi64, the main functionality that enables the backdoor to operate, does not utilize OpenAI agent software development kits (SDKs) or model execution features, despite what its filename could suggest.\n“Instead, it uses OpenAI Assistants API to fetch commands, which the malware then decrypts and executes locally. Once the tasks are completed, it sends the results back to OpenAI as a message. To stay under the radar, it uses compression and encryption, ensuring both the incoming payload and the outgoing results remain hidden,” the DART researchers wrote in the report.\nThe July investigation also revealed sophisticated techniques employed to secure and obfuscate communications, including payload compression to minimize size and layered encryption mechanisms both symmetric and asymmetric to protect command data and exfiltrated results.\nMicrosoft’s Mitigation Recommendations Against SesameOp\nIn its report, Microsoft recommended the following mitigations to reduce the impact of the SesameOp threat:\n- Audit and review firewalls and web server logs frequently\n- Use Windows Defender Firewall, intrusion prevention systems, and network firewall to block C2 server communications across endpoints whenever feasible\n- Review and configure your perimeter firewall and proxy settings to limit unauthorized access to services, including connections through non-standard ports\n- Ensure that tamper protection is enabled in Microsoft Dender for Endpoint\n- Run endpoint detection and response in block mode so that Microsoft Defender for Endpoint can block malicious artifacts, even when your non-Microsoft antivirus does not detect the threat or when Microsoft Defender Antivirus is running in passive mode\n- Configure investigation and remediation in full automated mode to let Microsoft Defender for Endpoint take immediate action on alerts to resolve breaches, significantly reducing alert volume\n- Turn on potentially unwanted applications (PUA) protection in block mode in Microsoft Defender Antivirus\n- Turn on cloud-delivered protection in Microsoft Defender Antivirus or the equivalent for your antivirus product to cover rapidly evolving attacker tools and techniques\n- Turn on Microsoft Defender Antivirus real-time protection",
      "enhanced_at": 1762341485.7001667,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:18:05.700480+00:00Z"
}