{
  "id": "latest-news-zdnet-com-2025-11-04-0fa3aea6",
  "source_id": "latest-news-zdnet-com",
  "guid": "93b3c6b3-d860-46c3-99a4-a1a8a3d960bc",
  "title": "Amazon is selling the Google Pixel 9 for $300 off right now - and I highly recommend it",
  "url": "https://www.zdnet.com/article/amazon-is-selling-the-google-pixel-9-for-300-off-right-now-and-i-highly-recommend-it/",
  "published_at": "2025-11-04T21:32:00+00:00",
  "fetched_at": "2025-11-05T11:16:43.274171+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Google's Pixel 9 remains a solid phone in 2025, offering strong performance and an AI-powered camera system. Right now, it's on sale at Amazon.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nAmazon is selling the Google Pixel 9 for $300 off right now - and I highly recommend it\nFollow ZDNET to learn more about smartphones: Add us as a preferred source on Google.\nTo a lot of people, November is the time of the year when things start to slow down, families gather for Thanksgiving, and, most notably, steep price drops on smartphones start rolling out ahead of Black Friday. As it so happens, I have a killer deal for you.\nOver at Amazon, the 128GB Pixel 9 is on sale for $499, a nice 38% discount. This deal applies to every color option: Wintergreen, Obsidian (black), and Porcelain (white). If you want extra space, the 256GB Pixel 9 is also on sale for $599; however, it's only available in Porcelain.\nAlso: The 10+ best early Black Friday phone deals to grab now\nIt is possible to get either Pixel 9 model for free through Amazon's trade-in system, but the amount of money being shaved off depends on what you're trading in. For example, trading in an OnePlus 13 will only net you a $100 discount.\nAlthough the Pixel 10 series has been around for a few months now, the Pixel 9 remains one of the most compelling Android smartphones in 2025. Its main accomplishment is being a premium device without the cost, thanks to several factors.\nFirst off, the Pixel 9 has a solid design. The combination of the flat-sided aluminum frame, signature camera bar, and 6.3-inch Actua OLED touchscreen gives the smartphone a sleek, modern look. And it is compact enough to hold comfortably in one hand. Add in IP68 durability, and you get a mobile device that feels every bit as durable and polished as newer flagships.\nReview: Google Pixel 9\nPerformance is equally impressive. Powered by Google's Tensor G4 chip and 12GB of RAM, the Pixel 9 feels fast and responsive, whether you're multitasking, gaming, or utilizing the many AI tools, such as the Gemini assistant. Artificial intelligence isn't limited to chat bot, as it is also integrated into the camera system.\nAdd Me, for example, lets you add yourself to a group photo if you find yourself the photographer in a shot. It combines two images together so that everyone is together in a picture. Then there's Magic Editor. This feature makes complex edits easy to do. You could remove distracting objects in a shot or resize something with a few taps of the screen.\nI can't forget the camera system. Google's device has two cameras: a 50MP lens and a 48MP ultrawide option, allowing for crisp, highly detailed photographs. While the cameras on the Pro models are superior, the Pixel 9 still delivers results that rival those of flagship phones.\nHow I rated this deal\nAs per ZDNET's rating system, I give the deal a score of 4/5. 38% off is an awesome discount, especially for a smartphone that delivers a solid performance, houses smart AI tech, and has great cameras. I recommend the Pixel 9 to anyone looking for a new mobile device for themselves or for a loved one.\nThere is a chance that it could drop even lower during Black Friday. But considering that it's almost half off, I think this is as good as it's going to get. I would love to be wrong, though.\nWhen will this deal expire?\nDeals are subject to sell out or expire at any time, though ZDNET remains committed to finding, sharing, and updating the best product deals for you to score the best savings. Our team of experts regularly checks in on the deals we share to ensure they are still live and obtainable. We're sorry if you've missed out on this deal, but don't fret -- we're constantly finding new chances to score savings and sharing them with you at ZDNET.com.\nHow do we rate deals at ZDNET?\nWe aim to deliver the most accurate advice to help you shop smarter. ZDNET offers 33 years of experience, 30 hands-on product reviewers, and 10,000 square feet of lab space to ensure we bring you the best of tech.\nIn 2025, we refined our approach to deals, developing a measurable system for sharing savings with readers like you. Our editor's deal rating badges are affixed to most of our deal content, making it easy to interpret our expertise to help you make the best purchase decision.\nAt the core of this approach is a percentage-off-based system to classify savings offered on top-tech products, combined with a sliding-scale system based on our team members' expertise and several factors like frequency, brand or product recognition, and more. The result? Hand-crafted deals are chosen specifically for ZDNET readers like you, fully backed by our experts.",
      "enhanced_at": 1762341427.3618617,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:07.362178+00:00Z"
}