{
  "id": "latest-news-zdnet-com-2025-11-04-e5522f6b",
  "source_id": "latest-news-zdnet-com",
  "guid": "5313c688-c2a1-41ea-9d68-f1a93d8b9f46",
  "title": "WhatsApp arrives on Apple Watch - here's which models get it",
  "url": "https://www.zdnet.com/article/whatsapp-arrives-on-apple-watch-heres-which-models-get-it/",
  "published_at": "2025-11-04T21:40:15+00:00",
  "fetched_at": "2025-11-05T11:16:43.273926+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "One of the most popular messaging apps finally arrives on the Apple Watch.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "WhatsApp arrives on Apple Watch - here's which models get it\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- WhatsApp arrives on Apple Watch.\n- WhatsApp is only available on select models.\n- Audio messages are limited.\nOne of the most popular messaging apps is making its way onto the Apple Watch. WhatsApp is now around your wrist thanks to an app integration on the Apple Watch, the two companies announced on Tuesday.\nApple Watch users can now read and respond to messages using WhatsApp on their watch, much as they can with Messages.\nAlso: I've tested every Apple Watch model in 2025 - here's why now is the best time to buy the Ultra\nWhatsApp, an end-to-end encrypted messaging app, is one of the most used messaging apps in the world, with over 3 billion active monthly users, according to recent data.\nWhatsApp on Apple Watch now supports call notifications, the ability to read full messages on your watch, recording and sending voice messages, sending emoji reactions, a clearer view, and viewing chat history.\nI tried out WhatsApp on my Apple Watch Series 11 for myself. Some functionalities, like texting, were seamless. Adding emojis to replies was easy, too. There are also smart replies included in chats, if users want to easily select a response without typing it out for themselves.\nIt was also easy to navigate chats through the smartwatch app. Unlike WhatsApp on a mobile phone, WhatsApp on the Apple Watch only lets you record 10 seconds of an audio message. I was surprised to learn this as I tested out recording and found that the icon had a countdown from 10 seconds. Perhaps these quick 10-second audio messages are supposed to replace typing out a quick message on the smartwatch.\nWhich Apple Watches are compatible?\nAnyone with an Apple Watch Series 4, updated to WatchOS 10 software or later, can download WhatsApp. This seems like just the beginning for WhatsApp on the Apple Watch. WhatsApp said it plans on delivering \"even more useful functionality\" for its new users in the future.",
      "enhanced_at": 1762341425.5994263,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:05.599738+00:00Z"
}