{
  "id": "latest-news-zdnet-com-2025-11-04-630f0503",
  "source_id": "latest-news-zdnet-com",
  "guid": "02c5e03a-f458-4ef9-beaa-8a5806f6e911",
  "title": "Best early Black Friday PlayStation deals 2025: 20+ sales out now",
  "url": "https://www.zdnet.com/article/best-early-black-friday-playstation-deals-2025/",
  "published_at": "2025-11-04T23:59:56+00:00",
  "fetched_at": "2025-11-05T11:16:43.272452+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Although Black Friday is still a few weeks away, you can find great PlayStation deals now. I've collected some of the best.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest early Black Friday PlayStation deals 2025: I'm tracking my favorite discounts live now\nBlack Friday is coming up fast, and that means it's the best time of the year to score massive discounts on tech and entertainment, from TVs and laptops to video games. In the lead-up to Cyber Week, retailers such as Walmart, Target, and Best Buy have already begun rolling out early deals, with the PlayStation 5 and its extensive library of games at the forefront.\nAlso: Best early Black Friday Nintendo Switch deals\nWhether you've been waiting to grab Sony's flagship consoles or want to expand your setup with new accessories, now is a great time to start shopping. Expect to see steep markdowns on PS5 bundles, too. It took me a little while, but after digging through current promotions from Best Buy, Amazon, Walmart, and more, I've rounded up the best early Black Friday deals for the PlayStation 5. Take the opportunity now to get a head start on your holiday shopping before the craziness starts.\nBest early Black Friday PlayStation 5 deals\n- Current price: $650 (7% off)\n- Original price: $700\nTrue to its name, the PS5 Slim is a sleeker version of Sony's flagship console. Its more lightweight design is accompanied by two USB-C ports on the front and a 1TB SSD instead of the original's 825GB storage drive. The Slim and the standard console house the same hardware, so expect the same top-notch gaming experience. This particular bundle from Walmart includes a second DualSense wireless controller.\n- Current price: $600 (19% off)\n- Original price: $749\nThanks to its custom-made CPU, GPU, and high-speed SSD, the PlayStation 5 delivers a truly immersive gaming experience. Enjoy fast load times, stunning 4K graphics, and 3D audio tech that brings sound output to life. This particular bundle comes with a copy of Horizon Forbidden West, a game set in a post-apocalyptic world beset by robotic monsters.\n- Current price: $300 (15% off)\n- Original price: $350\nThe PlayStation Portal is a handheld device that lets players remotely stream PS4 and PS5 titles. Its vibrant 8-inch LCD screen can run games in 1080p at 60FPS. On either side of the display are the two halves of the DualSense controller, providing all the same features, like adaptive triggers and haptic feedback. Best Buy has a PlayStation Portal deal that includes a protective case, a pair of earbuds, and a $25 gift card for the PlayStation Store.\n- Current price: $200 (40% off)\n- Original price: $330\nSony's InZone H9 headphones are one of the best accessories for gaming. They provide rich, multidimensional sound with a well-balanced sound profile. There isn't too much bass or treble, although you can tweak the output via the InZone Hub app. The headphones have robust digital noise canceling to block out the world around you. Also, when connected to a PS5, they unlock extra features like on-screen volume and battery indicators.\nReview: INZONE H9\n- Current price: $65 (13% off)\n- Original price: $74\nI've loved the DualSense controller since the console launched in 2020. It's just the right size for my hands and performs perfectly. Multiple color options are on sale at Walmart. The best deal belongs to the Starlight Blue controller, which is on sale for $65. Other notable color options include Cosmic Red, Midnight Black, and Galantic Purple.\n- Current price: $35 (30% off)\n- Original price: $50\nRelive the horror. This is a remake of the classic Resident Evil 4 from 2005. Set six years after the events of Resident Evil 2, the game sees federal agent Leon Kennedy embark on a secret mission to rescue the daughter of the President of the United States from a dangerous cult. The remake offers superior graphics, new puzzles, and more challenging enemies.\n- Current price: $30 (40% off)\n- Original price: $50\nThis collection combines the final game in the Uncharted series, A Thief's End, with its optional sidestory, The Lost Legacy. The former sees series hero, Nathan Drake, embark on one final globe-trotting quest with his brother, Sam, to find lost pirate treasure. Lost Legacy puts the player in the role of another treasure hunter, Chloe Frazer, looking to uncover an ancient relic, the Tusk of Ganesh.\n- Current price: $42 (40% off)\n- Original price: $70\nGhost of Tsushima is a unique game as it takes inspiration from Japanese history. You take the role of Jin Sakai, a samurai tasked with protecting Tsushima Island from invading Mongols in 1274. The Director's Cut adds the Iki Island Story Expansion and multiplayer mode.\n- Current price: $43 (39% off)\n- Original price: $70\nMarvel's Spider-Man 2 for the PlayStation 5 sees the player control both Peter Parker and Miles Morales as they swing, jump, and crawl across New York City, as the two must work together to defeat Venom. What makes matters worse is that Peter is being controlled by the black symbiote, an alien parasite that gives him tremendous strength, but at the risk of ruining his life.\n- Current price: $42 (40% off)\n- Original price: $70\nRatchet & Clank: Rift Apart launched early in the PS5's lifecycle and remains a player-favorite title years later. It sees the titular heroes jump between dimensions -- \"complete with dazzling visuals and an insane arsenal\" -- as they strive to protect their galaxy from total domination. Like Sonic X Shadow Generations, this is a family-friendly title that everyone can enjoy.\nMore early Black Friday PlayStation deals\n- PS5 Digital Astrobot Console with Accessories Kit: $600 (save $50): This PS5 bundle is jam-packed with goodies. It comes with a download voucher for Astro Bot, headphones, a second DualSense controller, and more.\n- PlayStation 5 Trade-in: Save up to $150: Thanks to a partnership with Sony, Back Market has a trade-in program where shoppers can save up to $150 off their PS5 if they exchange a good-condition PlayStation 4.\n- PlayStation 5 Pro: $749 (save $38): The PS5 Pro is a direct upgrade to the base model, boasting more powerful hardware, 2TB of storage -- and PlayStation Spectral Super Resolution to deliver an even better image fidelity.\n- PlayStation 5 with Spider-Man 2: $630 (save $50): This is another great Best Buy bundle. It combines the console with a copy of Spider-Man 2 with a charging standard and face cover for the DualSense controller.\n- PlayStation Slim Refurbished: $450 (save $50): If you're on a budget, Best Buy has refurbished consoles on sale.\n- PlayStation 5 Slim 30th Anniversary Limited Edition Bundle: $775 (save $75): It's a blast from the past. This PS5 Slim celebrates the 30th Anniversary of the PlayStation series of consoles by sporting a color scheme similar to the first model.\n- Stellar Blade: $49 (save $21): Stellar Blade was a breakout hit in 2024. Set in a post-apocalyptic Earth, you play as the cybernetically enhanced Eve who embarks on a mission to reclaim the planet back for humanity.\n- Gran Turismo 7: $43 (save $27): Gran Turismo 7 offers an immersive racing experience, combining photorealistic graphics and physics with a wide range of gameplay modes for hours of fun.\n- Personal 5 Royal: $30 (save $30): This bombastic RPG from Atlus blends stylish visuals, tactical role-playing, and an in-depth story.\n- Metal Gear Solid Delta: Snake Eater Digital Deluxe Edition: $64 (save $16): The beloved PS2 classic is back, now remade for the PS5. This version includes the Sneaking DLC Pack, which consists of several in-game costumes.\n- NBA 2K26: $40 (save $15): NBA 2K26 has multiple game modes where you can climb the ranks as an NBA player, lead your team to victory as a coach, or led a franchise as a General Manager.\nFAQs\nWhen is Black Friday?\nIn 2025, Black Friday is set for Friday, November 28. It's one of the best times of the year to score deep discounts on Nintendo Switch consoles, games, and accessories from major retailers like Best Buy, Walmart, and Amazon. We expect many of these sales to carry over until Cyber Monday, December 1.\nIs the PlayStation 5 really cheaper during Black Friday?\nAbsolutely! Sony's PlayStation 5 always sees significant discounts during Cyber Week. Retailers often cut prices on console bundles, controllers, and popular games, with price drops usually exceeding $100. This shopping event is one of the best times to pick up a PS5 or expand your game library. At the time of this writing, the price drops are rather humble. We are still in the lead-up to Black Friday, so expect things to improve later.\nHow did we choose these early Black Friday deals?\nAt ZDNET, we only highlight PlayStation deals worth your consideration; the same kind we'd consider ourselves. For this roundup, I specifically sought out PS5 consoles, bundles, accessories, and games about 15% off or more. Black Friday is still several weeks away, so the significant discounts aren't available yet. Knowing this, I expanded my search to include lesser discounts to fill out the list. Although some price drops aren't as deep as others, they're still worth consideration because they offer unique value in other areas.\nI considered hands-on experience, real-world performance, and customer feedback. Every recommendation on this list is backed by careful research and expert insight so that you can confidently shop these early Black Friday sales.",
      "enhanced_at": 1762341405.545944,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:16:45.546244+00:00Z"
}