{
  "id": "latest-news-zdnet-com-2025-11-04-82c2def6",
  "source_id": "latest-news-zdnet-com",
  "guid": "e1961fcc-56a9-4ac2-9c74-90ceea2c35a1",
  "title": "Best early Black Friday deals 2025: 35+ sales out early",
  "url": "https://www.zdnet.com/article/best-early-black-friday-deals-2025/",
  "published_at": "2025-11-04T22:10:51+00:00",
  "fetched_at": "2025-11-05T11:16:43.273425+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Black Friday is a few weeks away, but retailers like Amazon, Best Buy, and Walmart are already slashing prices on top tech and more.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest early Black Friday deals 2025: I'm tracking over 30 of my favorite discounts live now\nBlack Friday and Cyber Monday are a few weeks away, and you can expect hundreds of discounts across nearly every category, including popular tech items like laptops, TVs, gaming consoles, tablets, and more. ZDNET tests top tech all year, so if you're looking to get your holiday shopping done early, we've got the scoop on all the best early offers from Amazon, Walmart, Best Buy, and more.\nAlso: Black Friday 2025: Everything to know to save (including when sales actually start)\nAnd as ZDNET's deals and shopping editor, I have a keen eye for the best offers on vetted tech, and our team of experts will be keeping track of the best offers that continue to arise before and through Cyber Week 2025. In the meantime, here are the best early Black Friday deals we've found so far.\nBest early Black Friday deals\n- Current price: $200\n- Original price: $249\nThe new Watch SE 3 was released in September, and it's seeing it's first major discount since. Grabbing it at this price makes it one of the best smartwatch buys on the market.\nAlso: I compared every Apple Watch in 2025 - here's why I recommend this model the most\n- Current price: $120\n- Original price: $200\nRight now, the Fitbit Versa 4 is $80 off (the best savings since Prime Day), and it comes with a free $20 Amazon credit.\n- Current price: $499\n- Original price: $799\nGoogle's Pixel 9 remains a solid phone in 2025, offering strong performance and an AI-powered camera system. Right now, it's on sale.\nAlso: I highly recommend the Pixel 9 phone, and it's nearly 40% off with this early Black Friday deal\n- Current price: $169\n- Original price: $229\nAudio expert Jada Jones highly recommends these Google earbuds, and they've hit a great price.\n- Current price: $295\n- Original price: $360\nThe Switch 2 is the newest console available, but the older Switch is equally as fun and also slightly discounted for a limited time.\n- Current price: $30\n- Original price: $20\nStreamline your viewing experience with Amazon's Fire TV Stick 4K.\n- Current price: $269\n- Original price: $299\nThis Ninja machine can make slushies, margaritas, frappes, and more, and it's totally the frozen frenzy you need this holiday season.\n- iPad Pro M5 11-inch, 256GB: $949 (save $50): The new iPad Pro M5 is already seeing its first discount since its release a few weeks ago.\n- Beats Pill Speaker: $99 (save $30): The popular Beats Pill speaker is back, and it's on sale in select colors.\nTV deals\n- Current price: $230\n- Original price: $400\nThe Insignia QF Series is a great entry-level smart TV that uses the Fire TV platform to give you access to thousands of movies, shows, and songs. It supports both Dolby Vision HDR and Dolby Atmos virtual surround sound for enhanced picture and audio quality, as well as integrated Alexa features for hands-free voice controls.\n- Current price: $2,000\n- Original price: $3,500\nThe Hisense U8QG is an excellent Mini-LED smart TV with a 165Hz refresh rate, making it perfect for everything from live sports to console gaming.\n- Current price: $1,400\n- Original price: $2,700\nThe LG C5 OLED is a high-end TV with excellent picture and audio quality, backed up by support for Dolby Vision HDR, Dolby Atmos virtual surround sound, and a 120Hz refresh rate.\nReview: Why I recommend the LG C5 OLED over more premium models\n- Current price: $2,300\n- Original price: $4,500\nSamsung's flagship QLED TV offers impressive picture and audio quality that rivals even OLED models, with support for HDR10+ and Dolby Atmos virtual surround sound as well as Samsung's own object tracking sound technology.\nReview: This Samsung QLED TV model is the one most people should buy\n- Current price: $1,600\n- Original price: $1,800\nThe 65-inch of Samsung's latest Frame TV model is on sale, and a wall mount is included.\nTablet deals\n- Current price: $299\n- Original price: $349\nThe iPad 11 is still the latest base model, and our reviewer recommends it as the best iPad for most people.\nReview: I've tested every iPad sold by Apple right now - here's the model I recommend most\n- Current price: $279\n- Original price: $400\nIf you're a smart home person -- especially someone who uses Google Assistant -- this is the tablet for you, since it comes with a Charging Speaker Dock that doubles as a smart display.\nReview: Google Pixel Tablet\nIt's also a great tablet for those looking for a long-lasting battery life. When it's not in use and is on the dock, it's constantly charged and ready for use.\n- Current price: $800\n- Original price: $1,000\nThis Surface Pro is for professionals who want a high-performance machine with a brilliant display. The additional accessories, like the keyboard and pen, make it even more enticing as a tablet that can double as a computer.\nReview: Microsoft Surface Pro\n- Current price: $435\n- Original price: $500\nZDNET reviewer Maria Diaz said that this tablet's performance is well worth its price tag, and that its display experience is impressive.\nReview: Samsung Galaxy Tab S10 FE+\nIt handles light work like video calls, messaging, and everyday tasks very well. And, just like the Galaxy Tab S10 Ultra, it is IP68-rated for water and dust resistance to better protect your investment against accidental spills.\n- Amazon Fire HD 10 Tablet: $70 (save $70): This is a great deal if you've been shopping for a budget-friendly tablet, whether it's for casual consumption or for a child.\n- Amazon Kindle Paperwhite 10th Gen, Refurbished: $97 (save $32): Get a popular Kindle Paperwhite for less with this refurbished model.\nLaptop deals\n- Current price: $999\n- Original price: $1,199\nThe MacBook Air M4 is perfect for home, work, school, and more, and it's $200 off now.\n- Current price: $300\n- Original price: $600\nIf you want a Windows laptop with a 14-inch screen and enough power to see you through the workday or for study purposes, check out the Vivobook 14.\n- Current price: $181\n- Original price: $249\nThe Lenovo IdeaPad 3i Chromebook provides everything you need for basic tasks. Its large 15.6-inch Full HD display also keeps you entertained.\n- Current price: $751\n- Original price: $1,350\nSamsung's Galaxy Book 4 is a stylish 2-in-1 laptop backed up by decent specs. It has a 16-inch AMOLED display, 16GB of RAM, 1TB of storage, and an Intel Core Ultra 7 processor.\n- Current price: $350\n- Original price: $600\nThe Acer Aspire Go 15 is a solid budget laptop, housing an Intel Core i5-1334U processor, 8GB of DDR4 RAM, and a 256GB SSD. It's perfect as a lightweight work laptop.\n- HP OmniBook X Flip 2-in-1 laptop: $920 (save $130): This HP hybrid laptop comes with a 14-inch touchscreen display, an Intel Core processor, 16GB of RAM, and 1TB of storage.\n- Lenovo Yoga Book 9i 2-in-1: $1,500 (save $500): Another powerful laptop currently on sale is a Lenovo hybrid laptop. This future-proof touchscreen laptop comes with an option to run two monitors, an Intel Core Ultra 7 processor, 16GB of RAM, and 1TB of SSD storage.\n- HP Victus Full HD gaming laptop: $815 (save $85): While it might struggle with the highest-resource games, this gaming laptop is reasonably priced considering its specifications, including a 144Hz refresh rate, an AMD Ryzen 7 processor, 512GB of storage, and Nvidia GeForce RTX 4050 Graphics.\nApple deals\n- Current price: $189\n- Original price: $250\nThe 2022 Apple Watch SE is on sale for less than $200 -- and it's the one I personally recommend if you want a solid basic smartwatch.\n- Current price: $170\n- Original price: $250\nThis is not the best price we've seen for the AirPods Pro 2, but these under $200 AirPods are still highly recommended.\n- Current price: $549\n- Original price: $599\nThe Apple iPad Air follows the iPad Pro as the second-most capable tablet in the iPad lineup. With the new M3 chip, the Air gets about 17% gains in CPU improvements on the benchmark tests we performed. These improvements are most noticeable in better app performance, multitasking, and rendering speeds.\nReview: Apple iPad Air (7th generation)\n- Current price: $99\n- Original price: $129\nThe Apple Pencil Pro is under $100 again, and it's the best stylus option for the latest iPads.\n- Current price: $1,000\n- Original price: $1,100\nThis particular iPad is for power users and the highest of high-end professionals. Its M4 chip consists of a new 10-core GPU, next-generation machine learning accelerators to handle a diverse range of tasks, and ProMotion technology, enabling variable screen refresh rates ranging from 10 to 120Hz.\n- Apple Magic Keyboard Folio: $200 (save $49): Designed for the base-model iPad, this attachable keyboard has a built-in trackpad and an adjustable stand.\n- Apple Watch Series 10 42mm: $329 (save $70): Last year's Watch Series 10 is still selling for the same $70 off it's been for the last several months, but it's still a great option for wellness tracking for less.\n- Apple AirTag 4-Pack: $65 (save $34): The cheapest we've seen this pack sell for is this price, and if you need seamless Bluetooth tracking, this 4-pack is the best value.\nKitchen and household deals\n- Current price: $420\n- Original price: $700\nDid you know you don't have to clean your windows or glass doors by hand? There's a robot for that (and it's on sale).\nAlso: Does a window-cleaning robot actually work? I tested one to find out (and I'm pleasantly surprised)\n- Current price: $700\n- Original price: $1,200\nThis robot vacuum was our reviewer's favorite last year. It's nearly 50% off, but it's still a great option for keeping your floors spotless.\nAlso: I test robot vacuums for a living and the best one of 2024 is on sale\n- Current price: $800\n- Original price: $1,500\nThis 3-in-1 robot vacuum system is a ZDNET reader favorite, and one of the top 10 ZDNET best sellers in the robot vacuum category.\nReview: Eufy Omni S1 Pro\n- Nespresso Vertuo Pop+ Coffee Maker: $134 (save $46): Make your favorite hot drinks (including espresso) at home for less.\n- Bissell Little Green Mini Stain Machine: $85 (save $10): Clean up tough stains on carpet or upholstery with ease.\n- Dyson V11 Cordless Stick Vacuum: $400 (save $230): This popular Dyson model is on sale for over 30% off.\nHealth and wellness deals\n- Current price: $194\n- Original price: $230\nReviewer Nina Raemont recommends these sleep earbuds for a good night's rest.\n- Current price: $50\n- Original price: $80\nMy favorite smart scale is on sale for a limited time, and it can even track your pet's weight.\n- Renpho Eyeris 2 Massager: $48 (save $25): Editor Allison Murray and I both swear by this eye massager for tired eyes and migraines.\n- Loop Quiet 2 Earplugs: $21 (save $7): Editor Nina Raemont has worked with Loop earplugs before, and likes their affordability and no-fuss function.\n- Fitbit Inspire 3: $70 (save $30): This budget Fitbit just got cheaper, and it's perfect for simple health and wellness tracking.\nCyber Week FAQs\nWhen is Black Friday?\nThis year, Black Friday falls on Friday, Nov. 28. Cyber Monday follows shortly after on Monday, Dec. 1.\nAre deals really cheaper during Black Friday?\nThe holiday season, including Black Friday, is generally a great time to scoop up deals on a multitude of products, including flagship tech. While it's true to shop smart you need to be aware of sly tactics like markups and faux discounts, price tracking tools like Keepa and CamelCamelCamel make it easier than ever to ensure you're getting the best deal possible. Black Friday is also an excellent time to save on last year's latest tech, as we've seen dozens of new releases in phones, TVs, laptops, tablets and more over the last 6 months.\nAlso: Worried about rising tech prices? Try these 5 easy ways to shop smarter right now\nHow did we choose these early Black Friday deals?\nZDNET only writes about deals we want to buy -- devices and products we desire, need, or would recommend. Our experts looked for deals that were at least 20% off (or are hardly ever on sale), using established price comparison tools and trackers to determine whether the deal is actually on sale and how frequently it drops.\nWe also looked over customer reviews to find out what matters to real people who already own and use the deals we're recommending. Our recommendations may also be based on our own testing -- in addition to extensive research and comparison shopping. The goal is to deliver the most accurate advice to help you shop smarter.\nWhat are the best early Black Friday deals?\nZDNET's full slate of early Black Friday coverage will be launching soon, but keep an eye out for individual offers surfaced on our site as well as opportunities to save at major retailers that may fly below the radar. We also broke down our favorite tech for the holiday season that's perfect for gifting to yourself or a loved one. Shop our gift guides below:\n- The best tech stocking stuffers\n- The best tech gifts\n- The best tech gifts under $100\n- The best tech gifts under $25\n- The best gadgets to gift\nMore questions? Read our Cyber Week 2025 shopping guide to discover everything you need to know about Cyber Week 2025, including all the details on Black Friday and Cyber Monday sales.",
      "enhanced_at": 1762341413.5607464,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:16:53.561115+00:00Z"
}