{
  "id": "latest-news-zdnet-com-2025-11-04-345b4ce0",
  "source_id": "latest-news-zdnet-com",
  "guid": "060cdb91-348c-4a6c-8b88-e3bc2d3c905f",
  "title": "The best phones of 2025: Expert tested and reviewed",
  "url": "https://www.zdnet.com/article/best-phone/",
  "published_at": "2025-11-04T21:56:00+00:00",
  "fetched_at": "2025-11-05T11:16:43.273675+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "These are the best phones of 2025 from Samsung, Apple, and Google - all thoroughly tested and competing for the top spot.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "I test dozens of phones every year: How the iPhone stacks up with Google and Samsung's best\n'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\n2025 has been a very prosperous year for smartphones. The OnePlus 13 set the tone early, followed by the Galaxy S25 series and, more recently, Apple's barrage of iPhone 17 models, including the new iPhone Air. Apple even followed up its iPhone launch with the official release of iOS 26, bringing a refreshed look and feel to its software.\nThat's to say, there's a slew of phones screaming for your attention right now. So, as you're going into the holiday shopping season, really think about what you need on a day-to-day basis. The best options on the market feature displays that can outshine the outdoor sun, cameras that capture great photos in the most difficult lighting environments, and software features that truly enhance your communication and productivity.\nBest mobile deals of the week\n- $650 (save $60)\n- $499 (save $300)\n- $551 (save $50)\n- $250 (save $300)\nWhat is the best smartphone right now?\nAfter extensive testing of dozens of devices, our pick for the best phone overall is the Samsung Galaxy S25 Ultra, thanks to its immersive and vibrant display, reliable battery life, and wealth of special features, some of which are powered by the company's latest generative artificial intelligence (AI) model.\nIt's not cheap, starting at $1,299, but our testing found it to be worth the money, especially if you can snag a carrier deal or trade-in promotion. Apple's iPhone 17 Pro Max is a close second, with a new aluminum design, a vapor chamber cooling system for heat management, and an 18MP Center Stage selfie camera for flexible recording.\nOf course, our pick for the best phone overall may not be the best for you. Regardless of which option on this list you choose to invest in, expect it to be high-performing, feature a display that is bright enough for outdoor use, and include a camera system that will meet your photography needs.\nAlso: The best Android phones to buy now\nBest phones of 2025\nWhy we like it: The Galaxy S25 Ultra stands out as the premier handset so far in 2025 with its sophisticated integration of Galaxy AI and arsenal of hardware features. The latest Galaxy AI suite brings practical and useful features like real-time call translation, voice commands that work across multiple apps, and photo editing capabilities. Real-world testing suggests these AI functions surpass those on competing Android devices in speed, dependability, and overall usefulness.\nBeyond the AI, the phone has impressed us with its large 6.9-inch, anti-reflective, AMOLED display and robust 5,000mAh battery. Performance is bolstered by the upgraded Snapdragon 8 Elite for Galaxy chipset and 12GB of RAM, further enhanced by a larger cooling chamber ideal for multimedia and gaming. The smartphone also excels in durability with its lightweight titanium frame and new resilient Corning Gorilla Armor 2 glass.\nFurthermore, the camera system is significantly upgraded with a 50MP ultrawide lens that captures landscape and macro shots with greater detail and vibrancy. We've run several camera tests between the S25 Ultra and competing phones like the iPhone 17 Pro Max and Google Pixel 10 Pro XL, and found the Samsung model to deliver the sharpest and vibrant imagery.\nReview: Samsung Galaxy S25 Ultra\nWho it's for: The Galaxy S25 Ultra is primarily targeted towards users who demand the best smartphone experience Samsung can provide and are keen to explore the latest consumer-facing AI features. It represents a particularly compelling upgrade for individuals holding onto three to four-year-old devices, offering significant advancements across the board.\nThe strong build makes it an excellent choice for those who prioritize device protection against everyday mishaps. Multimedia enthusiasts will appreciate the large, anti-reflective, 6.9-inch screen combined with enhanced cooling technology. Additionally, photography lovers looking for improved detail and color in wide-angle and close-up macro shots will find the new 50MP ultrawide camera valuable.\nWho should look elsewhere: Despite its strengths, the Galaxy S25 Ultra's $1,300 price point makes it out of reach for budget-conscious consumers. In addition, users who frequently utilize the S Pen's Bluetooth gestures for actions like remotely triggering the camera may be disappointed, as the functionality has been removed.\nFurthermore, individuals who prefer a less angular or \"boxy\" phone design might find the standard Galaxy S25 or S25 Plus models more aesthetically pleasing and comfortable to hold. If you prefer a less bloated software experience, consider the Google Pixel 10 Pro XL or OnePlus 13, both of which also cost less than the Ultra.\nSamsung Galaxy S25 Ultra specs: Processor: Qualcomm Snapdragon 8 Elite for Galaxy | Display size: 6.9 inches | Storage options: Up to 1TB | Rear cameras: 200MP main, 50MP ultrawide, 50MP telephoto with 5x zoom, 10MP telephoto with 3x zoom | Front camera: 12MP | Battery: 5,000mAh | Price: Starting at $1,300\nWhy we like it: The iPhone 17 Pro Max cements its position as Apple's pinnacle smartphone offering over the last year, delivering a comprehensive package for the premium user.\nBesides being the largest iPhone Apple currently offers, with a 6.9-inch AMOLED display, the iPhone 17 Pro Max also has the best-rated battery life of 39 hours of video playback. From our tests, we found the phone lasted much longer than the standard 17 Pro and last year's 16 Pro Max.\nThe iPhone 17 Pro Max looks and feels fairly similar to its predecessor, but it's now made with aluminum instead of titanium. This material choice keeps the phone cooler and more durable, while also allowing Apple to introduce a more exciting lineup of colors this year, including the polarizing Cosmic Orange.\nThe most notable hardware change with the latest iPhone is the vapor cooling chamber, which works in tandem with the updated A19 Pro chip to optimize and maintain performance loads. We found the feature ideal for photographers and videographers who often experience recording issues due to the iPhone overheating.\nReview: iPhone 17 Pro and Pro Max\nWho it's for: The iPhone 17 Pro Max is a flagship phone that commands a flagship price, meaning it's ideal for users who are willing to pay for the best iPhone available, whether that's directly through retailers or through carrier deals. You should buy the Pro Max version if you want the larger screen, enduring battery life, and triple-camera setup.\nWho should look elsewhere: But if you're shopping on a budget and don't mind a smaller screen, consider the $1,099 iPhone 17 Pro ($100 cheaper and with a 6.3-inch display). If you can live without the dedicated telephoto lens, you can even go with the $799 iPhone 17, which features a ProMotion display and the same 40W wired charging rate.Additionally, individuals who find large phones unwieldy might prefer a smaller device, even within Apple's own lineup.\nAlso: Best password manager for iPhone\niPhone 17 Pro Max tech specs: Processor: A19 Pro | Display size: 6.9 inches | Storage options: Up to 2TB | Rear cameras: 48MP main, 48MP ultrawide, 48MP telephoto (4x) | Front camera: 18MP\nWhy we like it: The Samsung Galaxy Z Fold 7 is the best foldable phone going into the rest of 2025, thanks to its ultra-thin form factor and market-leading camera system, which captures more lifelike images than competing models from OnePlus and Google, based on our tests.\nSamsung took the traditional smartphone route when refining the outer display of the Samsung Galaxy Z Fold 7, opting for a wider, more regular aspect ratio panel than last year's narrower Galaxy Z Fold 6. That makes a notable difference in hand-feel and ergonomics, even though the two phones are only $100 apart. Compared to the standard slab-style phone, you're simply getting more screen with the Z Fold 7, with a larger 8-inch display when unfolded. For reference, most modern-day phones range from 6 to 6.8 inches.\nNaturally, all the content I've been consuming on the phone, like video streaming, social media feeds, and Google Maps, is portrayed in a highly consumable manner; nothing feels disorienting or cropped out. While the foldable doesn't match its Ultra sibling spec-for-spec, the Z Fold 7 truly shines and more than makes up for the \"inferior\" 200MP camera system in long exposure shots and selfies, thanks to its self-standing nature.\nReview: Samsung Galaxy Z Fold 7\nWho it's for: I often recommend the Samsung Galaxy Z Fold over other foldables because of Samsung's feature-rich approach to software. Running on the OneUI launcher (over Android 16) means you can expect a simple yet customizable user interface, with support for up to seven years of operating system and security updates. I can't say the same for the OnePlus Open or Motorola Razr.\nThis ultra-slim form factor is also ideal for multitaskers and other users who want to see as much information at once as possible without reaching for a tablet or laptop. You simply won't find a foldable with better ergonomics right now than this.\nWho should look elsewhere: With a starting price tag of $1,999, you're mostly paying for the innovation factor with this phone. So if you're more interested in a safe and reliable handset that's arguably much easier to repair, then I'd recommend a traditional slab phone like the Samsung Galaxy S25 series instead.\nUsers shopping for a foldable phone should consider the Google Pixel 10 Pro Fold if they prefer a handset with less bloatware and a stubbier design, or last year's Samsung Galaxy Z Fold 6 if they want S Pen stylus support, which the Z Fold 7 omits.\nSamsung Galaxy Z Fold 7 tech specs: Processor: Qualcomm Snapdragon 8 Elite | Display sizes: 6.5-inch exterior and 8-inch interior | Storage options: 256GB, 512GB, or 1TB | Rear cameras: 200MP wide, 12MP ultrawide, 10MP telephoto | Front cameras: 10MP front | Battery: 4,400mAh | Price: Starting at $1,999\nWhy we like it: The CMF Phone 2 Pro is a top contender for the best cheap phone available today, offering remarkable value at just $279. It distinguishes itself from competitors, even those costing significantly more, with unique design features focused on user control and customization. Among these is the ability to easily swap back covers, attach screw-in accessories like kickstands or wallets, and expand storage via a MicroSD card -- a feature increasingly rare in modern smartphones.\nImpressively, the Phone 2 Pro avoids major compromises on essential specifications often seen at this price point. Our testing found the 3,000-nit OLED display to be notably bright, ensuring comfortable outdoor visibility. This also represents a significant upgrade from the previous model with improved contrast and color reproduction ideal for media.\nThe large 5,000mAh battery delivers solid endurance for most users, enough to comfortably last our reviewers a day of usage. Furthermore, Nothing's streamlined interpretation of Android is a highlight, offering a thoughtful, bloatware-light experience enriched with unique widgets that enhance usability without unnecessary clutter.\nReview: CMF Phone 2 Pro\nWho it's for: This device primarily targets budget-conscious buyers seeking the best possible features and experience without breaking the bank. Its unique customization options, including the swappable backs and accessory system, make it perfect for users who enjoy personalizing their tech. The MicroSD card slot is a major draw for anyone needing ample, affordable storage expansion on top of the base 256GB configuration.\nThe CMF Phone 2 Pro is also an excellent choice for users who prioritize a clean software experience and appreciate the distinctive design elements of Nothing OS. For individuals whose primary phone usage involves browsing, social media, messaging, and media consumption, the bright display, reliable battery life, and adequate performance deliver a satisfying daily experience well beyond what its price tag might suggest.\nWho should look elsewhere: Users who engage in frequent, graphics-intensive gaming or heavy multitasking may find the MediaTek Dimensity 7300 Pro processor underpowered. A device with a stronger chipset would be more suitable.\nWhile the camera system is competent for the price and includes a telephoto lens, its performance in low-light conditions lags behind competitors, making it less ideal for those prioritizing photography in challenging environments. The Google Pixel 9a might be a better fit here.\nMost importantly, potential buyers must be aware of its network limitations. The CMF Phone 2 Pro lacks the necessary band support for use on the Verizon network in the US.. For those needing Verizon compatibility, stronger performance, or better low-light camera capabilities within the budget segment, alternatives like the Motorola Moto G Power 2025 or the Google Pixel 9a should be considered.\nCMF Phone 2 Pro by Nothing tech specs: Display size: 6.77 inches | Display type: OLED | Resolution: 2780 x 1264 | Refresh rate: 120Hz | Battery life: 5,000mAh | RAM: 8GB | Storage: 256GB | Rear camera: 50MP main, 8MP ultra-wide, 50MP telephoto | Front camera: 16MP | Processor: MediaTek Dimensity 7300 Pro | Price: Starting at $279\nWhy we like it: The Pixel 10 Pro XL is the top-of-the-line phone coming from Google, which also makes the Android operating system. It's the kind of vertical integration that only Apple can match currently. That opens some doors that other manufacturers don't have access to, particularly in the software department. That also makes it possible for Google to have a whole ecosystem of devices ready to support the phone, and work together seamlessly like the Pixel Tablet, Pixel Watch, and Pixel Buds.\nMore than ever, Google is doubling down on AI, and the Pixel 10 Pro XL is the epitome of that right now. With Gemini built in, along with parlor tricks like Veo 2 (which can generate videos from your photos on demand), the Pixel 10 Pro XL is your one-stop shop for computational photography.\nReview: Google Pixel 10 Pro XL\nWho it's for: People who are looking for a large screen and a big battery will be all-in on this phone. This phone also supports faster charging than its smaller sibling, the Pixel 10 Pro -- though basically everything else is the same between these two devices. The larger screen in particular is great for consuming content, using a larger viewfinder for your photography, and some gaming as well.\nGoogle sees the future as being largely AI-driven, and if you're of the same mind, the Pixel 10 Pro XL is a great device for it. Putting aside Gemini and Gemini Live, one other piece of AI to pay attention to is Magic Cue. This is an AI-driven proactive assistant that promises to tie into all your Google services and help you get the information you need when you need it.\nWho should look elsewhere: The Pixel 10 Pro XL is a very large phone with a 6.8-inch screen, and that's frankly not for everyone. Fortunately, as mentioned, the Pixel 10 Pro is a good alternative to that in a smaller package. It has the same camera setup and computational photography chops as the Pixel 10 Pro XL, so you don't miss out on anything in that regard.\nAlso, to be perfectly blunt, people who value privacy might want to look elsewhere. Google has pivoted away from its blatant use of your personal data, moving a lot of its AI features to devices only, but the fact that Magic Cue can look at your calendar may be concerning, and we can't blame you for that. If privacy is a concern, the iPhone 16 Pro has a great set of cameras and a vast array of privacy-first features that may appeal to you.\nGoogle Pixel 10 Pro XL tech specs: Processor: Google Tensor G5 | Display size: 6.8 inches | Storage options: 256GB/512GB/1TB | Rear cameras: 50MP main, 48MP ultrawide, and 48MP telephoto | Front camera: 42MP | Battery: 5,200mAh | Price: Starting at $1,199\nWhy we like it: Deciding on the best flip-style foldable phone came down to the wire, with Motorola's Razr Ultra just scraping by Samsung's Galaxy Z Flip 7. I went hands-on with the new Razr Ultra model earlier this year, and was thoroughly impressed by the improved hinge system (read: the phone feels sturdier to flip open and close), as well as the performance, which is underpinned by an updated Qualcomm Snapdragon 8 Elite chipset and 12GB of RAM.\nMotorola's outer display still supports virtually any app you throw at it, meaning you can browse the web, play games, scroll TikTok, and do other mobile tasks without ever needing to flip open the device. Samsung's platform is more limited in this regard, which always felt like a missed opportunity when testing.\nIt also helps that the Razr Ultra has a textured backing, including new Alcantara and Wood finishes, which I've found to be easier to hold and grip than competing flip phones. Considering how fragile these foldable devices can be -- anything with so many moving parts typically are -- the enhanced grip is easy to appreciate.\nReview: Motorola Razr Ultra (2025)\nWho it's for: At $1,299, the Razr Ultra is not a cheap flip phone by any means. That's why its more affordable siblings, the Razr and Razr Plus exist. But if you want the most complete, durable, and visually-stimulating flip phone on the market right now, you'll have to pay to play with the Razr Ultra.\nI applauded Motorola for exploring new color and material finishes with this year's Razr, and that's something fashion-forward users will likely favor too. The battery on this year's model -- 4,700mAh, up from 4,000mAh -- is also much larger, which you can never really complain about.\nWho should look elsewhere: When buying the Razr Ultra, you should also consider aspects like Motorola's relatively short software update cadence, which ranges from 2 to 3 years, versus Google and Samsung's 7 years. If you're looking for a phone that's even more forgiving when dropped, I'd invest in a traditional slab handset instead, like the Samsung Galaxy S25 series or iPhone 17 Pro series.\nMotorola Razr Ultra (2025) tech specs: Processor: Qualcomm Snapdragon 8 Elite | Display sizes: 4-inch exterior and 7-inch interior | Storage options: 512GB, 1TB | Cameras: 50MP wide, 50MP ultrawide, 32MP front | Battery: 4,700mAh | Price: $1,299\nWhy we like it: While the OnePlus 15 is imminent, the OnePlus 13 remains a top choice, with exceptional performance, class-leading battery life, and remarkable durability, all while maintaining a highly competitive price point. Starting at $900, it offers outstanding value compared to rivals like the $1,000 Samsung Galaxy S25 Plus and $900 Google Pixel 9 Pro, with value further enhanced by potential trade-in offers.\nUnder the hood, it boasts the powerful Snapdragon 8 Elite processor, generous RAM configurations up to 16GB, and a stunning 6.82-inch QHD+ LTPO AMOLED display with a 120Hz refresh rate and incredible peak brightness up to 4,500 nits.\nIts massive 6,000mAh battery scored high ratings with ZDNET's endurance tests. It's complemented by market-leading 80W wired charging capable of a full charge in under 30-40 minutes and rapid 50W wireless charging.\nDurability is another strength, featuring an impressive IP69 rating for resistance against high-pressure, high-temperature water jets and humidity, along with Ceramic Guard screen protection.\nAdditions like an improved ultrasonic fingerprint sensor, unique design options including vegan leather backs, helpful screen features like Glove Mode, and the signature Alert Slider round out a compelling hardware package supporting a capable triple 50MP camera system.\nReview: OnePlus 13\nWho it's for: The OnePlus 13 is tailor-made for users seeking flagship-level performance, particularly in battery life and charging speeds, without the price tag. Its exceptional endurance and rapid charging make it ideal for heavy users and those always on the go. The robust IP69 rating appeals to individuals needing a phone that can withstand more demanding environments than typical IP68-rated devices.\nPerformance enthusiasts will appreciate the smooth operation driven by the Snapdragon 8 Elite and an ample 16GB of RAM. It's also a great fit for users who prefer a less AI-saturated software experience compared to some competitors, or those who appreciate OnePlus's distinct design philosophy and the tactile convenience of the Alert Slider, though that feature is reportedly being revamped soon.\nWho should look elsewhere: Despite its numerous strengths, the OnePlus 13 may not be the perfect choice for everyone. Users who prioritize purchasing through major U.S. carrier stores might find availability less convenient compared to Samsung or Google devices. While OnePlus offers a solid update policy of four years of OS updates up to Android 19 and six years of security, those seeking longer software support should try Google or Samsung flagships. These often promise seven years.\nAlthough the triple 50MP camera system is highly capable, users demanding the utmost consistency in computational photography, particularly in challenging zoom or low-light scenarios, might still prefer the specialized output from Google Pixel or high-end Samsung models. Additionally, users heavily reliant on MagSafe or Qi2 accessories should note that native magnetic attachment requires a specific OnePlus case.\nOnePlus 13 tech specs: Processor: Qualcomm Snapdragon 8 Elite | Display size: 6.8 inches | Storage options: 256GB/512GB | Rear cameras: 50MP main, 50MP ultrawide, and 50MP telephoto | Front camera: 32MP | Battery: 6,000mAh | Price: Starting at $900\nTop smartphones compared\nOur pick for the best phone overall is the Samsung Galaxy S25 Ultra. It features everything you could want from a smartphone, including a large display, four cameras that can shoot 200MP photos and 8K video, up to 1TB of storage, a built-in S Pen for writing and drawing, and a 5,000mAh battery powering the system. Here's how the S25 Ultra fares with the rest of our top picks.\nBest phone model | Price | Storage | Screen size | Battery size | Processor |\nSamsung Galaxy S25 Ultra | $1,300 | Up to 1TB | 6.9 inches | 5,000mAh | Qualcomm Snapdragon 8 Elite for Galaxy |\niPhone 17 Pro Max | $1,200 | Up to 2TB | 6.9 inches | 4,500mAh (est.) | A19 Pro |\nGoogle Pixel 10 Pro XL | $1,100 | Up to 1TB | 6.8 inches | 5,200mAh | Google Tensor G5 |\nSamsung Galaxy Z Fold 7 | $2,000 | Up to 1TB | 6.5 inches and 8 inches | 4,400mAh | Qualcomm Snapdragon 8 Elite |\nMotorola Razr Ultra | $1,300 | Up to 512GB | 7 inches | 4,700mAh | Qualcomm Snapdragon 8 Elite |\nCMF Phone 2 Pro | $279 | Up to 256GB | 6.77 inches | 5,000mAh | MediaTek Dimensity 7300 Pro 5G |\nOnePlus 13 | $900 | Up to 512GB | 6.8 inches | 6,000mAh | Qualcomm Snapdragon 8 Elite |\n*MSRP at the time of writing\nWhich is the right phone for you?\nHaving a list of your must-have smartphone features can go a long way toward narrowing down your options. If you're a mobile professional or travel a lot for work, you'll want to choose a phone that can provide you with at least a full day of use on a full battery and both LTE and Wi-Fi connectivity.\nIf you're looking for your teen's first smartphone, a budget-friendly and less feature-heavy option may be better to prevent overspending and misuse. If you're a content creator or other creative professional, you'll want a phone with an excellent front and rear camera to capture photos and videos for your social media feed.\nChoose this best phone... | If you want... |\nSamsung Galaxy S25 Ultra | A no-compromise smartphone that virtually any type of user can take advantage of. It's the only 2025 smartphone with a built-in stylus. |\niPhone 17 Pro Max | The best iPhone money can buy. It has a large screen, the longest-lasting battery out of all the models, and a toolbox of a camera system. |\nGoogle Pixel 10 Pro XL | A flagship camera experience at your fingertips. The Pixel 10 Pro XL differentiates itself with a slew of AI-powered and the best selfie camera on the market. |\nSamsung Galaxy Z Fold 7 | The best phone-to-tablet foldable that money can buy today. And if you're a power user, the multitasking and AI features will serve you especially well. |\nMotorola Razr Ultra | A flip-style foldable that's both compact and performant. With a large 4-inch external display and improved battery life, this is the foldable to buy for most people. |\nCMF Phone 2 Pro | A more budget-friendly smartphone that doesn't compromise on performance and software experience. The CMF Phone 2 Pro also has a unique removable back cover that opens up a world of 3D-printed customizations. |\nOnePlus 13 | A phone that lasts long and charges from 0% to 100% in just 30 minutes. The OnePlus 13 is quietly good value, too, starting at $900. |\nAndroid vs iOS: How to decide\nAndroid:\nGoogle's operating system has always been about personalization, app freedom, and flexible use cases. For example, dozens of Android manufacturers launch phones annually, while iOS runs only on Apple's iPhone, which releases two models yearly. Naturally, there are more Android app developers, niche software and services, and form factors that go beyond the glass slab.\nPros:\n- Customization: While the latest iPhone software, iOS 26, is the most customizable version yet, Android is still ahead in modifying settings, looks and appearance, and more. You can adjust settings on a per-app basis, install third-party launchers, icon packs, and other services, and even tweak system animations to make the operating system faster.\n- App variety: According to AppExperts, there are over 3.5 million Android apps on the Google Play Store and more than 1.8 million apps on the iOS App Store. That's a big difference in volume that ultimately impacts users who desire more niche and specific apps for work and play. For example, while both platforms will carry services like WhatsApp and Instagram, Android usually has the upper hand with companion apps for consumer products, unreleased APKs, and more. There's also free access to sideload apps from third-party stores -- that process is exclusive to European users as far as iOS is concerned.\n- Price and availability: Both Android and iOS are offered across the mid-to-high price tiers, but the former goes a step further with options that cater to budget-oriented shoppers. If you're shopping for a smartphone for less than $300, unless you're willing to buy a second-hand iPhone that's already a few generations old, Android handsets are your best option. Android phones also come in foldable form factors, from clamshell-style devices like the Samsung Galaxy Z Flip 7 to book-style ones like the Google Pixel 10 Pro Fold.\nCons:\n- Security and privacy: The abundance of Android phones and app makers means there are more opportunities for cybercriminals to access your personal information and/or install malware. How these attacks are prevented and managed also varies across manufacturers, with some OEMs like Google doing a better job than others like Xiaomi.\n- Inconsistency with quality: Like security and privacy, you must always consider which Android maker you're buying a phone from and what it offers across different price ranges. Larger legacy brands like Samsung have a greater reputation for quality assurance and value. In contrast, smaller, newer brands like Nothing and OnePlus must prove themselves, sometimes taking risks that backfire in the process.\niOS:\nThe iPhone's operating system remains one of the most robust and closed in on the market, with unique features that only amplify the Apple hardware experience. Whether you're using an older or newer iPhone, iOS offers superior feature parity across generations than Android, with extended software support being one of its biggest benefits.\nPros:\n- Exclusive, ecosystem-based services: Strength in numbers is the name of the game for iOS, with the operating system notorious for its exclusive apps and services, such as iMessage and FaceTime, which make switching away from the iPhone more difficult than it should be. It helps that Apple has surrounded the iPhone with hardware and software that work harmoniously with iOS, including AirDropping files into a MacBook, pulling health data from an Apple Watch, and even hearing aid tests via AirPods.\n- Quality of apps: Beyond the first-party apps, US developers often spend more time creating and optimizing iOS apps than Android apps due to the percentage of users. Naturally, services like Snapchat, Instagram, and TikTok function more fluidly on iOS than on Android.\n- Longevity: When you buy a new iPhone, expect upwards of seven years of software support. While Android makers like Google and Samsung have begun to match Apple's software update policy, the Cupertino tech giant remains the most consistent and reliable, regardless of the model. For reference, Samsung has a better track record of updating its flagship phones than its midrange phones.\nCons:\n- Restrictive experience: Apple has loosened its grip on customizability over the years, with last year's iOS 18 update finally allowing users to freely place apps and widgets anywhere on the home screen grid. However, compared to Android, the iPhone software still has a ways to go. For example, you still can't customize notification types at a per-app level, set navigation gestures beyond swiping from the left side to go back, or download third-party app icons.\n- Poor file management: If you've ever downloaded an image from the web on an iPhone, you'll know just how cumbersome it can be to locate that file later on. Sometimes, downloaded photos and videos will be directed into the file manager app first, requiring further action to fully migrate them into the Photos app.\nFactors to consider when choosing a phone\nThe process of making our phone selections includes real-world testing and researching about the phones for weeks, consulting with colleagues, industry experts, and analysts who also have hands-on experience with the smartphones, and then selecting the best from all of the available choices.\nUltimately, we weigh in the following aspects when curating this list:\n- Design: There's only so much you can do with a slab design, but size differences, material choices, color options, and even the ability to bend a screen in half give shoppers enough diversity to have a preference. That's why we have a recommendation for every form factor.\n- Performance: For many, smartphones are the center of our lives, which means the best ones are performant and can handle most, if not all, tasks you throw at them.\n- Camera: Arguably the most valuable feature of a smartphone; the consistency and reliability of a camera system can make or break the overall mobile experience. We test every device in broad daylight and in the darkest of nights when finalizing this list.\n- Battery: Every option in this guide should last you at least a day of moderate use. We also consider what devices support fast charging and/or wireless charging.\n- Value: Price points are noted, but the most important thing with buying a phone is getting your money's worth. With these picks, you can rest assured that you're getting the best bang for your buck.\nHow we test phones\nZDNET's review team spends upwards of a year testing the ins and outs of every major phone release, evaluating the day-to-day performance, camera quality, battery life and endurance, and special features. Here's a breakdown of every factor we consider before we make recommendations:\n- Design and ergonomics: How good a phone looks and feels plays a big role in many users' buying journeys, so we consider these aspects heavily when testing.\n- Performance: Several factors affect a phone's performance, including LTE/5G signal, battery life, and background tasks. Therefore, we typically begin our evaluations with a fully charged handset, with all background tasks closed, and with as stable of a mobile connection as possible.\n- Camera quality: ZDNET tests phone cameras by capturing hundreds of photos and videos of various subjects and in various lighting conditions. We also compare the output to that of older models.\n- Battery life and charging: It's also important for us to evaluate how long phones last under light, moderate, and heavy usage, how long they take to recharge, and how they do it -- wired, wireless, or both.\n- Special features: These features distinguish tested devices from a bustling smartphone market and hopefully bring added value to users, not the opposite.\n- Pricing and availability: Beyond budget considerations, we also note if a phone is available in the US or only internationally.\nFor a more extensive breakdown, check out our comprehensive phone testing methodology page.\nKerry Wan's smartphone advice\nI've used dozens of smartphones in the past year alone, learning the ins and outs -- the tips and tricks -- to make the most out of my handset. Here are my three biggest pointers on taking care of your smartphone right now:\nSpeeding up your smartphone\nSomething I always do when setting up a new Android phone is dialing up animation and transition speeds. You can do this by turning on Developer Options, a backend catalog of system settings meant for developers to access, but rules were meant to be broken, right?\nTo turn on Developer Options, go into your About Phone page in the settings and look for the Build Number. Tap on that seven times and you should see a pop-up indicating that Developer Options has been turned on. Now, the activated tab will appear in the main settings list. From within, scroll down until you find Windows, Transition, and Animator duration scale. Tap into each and switch from the 1x default setting to .5x to double the speed of your phone's animations.\nOptimizing your battery health\nTo preserve your phone's battery life, it's best to charge it between 20% and 80% and never let it drop to 0% or charge fully to 100%. This is because the heat generated from overcharging the phone can burn -- or degrade -- the battery, reducing its number of charge cycles. This phenomenon is the reason why you shouldn't charge your phone overnight or leave it plugged in for an extended period of time.\nWhen in doubt, after a year or two of usage, consider getting your phone's battery swapped to refresh its charge cycles. You'll be amazed at how well it functions again.\nHow to keep your phone clean\nUnless you're invested in a repairs and warranty plan like Apple Care, consider suiting your phone with a protective case and/or tempered glass screen protector. Beyond drop protection, the two accessories will prevent the phone from getting scratches, scuffs, and other blemishes and can greatly reduce the chance of water damage. For what it's worth, if a manufacturer claims its phone is rated IP68, that means the device can withstand dust ingress and be submerged in water for up to 30 minutes at one meter deep.\nOccasionally, take an alcohol pad and give your phone a wipe-down. If you think about it, your phone is just as likely to accumulate germs as your hands, so don't forget to clean it.\nLatest news on phones\nSince the iPhone 17 event in September, several news events have happened in the phone market, starting with Qualcomm's announcements during its Snapdragon Summit in Hawaii. At the press conference, the chipmaker debuted the Snapdragon 8 Elite Gen 5 processor, which we expect to see across major Android phones in 2026, including the rumored Galaxy S26 series and OnePlus 15.\nThe new chip promises up to 20% performance gains compared to its predecessor, along with a 23% increase in graphics processing. Agentic AI features will be enhanced by the new Hexagon NPU, enabling users to leverage personalized and multi-app AI agents, provided that phone manufacturers offer these services.\nIn other news, the Google Pixel 10 Pro Fold, which launched back in August, finally went on sale in October. It's still expensive at $1,799, but it's the first foldable phone to be certified with an IP68 rating, keeping it both water and dust-resistant.\nLastly, we're seeing rumors that OnePlus will launch the 15 series (skipping the 14 branding in the process) later in November. It'll likely be the first mainstream smartphone to feature the aforementioned Qualcomm chipset, while also boosting other notable endurance specs, such as a larger battery. We should be able to confirm what's new in a matter of weeks.\nFAQ on smartphones in 2025\nWhen do new phones come out?\nWhile the year just started, we can look at past industry trends to understand when new phones will be released. Below is a list of expected release dates/timeframe for major phones in 2025.\n- Samsung Galaxy S25 series: January\n- OnePlus 13 series: January\n- Apple iPhone 16e: February\n- Google Pixel 9a: March\n- Motorola Razr Ultra: May\n- Samsung Galaxy S25 Edge: May\n- Samsung Galaxy Z Fold 7 and Z Flip 7: July\n- Google Pixel 10 series: August\n- Apple iPhone 17 series: September\n- OnePlus 15 series: November\n- Samsung Tri-Fold phone: December\nWhat's new with iOS 26?\nIf you're an iPhone user, iOS 26 introduces a slew of new features and design changes to be excited about. In fact, you can download the software on a compatible iPhone right now.\nAlso: You can update your iPhone to iOS 26 for free right now - here's which models support it\nWith iOS 26, the biggest feature is arguably Apple's Liquid Glass design language, which applies a level of transparency and fluidness across buttons, settings menus, and other interfaces. Apple says the new UI is inspired by VisionOS, which powers the brand's XR headset and should invoke a sense of natural motion and smoothness.\nSome more practical iOS features include Hold Assist in the revamped Phone app, more customizations in Messages, a more functional CarPlay experience, and Live Translation across various popular apps.\nWhich phone is best for money?\nBesides the ones listed above, the latest iPhone 17 is the best phone for the money right now. It's the most affordable model of the new iPhones, but it offers a highly-functional feature set, including a smoother 120Hz ProMotion display, the same 18MP Center Stage front camera, an A19 chipset, and a base storage of 256GB. It almost makes the other iPhone models look like highway robbery.\nWhich phone has the best camera?\nWhether the iPhone 17 Pro Max, Google Pixel 10 Pro XL, and Samsung Galaxy S25 Ultra are the best is debatable. For long-distance shots, Samsung's 200MP rear camera with 100x Space Zoom can capture subjects as far out as the moon.\nGoogle's Pixel phones have always been at the top for point-and-shoot pictures and a rather simplified, but effective, camera experience.\nIf you're a videographer at heart, the iPhone 17 Pro Max can record 4K videos at 120 frames per second. The iPhone's new 18MP front-facing camera is also great for vloggers.\nHow long should a phone battery last?\nThe average phone battery lasts about 22 hours on a full charge, which is great for staying connected on commutes, work flights, and evenings at home. But that's just the average. Actual use time varies by phone model, battery capacity, the power efficiency of its processor, and what you're using your phone for.\nFor example, the latest iPhone 17 Pro Max boasts a 38-hour battery life. But you'll get less than that if you habitually scroll through social media or stream video and music.\nHow much storage should my phone have?\nMost smartphones have a base storage capacity of 128GB, which is plenty of space for average users to download apps and music, take photos, and shoot videos. However, if you're a mobile or creative professional, you'll need more space. Many smartphones have expanded storage options up to 512GB or even 1TB, and you can always sync your phone to your preferred cloud storage service to free up local storage space.\nLatest updates\n- In our November update, we added news about upcoming phone releases, including the OnePlus 15 and Samsung's tri-foldable phone. Our top picks remain the same, but changes may come soon as we test the latest Snapdragon 8 Elite Gen 5 handsets from overseas markets.\n- In our September update, we added the iPhone 17 Pro Max and Google Pixel 10 Pro XL after thoroughly testing the two. The iPhone 17 also gets a mention for being one of the best-value handsets at the time of publishing.\n- In our July update, we replaced the Google Pixel 9 Pro with the Samsung Galaxy Z Fold 7 for \"Best foldable Android phone.\" More information has also been added regarding Google's upcoming Pixel hardware event.\n- In our June update, we added information regarding confirmed information regarding the Samsung Galaxy Z Fold 7 and Z Flip 7, as well as replaced the Z Flip 6 for the Motorola Razr Ultra for \"best flip-style foldable phone.\"\n- In our May update, we added information regarding what other phones users can expect later this year, including the Galaxy S25 Edge, Z Flip 7, and Z Fold 7. The CMF Phone 1 has also been replaced by the CMF Phone 2 Pro for \"best cheap phone.\"\n- In our April update, we added information regarding Mobile World Congress (MWC). The OnePlus Open was also replaced by the Google Pixel 9 Pro Fold for \"best foldable phone.\"\nOther phones we tested\nWhether you're looking to upgrade or get your first smartphone, Apple, Samsung, and OnePlus have great choices that ZDNET's tested and recommends.\nIf you're tired of chunky and heavy smartphones, consider Samsung's Galaxy S25 Edge, which is one of the thinnest and lightest phones (for its display size) on the market. Just be wary of its form factor trade-offs, including a smaller battery and omission of a telephoto lens.\nIt might not be as big or popular as the Pro Max, but the iPhone 17 Pro has a more comfortable design with the same amount of power and capabilities, making it one of the best handsets you can buy right now.\nWhile it's not as flashy as its Pro siblings, the latest Pixel 10 has all the essential mobile features, including a 3,000-nit display, a handy 6.3-inch body, and the latest Tensor G5 chip.\nOur runner-up for the best flip-style foldable phone is the 2025 Motorola Razr Plus, which flaunts a 6.9-inch screen, 12GB of RAM, and a 50MP camera system.",
      "enhanced_at": 1762341421.2566018,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:01.256977+00:00Z"
}