{
  "id": "latest-news-zdnet-com-2025-11-04-c9c94cbe",
  "source_id": "latest-news-zdnet-com",
  "guid": "457d8824-53af-4b28-b8f9-242e31f67acc",
  "title": "You can try OpenAI's popular Sora video app on Android and iOS now - for free",
  "url": "https://www.zdnet.com/article/you-can-try-openais-popular-sora-video-app-on-android-and-ios-now-for-free/",
  "published_at": "2025-11-04T21:28:00+00:00",
  "fetched_at": "2025-11-05T11:16:43.274413+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "With Sora, you can create short-form, AI-generated videos featuring yourself or your friends - no invite code needed.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "You can try OpenAI's popular Sora video app on Android and iOS now - for free\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- OpenAI launched Sora 2 AI video and audio engine, in September.\n- Sora 2 is featured in the free Sora by OpenAI app.\n- The app is now available for both Android and iOS users.\nOpenAI's Sora app allows users to create personalized, AI-generated videos from the convenience of their phones on a social-media-like interface. However, at launch, the app was only available on iOS and required pesky invite codes --but not anymore.\nOn Tuesday, OpenAI announced that the Sora app is also now available for Android devices in the Google Play Store. As an added bonus, a limited-time promotion that allows users to try the Sora app without an invite code is being extended to Android.\nTo find out how to get access on both your Apple and Android devices, keep reading below.\nWhat is the Sora app?\nThe app utilizes OpenAI's Sora 2 AI video engine, and its layout features a social media-esque style, allowing users to discover and interact with other people's video creations. Aside from the social aspect, users can create short-form, AI-generated videos featuring themselves or their friends.\nAlso: How to use OpenAI's Sora to create stunning AI-generated videos\nAdditionally, OpenAI asserts there are safeguards and limits within the app, including likeness protection for users who want to control how and when their image is used in other users' cameos. A one-time video and audio recording of yourself captures your likeness, which will be used within the app.\nHow to access Sora 2\nOpenAI's Sora 2 AI-generated video and audio engine is only available to use within the Sora app. According to OpenAI, Sora 2's capabilities significantly exceed those of the previous model, offering synchronized dialogue and sound, greater adherence to the natural laws of physics, a deeper understanding of complex instructions, and more realistic results.\nAlso: How to turn off Gemini in your Gmail, Photos, Chrome, and more - it's easy to opt out of AI\nIf you want to try your hand at accessing Sora 2 before it's widely available, you can download the Sora app in the App Store or Google Play Store. Because of the current promotion, you can immediately get started after signing in. After the promotion is over, you will need to obtain an invitation code to access it.\nIn a launch blog post, the Sora Team said Sora 2 will be free to users with \"generous limits,\" so people can openly explore its capabilities.\nOpenAI's Sora 2 video engine directly competes with Google's Veo 2, the company's well-received AI video and audio engine. However, Google's Veo 2 is not available to free-tier users and instead is open to Gemini Advanced subscribers.",
      "enhanced_at": 1762341429.6178143,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:09.618093+00:00Z"
}