{
  "id": "news-the-citizen-lab-citizenlab-org-2025-11-04-f37d67d5",
  "source_id": "news-the-citizen-lab-citizenlab-org",
  "guid": "https://citizenlab.ca/?p=82849",
  "title": "Ron Deibert Awarded SFU’s 2025 Sterling Prize in Support of Controversy",
  "url": "https://citizenlab.ca/2025/11/ron-deibert-awarded-sfus-2025-sterling-prize-in-support-of-controversy/",
  "published_at": "2025-11-04T15:11:52+00:00",
  "fetched_at": "2025-11-05T11:15:29.207978+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Citizen Lab director Ron Deibert is the recipient of the 2025 Sterling Prize in Support of Controversy by Simon Fraser University (SFU). The award recognizes his ongoing work at the intersection of global security, digital technologies, and human rights. &nbsp; SFU professor David Zandvliet says, &ldquo;As chair of the Sterling Prize committee, I find his work to be both deeply interesting and courageous.&rdquo; He notes that the work of the Lab, &ldquo;while innately controversial, challenges complacency around the unethical use of consumer technologies while also speaking truth to power.&rdquo; For Deibert, &ldquo;It&rsquo;s always good to get recognition for your work, but especially where it&rsquo;s meant to identify people who are doing things that are provocative,&rdquo; and who &ldquo;speak to powerful actors in an unvarnished way.&rdquo; Read SFU&rsquo;s media release.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Citizen Lab director Ron Deibert is the recipient of the 2025 Sterling Prize in Support of Controversy by Simon Fraser University (SFU). The award recognizes his ongoing work at the intersection of global security, digital technologies, and human rights.\nSFU professor David Zandvliet says, “As chair of the Sterling Prize committee, I find his work to be both deeply interesting and courageous.” He notes that the work of the Lab, “while innately controversial, challenges complacency around the unethical use of consumer technologies while also speaking truth to power.”\nFor Deibert, “It’s always good to get recognition for your work, but especially where it’s meant to identify people who are doing things that are provocative,” and who “speak to powerful actors in an unvarnished way.”",
      "enhanced_at": 1762341478.863827,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:58.864133+00:00Z"
}