{
  "id": "news-the-citizen-lab-citizenlab-org-2025-11-04-6a222ef6",
  "source_id": "news-the-citizen-lab-citizenlab-org",
  "guid": "https://citizenlab.ca/?p=82840",
  "title": "Prison Break – Israeli Disinfo Operations: New Episode on the Iran Podcast",
  "url": "https://citizenlab.ca/2025/11/prison-break-israeli-disinfo-operations-new-episode-on-the-iran-podcast/",
  "published_at": "2025-11-04T14:54:37+00:00",
  "fetched_at": "2025-11-05T11:15:29.208291+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Citizen Lab senior researcher Alberto Fittarelli speaks with Negar Mortazavi, host of The Iran Podcast, about Israel-linked influence operations pushing for regime change in Iran. Fittarelli explains how an artificial network of users on X amplified calls for unrest, sometimes with the aid of AI-generated images and videos. The perpetrators of the operation were &ldquo;trying to fake grassroots support for a campaign that was completely artificial, completely synthetic, and never had any traction in real life,&rdquo; says Fittarelli.&nbsp; Listen to the full episode on Spotify, Apple, or wherever you get your podcasts.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Citizen Lab senior researcher Alberto Fittarelli speaks with Negar Mortazavi, host of The Iran Podcast, about Israel-linked influence operations pushing for regime change in Iran. Fittarelli explains how an artificial network of users on X amplified calls for unrest, sometimes with the aid of AI-generated images and videos.\nThe perpetrators of the operation were “trying to fake grassroots support for a campaign that was completely artificial, completely synthetic, and never had any traction in real life,” says Fittarelli.\nListen to the full episode on Spotify, Apple, or wherever you get your podcasts.",
      "enhanced_at": 1762341486.7682402,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:18:06.768538+00:00Z"
}