{
  "id": "revista-de-ciberseguridad-y-seguridad-de-la-informacin-para-empresas-y-organismos-pblicos-ciberseguridadpyme-es-2025-11-04-d79e8278",
  "source_id": "revista-de-ciberseguridad-y-seguridad-de-la-informacin-para-empresas-y-organismos-pblicos-ciberseguridadpyme-es",
  "guid": "https://www.ciberseguridadpyme.es/?p=6139",
  "title": "Cyber IA Day: Impulsa la Ciberseguridad con Inteligencia Artificial",
  "url": "https://www.ciberseguridadpyme.es/actualidad/cyber-ia-day-un-evento-exclusivo-para-impulsar-la-ciberseguridad-con-inteligencia-artificial/",
  "published_at": "2025-11-04T11:42:46+00:00",
  "fetched_at": "2025-11-05T11:14:48.218432+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Muchas pequeñas y medianas empresas (PYMES) aún enfrentan grandes desafíos para proteger sus activos y datos frente a las amenazas cibernéticas. Con esto en mente, Cyber IA Day surge como una solución innovadora para aprender cómo la inteligencia artificial (IA) puede transformar la forma en que las empresas gestionan su seguridad digital. ¿Qué es Cyber IA Day? Cyber IA Day es un evento presencial diseñado para explorar cómo la inteligencia artificial está revolucionando la ciberseguridad. Este evento reunirá a expertos del sector que compartirán sus conocimientos y experiencias, y presentarán las herramientas más avanzadas para proteger las PYMES de las amenazas cibernéticas de manera eficaz y accesible. El evento se celebrará el 27 de noviembre en el Madrid Innovation Lab (Calle Bravo Murillo 39, Local Interior) a las 10:30h. Agenda del Evento Cyber IA Day ofrecerá una serie de ponencias y una mesa redonda donde los asistentes podrán intercambiar ideas sobre las últimas tendencias en ciberseguridad e inteligencia artificial. Aquí te presentamos la agenda detallada del evento: 10:30 &#8211; 10:40: Presentación del eventoUna breve introducción para dar la bienvenida a los asistentes y explicar el propósito del evento. 10:40 &#8211; 11:00: Ponencia 1 – «Situación actual de las PYMES en términos de ciberseguridad»Un análisis sobre cómo las PYMES están manejando la seguridad digital y los retos que enfrentan actualmente. 11:00 &#8211; 11:20: Ponencia 2 – «TEK IA, democratizando la ciberseguridad»TEK IA, una solución que está haciendo accesible la ciberseguridad avanzada a las PYMES, permitiendo su protección de manera sencilla y asequible. 11:20 &#8211; 12:00: Coffee BreakUn descanso para que los asistentes puedan relajarse, socializar y establecer nuevas conexiones en un ambiente relajado y profesional. 12:00 &#8211; 12:40: Mesa redonda – «Aplicaciones de la IA en Ciberseguridad»Un panel de expertos donde se discutirán las aplicaciones actuales de la IA en la ciberseguridad y cómo las empresas pueden integrar estas tecnologías para mejorar su protección. 12:40 &#8211; 13:00: Ponencia 3 – «Panorama de la seguridad»Ofrecerá una visión completa sobre el estado actual de la ciberseguridad y las tendencias clave que marcarán el futuro de la industria. ¿Cómo asistir? La participación en Cyber IA Day es completamente gratuita, pero es necesario registrarse previamente. Si deseas asistir, asegúrate de reservar tu plaza antes de que se agoten. Puedes hacerlo haciendo clic en el siguiente enlace: Regístrate aquí Únete a Cyber IA Day y lleva la ciberseguridad de tu empresa al siguiente nivel Este evento será una excelente oportunidad para impulsar tu empresa hacia la era de la ciberseguridad inteligente. No te quedes atrás y aprende cómo la inteligencia artificial puede proteger tu negocio de forma automática y eficaz. La entrada Cyber IA Day: Impulsa la Ciberseguridad con Inteligencia Artificial se publicó primero en Revista de Ciberseguridad y Seguridad de la Información para Empresas y Organismos Públicos..",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}