{
  "id": "security-affairs-securityaffairs-co-2025-11-04-b05d2296",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184208",
  "title": "Google fixed a critical remote code execution in Android",
  "url": "https://securityaffairs.com/184208/security/google-fixed-a-critical-remote-code-execution-in-android.html",
  "published_at": "2025-11-04T18:20:18+00:00",
  "fetched_at": "2025-11-05T11:16:21.746149+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Google’s November 2025 Android update fixes two flaws in the System component, including a critical remote code execution issue. Google’s November 2025 Android security updates addressed two vulnerabilities impacting the System component. The fixes are included in the 2025-11-01 security patch level, the only patch level released this month by the IT giant. &#8220;The most severe vulnerability in this section could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.&#8221; reads the bulletin published by Google. The two vulnerabilities are: CVE-2025-48593: an insufficient validation of user input that could lead to remote code execution (RCE). The flaw impacts Android versions 13, 14, 15, and 16. CVE-2025-48581: In VerifyNoOverlapInSessions of apexd.cpp, there is a possible way to block security updates through mainline installations due to a logic error in the code. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. The flaw impacts Android version 16. The company is not aware of attacks in the wild exploiting these vulnerabilities Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, Google)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Google fixed a critical remote code execution in Android\nPierluigi Paganini\nNovember 04, 2025\nGoogle’s November 2025 Android update fixes two flaws in the System component, including a critical remote code execution issue.\nGoogle’s November 2025 Android security updates addressed two vulnerabilities impacting the System component.\nThe fixes are included in the 2025-11-01 security patch level, the only patch level released this month by the IT giant.\n“The most severe vulnerability in this section could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation.” reads the bulletin published by Google.\nThe two vulnerabilities are:\n- CVE-2025-48593: an insufficient validation of user input that could lead to remote code execution (RCE). The flaw impacts Android versions 13, 14, 15, and 16.\n- CVE-2025-48581: In VerifyNoOverlapInSessions of apexd.cpp, there is a possible way to block security updates through mainline installations due to a logic error in the code. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. The flaw impacts Android version 16.\nThe company is not aware of attacks in the wild exploiting these vulnerabilities\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\nPierluigi Paganini\n(SecurityAffairs – hacking, Google)",
      "enhanced_at": 1762341451.2353427,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:31.235685+00:00Z"
}