{
  "id": "the-hacker-news-feeds-feedburner-com-2025-11-04-5d3de445",
  "source_id": "the-hacker-news-feeds-feedburner-com",
  "guid": "https://thehackernews.com/2025/11/europol-and-eurojust-dismantle-600.html",
  "title": "European Authorities Dismantle €600 Million Crypto Fraud Network in Global Sweep",
  "url": "https://thehackernews.com/2025/11/europol-and-eurojust-dismantle-600.html",
  "published_at": "2025-11-04T15:57:00+00:00",
  "fetched_at": "2025-11-05T11:13:26.246258+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Nine people have been arrested in connection with a coordinated law enforcement operation that targeted a cryptocurrency money laundering network that defrauded victims of €600 million (~$688 million). According to a statement released by Eurojust today, the action took place between October 27 and 29 across Cyprus, Spain, and Germany, with the suspects arrested on charges of involvement in",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Nine people have been arrested in connection with a coordinated law enforcement operation that targeted a cryptocurrency money laundering network that defrauded victims of €600 million (~$688 million).\nAccording to a statement released by Eurojust today, the action took place between October 27 and 29 across Cyprus, Spain, and Germany, with the suspects arrested on charges of involvement in money laundering from fraudulent activities.\nIn addition to the arrests of the individuals from their homes, authorities conducted searches that led to the seizure of €800,000 ($918,000) in bank accounts, €415,000 ($476,000) in cryptocurrencies, and €300,000 ($344,000) in cash.\nParticipating nations in the \"synchronized\" effort alongside Eurojust were agencies from France, Belgium, Cyprus, Germany, and Spain.\n\"The members of the network created dozens of fake cryptocurrency investment platforms that looked like legitimate websites and promised high returns,\" Eurojust said. \"They recruited their victims using a variety of methods such as social media advertising, cold calling, fake news articles, and fake testimonials from celebrities or successful investors.\"\nOnce victims invested their funds in the bogus platforms, the crypto assets were laundered using blockchain, netting them about €600 million in illicit revenue.\nEurojust said an investigation into the money laundering and scam network was initiated after victims complained of not being able to recover their investments, eventually culminating in the raids that occurred last week.\nIn tandem, the Paris Prosecutor's Office said in a post on LinkedIn that the probe started in 2023 and that there were \"several hundreds of victims\" in France and across Europe who were lured into deporting their assets in the fake cryptocurrency platforms and promising attractive gains.\nThe disclosure comes as Europol revealed that the criminal use of cryptocurrency and blockchain is becoming increasingly professionalized, sophisticated, and organized, and that countering the \"borderless nature\" of the threat requires a similar response.\n\"Law enforcement, private sector partners, and academia are rapidly advancing their ability to counter the threats posed by sophisticated crypto-related crimes and money laundering,\" the agency said. \"Advanced tools are reducing reliance on manual tracing, while a host of successful cross-border operations show the power of collaboration.\"",
      "enhanced_at": 1762341474.9187124,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:54.919060+00:00Z"
}