{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-04-10e0181f",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/health-privacy-bill-seeks-protections-apps-smartwatches",
  "title": "Health privacy bill seeks protections for data collected by apps, smartwatches",
  "url": "https://therecord.media/health-privacy-bill-seeks-protections-apps-smartwatches",
  "published_at": "2025-11-04T16:25:01+00:00",
  "fetched_at": "2025-11-05T11:15:43.655146+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Sen. Bill Cassidy (R-LA) on Tuesday introduced legislation that would add new privacy protections to health data gathered by smartwatches, health apps and other new technologies.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Health privacy bill seeks protections for data collected by apps, smartwatches\nSen. Bill Cassidy (R-LA) on Tuesday introduced legislation that would add new privacy protections to health data gathered by smartwatches, health apps and other new technologies.\nWhile individuals' interactions with health care providers are typically covered by the Health Insurance Portability and Accountability Act (HIPAA), no such privacy shield applies to health data collected by apps and smartwatches.\nThat gap has been in the spotlight recently following news that a popular period-tracking app, Flo, was selling users’ health data to Meta, which used it to target advertising.\nThe bill, known as the Health Information Privacy Reform Act, would mandate that health technology companies not governed by HIPAA tell consumers how their data is gathered and shared.\n“Smartwatches and health apps change the way people manage their health,” Cassidy said in a prepared statement. “They’re helpful tools, but present new privacy concerns that didn’t exist when it was just a patient and a doctor in an exam room.”\nCassidy, a physician, chairs the Senate Health, Education, Labor, and Pensions (HELP) Committee.\nSuzanne Smalley\nis a reporter covering privacy, disinformation and cybersecurity policy for The Record. She was previously a cybersecurity reporter at CyberScoop and Reuters. Earlier in her career Suzanne covered the Boston Police Department for the Boston Globe and two presidential campaign cycles for Newsweek. She lives in Washington with her husband and three children.",
      "enhanced_at": 1762341468.728326,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:48.728636+00:00Z"
}