{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-04-b834ae7a",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/data-brokers-selling-location-info-tracking-officials",
  "title": "Data brokers selling location info that can be used to track EU officials, report finds",
  "url": "https://therecord.media/data-brokers-selling-location-info-tracking-officials",
  "published_at": "2025-11-04T18:30:32+00:00",
  "fetched_at": "2025-11-05T11:15:43.654327+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A spokesperson for the European Commission told the journalists that officials are “concerned with the trade of geolocation data from citizens and Commission officials.“",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Data brokers selling location info that can be used to track EU officials, report finds\nA group of European reporters said they easily obtained location data for hundreds of European Commission workers using free datasets obtained from brokers, raising questions about the efficacy of Europe’s tough digital privacy laws.\nThe probe, published Tuesday by a coalition of European news outlets, relied on datasets that included about 5,800 location points for 756 devices in Europe’s Parliament. Some 2,000 location “pings” were pulled from 264 devices in European Commission headquarters.\nA spokesperson for the European Commission told the journalists that officials are “concerned with the trade of geolocation data from citizens and Commission officials.“ The body also issued new guidance to its staff about how to disable ad tracking settings on devices and has informed member states’ Computer Security Incident Response Teams (CSIRTs) about the findings, the spokesperson said.\nThe data sample the journalists obtained reportedly also featured location histories for some of the European Commission’s top officials.\nOne “movement profile” obtained showed a European Parliament employee’s daily commute, including stops at a restaurant and supermarket.\nEven though the data samples were far more limited than what a paying customer could access, the reporters were able to find the private addresses of five people who work or have worked for the EU, three of whom are or were in “senior positions.”\nWhile the European Union’s General Data Protection Regulation is the world’s toughest digital privacy law, the continent has been slower to regulate data brokers.\nSuzanne Smalley\nis a reporter covering privacy, disinformation and cybersecurity policy for The Record. She was previously a cybersecurity reporter at CyberScoop and Reuters. Earlier in her career Suzanne covered the Boston Police Department for the Boston Globe and two presidential campaign cycles for Newsweek. She lives in Washington with her husband and three children.",
      "enhanced_at": 1762341446.9113712,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:26.911629+00:00Z"
}