{
  "id": "the-hacker-news-feeds-feedburner-com-2025-11-04-1e0c78ac",
  "source_id": "the-hacker-news-feeds-feedburner-com",
  "guid": "https://thehackernews.com/2025/11/a-cybercrime-merger-like-no-other.html",
  "title": "A Cybercrime Merger Like No Other — Scattered Spider, LAPSUS$, and ShinyHunters Join Forces",
  "url": "https://thehackernews.com/2025/11/a-cybercrime-merger-like-no-other.html",
  "published_at": "2025-11-04T17:25:00+00:00",
  "fetched_at": "2025-11-05T11:13:26.245922+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The nascent collective that combines three prominent cybercrime groups, Scattered Spider, LAPSUS$, and ShinyHunters, has created no less than 16 Telegram channels since August 8, 2025. \"Since its debut, the group's Telegram channels have been removed and recreated at least 16 times under varying iterations of the original name – a recurring cycle reflecting platform moderation and the operators'",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The nascent collective that combines three prominent cybercrime groups, Scattered Spider, LAPSUS$, and ShinyHunters, has created no less than 16 Telegram channels since August 8, 2025.\n\"Since its debut, the group's Telegram channels have been removed and recreated at least 16 times under varying iterations of the original name – a recurring cycle reflecting platform moderation and the operators' determination to sustain this specific type of public presence despite disruption,\" Trustwave SpiderLabs, a LevelBlue company, said in a report shared with The Hacker News.\nScattered LAPSUS$ Hunters (SLH) emerged in early August, launching data extortion attacks against organizations, including those using Salesforce in recent months. Chief among its offerings is an extortion-as-a-service (EaaS) that other affiliates can join to demand a payment from targets in exchange for using the \"brand\" and notoriety of the consolidated entity.\nAll three groups are assessed to be affiliated with a loose-knit and federated cybercriminal enterprise referred to as The Com that's marked by \"fluid collaboration and brand-sharing.\" The threat actors have since exhibited their associations with other adjacent clusters tracked as CryptoChameleon and Crimson Collective.\nTelegram, according to the cybersecurity vendor, continues to be the central place for its members to coordinate and bring visibility to the group's operations, embracing a style akin to hacktivist groups. This serves a fold purpose: turning its channels into a megaphone for the threat actors to disseminate their messaging, as well as market their services.\n\"As activity matured, administrative posts began to include signatures referencing the 'SLH/SLSH Operations Centre,' a self-applied label carrying symbolic weight that projected the image of an organized command structure that lent bureaucratic legitimacy to otherwise fragmented communications,\" Trustwave noted.\n| Observed Telegram channels and activity periods |\nMembers of the group have also used Telegram to accuse Chinese state actors of exploiting vulnerabilities allegedly targeted by them, while simultaneously taking aim at U.S. and U.K. law enforcement agencies. Furthermore, they have been found to invite channel subscribers to participate in pressure campaigns by finding the email addresses of C-suite executives and relentlessly emailing them in return for a minimum payment of $100.\nSome of the known threat clusters part of the crew are listed below, highlighting a cohesive alliance that brings together several semi-autonomous groups within The Com network and their technical capabilities under one umbrella -\n- Shinycorp (aka sp1d3rhunters), who acts as a coordinator and manages brand perception\n- UNC5537 (linked to Snowflake extortion campaign)\n- UNC3944 (associated with Scattered Spider)\n- UNC6040 (linked to recent Salesforce vishing campaign)\nAlso part of the group are identities like Rey and SLSHsupport, who are responsible for sustaining engagement, along with yuka (aka Yukari or Cvsp), who has a history of developing exploits and presents themselves as an initial access broker (IAB).\n| Consolidated administrative and affiliated personas |\nWhile data theft and extortion continue to be Scattered LAPSUS$ Hunters' mainstay, the threat actors have hinted at a custom ransomware family named Sh1nySp1d3r (aka ShinySp1d3r) to rival LockBit and DragonForce, suggesting possible ransomware operations in the future.\nTrustwave has characterized the threat actors as positioned somewhere in the spectrum of financially motivated cybercrime and attention-driven hacktivism, commingling monetary incentives and social validation to fuel their activities.\n\"Through theatrical branding, reputational recycling, cross-platform amplification, and layered identity management, the actors behind SLH have shown a mature grasp of how perception and legitimacy can be weaponized within the cybercriminal ecosystem,\" it added.\n\"Taken together, these behaviors illustrate an operational structure that combines social engineering, exploit development, and narrative warfare – a blend more characteristic of established underground actors than opportunistic newcomers.\"\nCartelization of Another Kind\nThe disclosure comes as Acronis revealed that the threat actors behind DragonForce have unleashed a new malware variant that uses vulnerable drivers such as truesight.sys and rentdrv2.sys (part of BadRentdrv2) to disable security software and terminate protected processes as part of a bring your own vulnerable driver (BYOVD) attack.\nDragonForce, which launched a ransomware cartel earlier this year, has since also partnered with Qilin and LockBit in an attempt to \"facilitate the sharing of techniques, resources, and infrastructure\" and bolster their own individual capabilities.\n\"Affiliates can deploy their own malware while using DragonForce's infrastructure and operating under their own brand,\" Acronis researchers said. \"This lowers the technical barrier and allows both established groups and new actors to run operations without building a full ransomware ecosystem.\"\nThe ransomware group, per the Singapore headquartered company, is aligned with Scattered Spider, with the latter functioning as an affiliate to break into targets of interest through sophisticated social engineering techniques like spear-phishing and vishing, followed by deploying remote access tools like ScreenConnect, AnyDesk, TeamViewer, and Splashtop to conduct extensive reconnaissance prior to dropping DragonForce.\n\"DragonForce used the Conti leaked source code to forge a dark successor crafted to carry its own mark,\" it said. \"While other groups made some changes to the code to give it a different spin, DragonForce kept all functionality unchanged, only adding an encrypted configuration in the executable to get rid of command-line arguments that were used in the original Conti code.\"",
      "enhanced_at": 1762341454.3949084,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:34.395176+00:00Z"
}