{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-04-0ddafd54",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/9-arrested-europe-crypto-platform-takedown",
  "title": "9 arrested in Europe in operation against fake platforms for crypto investments",
  "url": "https://therecord.media/9-arrested-europe-crypto-platform-takedown",
  "published_at": "2025-11-04T17:26:26+00:00",
  "fetched_at": "2025-11-05T11:15:43.654891+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A multinational operation in late October targeted a network that “created dozens of fake cryptocurrency investment platforms that looked like legitimate websites and promised high returns,” but simply took the money and laundered it, Eurojust said.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "9 arrested in Europe in operation against fake platforms for crypto investments\nEuropean authorities said Tuesday that nine people were recently arrested for suspected involvement in a nearly $700 million cryptocurrency investment scam network.\nA multinational operation in late October targeted a network that “created dozens of fake cryptocurrency investment platforms that looked like legitimate websites and promised high returns,” but simply took the money and laundered it, according to the European Union Agency for Criminal Justice Cooperation (Eurojust).\nThe suspects “recruited their victims using a variety of methods such as social media advertising, cold calling, fake news articles and fake testimonials from celebrities or successful investors.”\nThe arrests were in Cyprus, Spain and Germany, with assistance from French and Spanish authorities, Eurojust said.\nThe Paris Prosecutor’s Office said in a social media post that French investigating judges had issued arrest warrants for six of the individuals. JUNALCO, France’s agency for fighting organized crime, referred complaints from victims to other agencies in 2023, the post said.\n“When victims would transfer cryptocurrency to the platforms, they were never able to recover their money,” Eurojust said. “The crypto assets earned through the various scams were then laundered using blockchain technology.”\nAuthorities estimate the network stole at least €600 million (about $690 million). Law enforcement seized €1.5 million ($1.7 million) in cash and cryptocurrency as well as luxury watches worth €100,000 ( $115,000), the Paris Prosecutor’s Office said.\nEurojust reported a similar operation in late September against a network that had scammed people out of at least €100 million (about $115 million).\nJoe Warminsky\nis the news editor for Recorded Future News. He has more than 25 years experience as an editor and writer in the Washington, D.C., area. He previously he helped lead CyberScoop for more than five years. Prior to that, he was a digital editor at WAMU 88.5, the NPR affiliate in Washington, and he spent more than a decade editing coverage of Congress for CQ Roll Call.",
      "enhanced_at": 1762341452.2211452,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:32.221462+00:00Z"
}