{
  "id": "zack-whittaker-author-at-techcrunch-techcrunch-com-2025-11-04-1fdab09b",
  "source_id": "zack-whittaker-author-at-techcrunch-techcrunch-com",
  "guid": "https://techcrunch.com/?p=3064923",
  "title": "Phone location data of top EU officials for sale, report finds",
  "url": "https://techcrunch.com/2025/11/04/phone-location-data-of-top-eu-officials-for-sale-report-finds/",
  "published_at": "2025-11-04T17:19:26+00:00",
  "fetched_at": "2025-11-05T11:15:45.731557+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Journalists in Europe found it was \"easy\" to spy on top European Union officials using commercially obtained location data sold by data brokers, despite the continent having some of the strongest data protection laws in the world.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Journalists in Europe found it was “easy” to spy on top European Union officials using commercially obtained location histories sold by data brokers, despite the continent having some of the strongest data protection laws in the world.\nEU officials said they’re “concerned” about the trade of citizen and officials’ mobile phone location data, and have issued new guidance to staff to counter the tracking, according to a report by Netzpolitik.\nA coalition of reporters obtained the dataset, offered as a free sample from a data broker, containing 278 million location data points from the phones of millions of people around Belgium. Much of the location data is uploaded by ordinary apps installed on a person’s phone, which is sold to data brokers. Those data brokers then sell that data to governments and militaries.\nThe dataset also included the granular location histories of Europe’s top officials, including those who work directly for the European Commission, which has its headquarters in Brussels.\nThe reporters said they were able to identify hundreds of devices belonging to people who work in sensitive areas around the EU, including 2,000 location markers from 264 officials’ devices, and around 5,800 location markers from more than 750 devices in the European Parliament.\nEurope has some of the strongest data protection rules in the world with its GDPR law. However, watchdogs and officials across Europe have been slow to take stronger enforcement action against data brokers, Netzpolitik reported. Data brokering has ballooned to become a billion-dollar industry involving the sale and trade of people’s location data and other private information.\nTo counter some of this location tracking, Apple customers can anonymize their device identifiers, and Android owners can regularly reset their device’s identifier.\nLast year, a data broker called Gravy Analytics had a data breach that exposed the location data belonging to tens of millions of people, including where they have been and where they live and work. Researchers examining the data said the location records could be used to extensively track people’s recent whereabouts.",
      "enhanced_at": 1762341456.3998902,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-05T11:17:36.400199+00:00Z"
}