{
  "id": "bleeping-computer-2025-10-30-9cec1080",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/microsoft/microsoft-promises-more-copilot-features-in-microsoft-365-companion-apps/",
  "title": "Microsoft promises more Copilot features in Microsoft 365 companion apps",
  "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-promises-more-copilot-features-in-microsoft-365-companion-apps/",
  "published_at": "2025-10-30T11:42:03+00:00",
  "fetched_at": "2025-10-30T12:41:41.074318Z",
  "status": "rejected",
  "content": {
    "raw": "Microsoft 365 companion apps will be getting more Copilot features in the coming weeks. [...]",
    "full": "Microsoft 365 companion apps will be getting more Copilot features in the coming weeks.\nRight now, Copilot works only inside two companion apps, People and Files. In the coming weeks, Microsoft plans to add Copilot to the Calendar companion as well.\nFor those unaware, these Microsoft 365 companions are only available for enterprises or businesses. If you've Microsoft 365 Personal, you won't get these mini apps, at least for now.\nWhat are these Microsoft 365 companions?\nWith Microsoft 365 companion apps, you can access your company's workplace right from the taskbar.\nWith one click, you can open 'People.' This companion allows you to find contextual information about people in your organization.\nFor example, if you're in the middle of a Teams meeting and want to find contact details of a friend working in your organization, you can access their details using People from the taskbar.\nThe People mini-app also lets you search contacts within the org and send messages.\nSimilarly, we've File Search, which lets you search for files on your company's OneDrive.\nFinally, third and likely the most popular companion is Calendar, which lets you respond to meeting invites and chats from the taskbar.\nMicrosoft insists that these apps together can help you become productive, especially with Copilot, which is now rolling out.\n\"Copilot in People and Files is available immediately, and Copilot in Calendar will become available soon,\" according to Yash Kamalanath, who is a Principal Product Manager at Microsoft 365.\nMicrosoft says these apps now use Copilot to offer instant suggestions.\n\"For example, you can catch up on the latest from your top collaborators, flag comments that need your input, or recap meetings you missed,\" Microsoft explained in a new blog post.\n\"Start simple with a search in a companion app and seamlessly hand off to the Microsoft 365 Copilot app with full context for more complex inquiries – no extra steps needed.\"\nIt doesn't appear that you can turn off Copilot within these Companion apps, as Microsoft states that these agents have AI to help you get things done \"lightning fast.\"\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-10-30T12:43:30.443943Z"
}