{
  "id": "cyberscoop-2025-10-30-c66c3ccf",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86553",
  "title": "Government watchdog sues DHS over election official’s records",
  "url": "https://cyberscoop.com/nonprofit-sues-dhs-seeking-records-for-election-official/",
  "published_at": "2025-10-30T18:40:37+00:00",
  "fetched_at": "2025-10-31T11:14:06.010781Z",
  "status": "fetched",
  "content": {
    "raw": "A nonprofit government watchdog group is suing the Department of Homeland Security, alleging that department officials have delayed and denied legitimate public information requests regarding&nbsp; the hiring of Heather Honey. Honey was hired by DHS earlier this year and given the title “Deputy Assistant Secretary for Elections Integrity,” a change from past administrations, which have traditionally managed election security and integrity work through the Cybersecurity and Infrastructure Security Agency. The nonprofit, American Oversight, has a history of successfully compelling governments to turn over public records through Freedom of Information Act requests and lawsuits. In September, the group initially sought federal records from DHS and the United States Citizenship and Immigration Services related to Honey’s hiring process, including basic information about the job description and specific hiring and application materials like interview notes, resumes, and cover letters. They also sought Honey’s calendar, email communications, and text messages or chat app records, like those from Slack, that pertain to her hiring. According to American Oversight, those and other public records requests related to Honey’s hiring were acknowledged by DHS, but the department has been otherwise unresponsive over the past two months. On Thursday, the group filed a lawsuit. They allege the government has violated FOIA laws by failing to promptly respond to the requests, including information about “the scope of responsive records Defendants intend to produce or withhold and the reasons for any withholdings.” “Through Defendants’ failure to respond to American Oversight’s FOIA requests within the time period required by law, American Oversight has constructively exhausted its administrative remedies and seeks immediate judicial review,” the complaint states. The group is seeking a court compelling DHS to search for and produce the records within 20 days, while also asking that the department pay for the nonprofit’s legal costs. Honey has a long and established record of coordinating with the Trump campaign in 2020 to push false and unproven claims that rampant voter fraud was responsible for his loss to Democrat Joe Biden. She is also closely connected to the broader “election denial” movement that began among conservative activists in 2020 and has continued to influence state and national policy debates over voting and elections policies. She previously served as executive director of the Election Research Institute and played a leadership role with other groups like PA Fair Elections and Verity Vote that sought to overturn statewide electoral college results in Pennsylvania, which Biden won by approximately 70,000 votes. Honey was also at the forefront of efforts to persuade states to stop relying on the information from the Electronic Registration Information Center used to identify registered voters across state lines, pushing for use of alternative technologies like EagleAI, which tech and election experts say is more likely to return inflated numbers around “potential” registration issues that often do not turn out to be fraudulent. Last month, Avani Singh and Derek Tisler of the Brennan Center for Justice noted that Honey’s record of challenging election results in Pennsylvania, Georgia and Arizona is rife with instances of cherry picked data and misrepresentation, such as when she falsely claimed that Pennsylvania had tabulated more ballots than there were registered state voters in 2020. “Journalists, election officials, and other experts who have scrutinized her work have found a consistent pattern of misusing data to fit predetermined narratives,” Singh and Tisler wrote.&nbsp; PA Fair Elections is listed as a partner of the Election Integrity Network, a national organization run by conservative lawyer Cleta Mitchell that was closely tied to the Trump campaign&#8217;s efforts to manipulate state tabulation and certification procedures in 2020. Mitchell was reportedly present on a call Trump made in 2020 attempting to pressure Georgia Republican Secretary of State Brad Raffensperger to “find” enough supposedly fraudulent votes to overturn Trump’s deficit in the state. Mitchell this year has advised DHS on its push to transform the Systemic Alien Verification for Entitlements (SAVE) database into a citizenship verification tool that would allow states to run bulk searches for voters with possible proof of citizenship or registration issues, according to Democracy Docket. Honey and Mitchell are not the only activists claiming mass fraud who are now in top leadership positions within government. The White House recently hired Kurt Olsen, who led efforts to challenge Biden’s win in Texas, as a “special government employee” to investigate the 2020 election. President Trump has also said that FBI Director Kash Patel and Director of National Intelligence Tulsi Gabbard will be heavily involved in the administration’s broader push to gain more influence over state and local election procedures. DHS did not respond to CyberScoop&#8217;s request for comment as of this article&#8217;s publication. The post Government watchdog sues DHS over election official’s records appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}