{
  "id": "cyberscoop-2025-10-30-5218abfb",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86570",
  "title": "Cyber scholarship-for-service students say government has pulled rug on them, potentially burdening them with debt",
  "url": "https://cyberscoop.com/cyber-scholarship-for-service-students-say-government-has-pulled-rug-on-them-potentially-burdening-them-with-debt/",
  "published_at": "2025-10-30T21:57:58+00:00",
  "fetched_at": "2025-10-31T11:14:06.010599Z",
  "status": "fetched",
  "content": {
    "raw": "A landmark program that offers scholarships in exchange for federal service is threatening to saddle students with hundreds of thousands of dollars worth of debt amid hiring freezes and budget cuts, raising questions about the future of an initiative proponents say has helped close the government’s cyber workforce gap. Some CyberCorps: Scholarship for Service participants have had federal agency job and internship offers rescinded this year due to cutbacks and freezes. It’s a condition of their scholarship contract that they must work for the government: Those who can&#8217;t find employment there will see their grants, often reaching six-figure sums, converted into loans after 18 months. Numerous participants who spoke to CyberScoop said they regret signing up for the program, and wouldn’t have done so if they knew then what they know now about the government fulfilling its side of the bargain. They also criticized the communication from the agencies overseeing the program, saying it has been difficult to get clear information about how to fulfill their service obligations or receive updates about job fairs connected to the program. Additionally, they expressed frustration over being told to “get creative” in their job searches, as one email suggested. One participant said that if CyberCorps can’t meet its obligations due to the federal personnel reductions, it should consider ending the program. The Trump administration has proposed cutting funding for it by 65% in fiscal 2026. And policy experts who have worked to build up the program are fearful about what the current woes mean for future participants. “I feel like I&#8217;ve put my future in jeopardy, my entire future, and I’ve risked lifelong debt because of the whims of someone else,” said a master’s degree student who got a scholarship through CyberCorps. “Whenever my school has brought on a new cohort of students, I cringe at the thought of it, because it&#8217;s just more people who are dancing with lifelong debt and possibly no careers.” While past federal government shutdowns have thrown temporary wrenches into CyberCorps participants’ job hunts, the current environment for federal jobseekers appears to present more enduring challenges.&nbsp; “It wasn&#8217;t really a concern that people would be able to land [a job] and pay back their debt to the government through time and service,” said Nick Leiserson, senior vice president for policy at the Institute for Security and Technology think tank, and a former Hill aide whose boss, then-Rep. Jim Langevin, D-R.I., was a big supporter of CyberCorps. “And now that has been shaken, and I don&#8217;t know how you get that trust back.” Mississippi Rep. Bennie Thompson, the top Democrat on the House Homeland Security Committee, was critical of the potentially lengthy impact on the CyberCorps program. “It’s a bait-and-switch where everyone loses, and it will frustrate future efforts to recruit cyber talent into the government,” he said. “The consequences will be felt for decades.” CyberCorps’ track record CyberCorps sprang into existence in 2000 in response to a 1998 presidential directive. Since then, the program has had between 4,000 and 5,000 participants, said Mark Montgomery, who worked on the legislation that formalized the program’s creation. The National Science Foundation and Office of Personnel Management jointly operate the program. OPM didn’t respond to questions for this story, while an email from NSF said the agency wouldn’t be responding to messages during the current government shutdown. Graduates must get at least one internship with, and then work in the federal government for a period of time equal to the length of their scholarship, although a relatively small percentage are permitted to seek positions in state or local government. (Participants say cyber jobs have been just as few and far between there.) In addition to the scholarships, students also receive stipends. The internships give students and agencies a chance to determine whether they want to keep working together, and their security clearances are processed ahead of time. “That produces tailored, ready cyber warriors for the federal government,” said Montgomery, now senior director of the Center on Cyber and Technology Innovation at the Foundation for Defense of Democracies think tank. It also gives the federal government a talent pipeline it wouldn’t otherwise have, Leiserson said. While some of the participants CyberScoop spoke to said they had already aspired to government service, some said it wasn’t on their radar prior to signing up for CyberCorps, which they viewed instead as a means to an end: paying for their education. There have been relatively few criticisms of CyberCorps or how it’s administered. Henry Young, senior director of policy for the Business Software Alliance, said he viewed CyberCorps more as a relatively small piece of the workforce development pie that needs to include more K-12 education, a focus on other federal programs and more coordination with industry. There are an estimated 500,000 cyber jobs open in the United States. “It&#8217;s a well-meaning and reasonable effort to try and recruit more cybersecurity workers to federal, state and local governments,” Young said. “And I think it is probably working, but not really at the scale of the challenge.” Student experiences In response to the current administration’s workforce policies, a group of students have informally organized to seek solutions to their looming debt dilemma; an organizer said there were more than 200 who had joined forces. They say they’ve been frustrated to date in their lobbying to agencies and lawmakers. CyberScoop granted several current participants anonymity to speak about their experiences because they fear potential retaliation as they continue seeking employment. Some of them are creeping up on the 18-month deadline. One had a job offer rescinded this spring. Another had an internship offer pulled. Past participants received regular communications about openings that were more prolific in prior years, emails show. A recurring theme among current participants CyberScoop spoke with is criticism of what they see as a lack of assistance or even communication about activities that were once common, like job fairs. For example, they were told to expect a job fair in October to replace the annual January event that was canceled, but the October fair never took place. Participants say that even when job fairs have been held, they have not been as helpful as in the past, despite attending multiple fairs. A September job fair that participants were “strongly encouraged” to participate in included agencies that didn’t have any roles to fill, and for the others, “the majority of the roles offered were not aligned with cybersecurity, and were not qualified as roles that would count towards our SFS work obligation period,” one program participant wrote. In-person fairs converted to virtual fairs are a bad option, some said. One said they waited stuck in a queue at a virtual fair for hours only to be told the agency had no openings.&nbsp; At the same time, participants have bristled at emails like one in July that urged students to “Get creative in your search!” Some of the participants were interested in cybersecurity because they were drawn to the technical aspects of working with computers. Others said they felt compelled to join by a desire to do good in the world and protect others. Some were attracted to government work specifically. That’s made the current situation a deflating experience, one said. “I am less optimistic about working for the government now than I was before,” a participant said. “It&#8217;s just the way they&#8217;re treating their employees. It kind of feels like I&#8217;m walking into a trap, like they want to fire me more than they want to hire me right now.” What can be done There are few alternatives available to CyberCorps participants who aren’t able to find federal employment. They could pursue additional degrees, like a Ph.D, but that doesn’t relieve them of their obligation — it just pushes it back. One participant CyberScoop spoke to was able to get a “research exception” that allows them to study a topic at their school in lieu of the obligation. Going into the military — potentially for a lengthy term of service — could give students an option to repay the loans, but that’s not an option that anyone who CyberScoop spoke to wanted to pursue. “We have already experienced federal priorities being ‘shifted’ — multiple of my peers report being forced to transition into immigration work during Summer internships and co-ops, when that was not in the original scope of their work,” one wrote. One participant struggled with the notion of pursuing a private-sector job, which would potentially offer higher wages that would pay off a loan. But in addition to worrying about fierce competition for those roles, they felt pangs of guilt about the idea of accepting such a role after agreeing to work for the government, and whether it would cause blowback on their university. Some participants had ideas about how to solve the current dilemma. They suggested things like waiving the payback requirement for students who simply couldn’t fill job openings (they’re competing with each other for those jobs, as well as competing with more seasoned jobseekers); making it a condition of the program that if a scholarship is offered, a job exists for a participant to fill; or simply retiring the program. Montgomery said Congress could appropriate money for the program beyond what the Trump White House’s fiscal 2026 budget sought. And there’s the possibility that jobs cut as part of the early 2025 Department of Government Efficiency reductions could be reversed. “I can&#8217;t guarantee it, but I think the excesses of DOGE will be walked back,” he said. Thompson called on the Trump administration to act. “The Trump administration keeps pretending that cybersecurity is a top priority, but everything they do tells us that it’s a lie,” he said. “Actions matter more than words, and if this Administration wants us to believe they care about cybersecurity, they should act to get CyberCorps back on track.” The post Cyber scholarship-for-service students say government has pulled rug on them, potentially burdening them with debt appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}