{
  "id": "news-the-citizen-lab-citizenlab-org-2025-10-30-826f9206",
  "source_id": "news-the-citizen-lab-citizenlab-org",
  "guid": "https://citizenlab.ca/?p=82827",
  "title": "Submission to the Standing Committee on Public Safety and National Security of Bill C-8",
  "url": "https://citizenlab.ca/2025/10/submission-to-the-standing-committee-on-public-safety-and-national-security-of-bill-c-8/",
  "published_at": "2025-10-30T15:00:30+00:00",
  "fetched_at": "2025-10-31T11:14:37.886746Z",
  "status": "fetched",
  "content": {
    "raw": "Canada&rsquo;s Bill C-8 (formerly Bill C-26) is proposed cybersecurity legislation that would introduce broad information collection and sharing powers, including the warrantless collection of information from telecommunication providers, and could also undermine encryption and communications security. In a brief submitted by the Citizen Lab to the Standing Committee on Public Safety and National Security (SECU) of Bill C-8, senior research associate Kate Robertson sets out targeted recommendations to respond to constitutional deficits in the bill that were not addressed during the study and amendment of Bill C-26. According to Robertson, &ldquo;addressing the warrantless nature of this collection power should be this committee&rsquo;s priority in studying the legislation.&rdquo; Adding that Bill C-8 also &ldquo;needs to be amended to make certain and clarify that its orders cannot be issued to compromise the security of Canada&rsquo;s communication networks.&rdquo; On November 4, 2025, Robertson will testify on Bill C-8 in the House of Commons&rsquo; SECU Committee Meeting. Read the Citizen Lab&rsquo;s submission. Read related coverage in The Hill Times: &ldquo;Bill aimed at protecting telecom infrastructure against cyberattacks strikes at privacy rights, say civil society groups&ldquo;",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}