{
  "id": "revista-de-ciberseguridad-y-seguridad-de-la-informacin-para-empresas-y-organismos-pblicos-ciberseguridadpyme-es-2025-10-30-daa78ecc",
  "source_id": "revista-de-ciberseguridad-y-seguridad-de-la-informacin-para-empresas-y-organismos-pblicos-ciberseguridadpyme-es",
  "guid": "https://www.ciberseguridadpyme.es/?p=6115",
  "title": "¡No te pierdas Cyber IA Day!",
  "url": "https://www.ciberseguridadpyme.es/actualidad/ataques-y-amenazas/no-te-pierdas-cyber-ia-day-transformando-la-ciberseguridad-con-inteligencia-artificial/",
  "published_at": "2025-10-30T16:48:14+00:00",
  "fetched_at": "2025-10-31T11:13:55.503668Z",
  "status": "fetched",
  "content": {
    "raw": "La ciberseguridad es un tema crucial para las medianas empresas que buscan proteger sus activos y datos. Por eso, te invitamos a Cyber IA Day, un evento exclusivo que reunirá a expertos y profesionales del sector para abordar cómo la inteligencia artificial (IA) está transformando la ciberseguridad. Detalles del Evento Fecha: 27 de noviembre de 2025Ubicación: Madrid Innovation Lab (Calle Bravo Murillo 39, Local Interior)Hora: El evento comenzará a las 10:30 AM, ¡pero te recomendamos llegar unos minutos antes! El evento está diseñado para ser una experiencia completa, combinando ponencias, networking y momentos para relajarse y socializar. Si estás interesado en conocer las últimas tendencias en IA aplicada a la ciberseguridad, Cyber IA Day es una cita que no puedes dejar pasar. Agenda del Evento El evento comenzará con una breve presentación introductoria de 10 minutos, seguida de una serie de ponencias y actividades que te brindarán un conocimiento profundo sobre cómo TEK IA está democratizando la ciberseguridad para las PYMES. Aquí te dejamos el detalle de la agenda: 10:40 &#8211; 11:00: Ponencia 1 – «Situación actual de las PYMES en términos de ciberseguridad»Se hablará sobre los retos actuales que enfrentan las PYMES en términos de ciberseguridad, cómo gestionan los riesgos y las mejores prácticas para mejorar su seguridad. 11:00 &#8211; 11:20: Ponencia 2 – Ástor – «TEK IA, democratizando la ciberseguridad»TEK IA, una innovadora solución que está haciendo accesible la ciberseguridad a las pequeñas y medianas empresas. Con esta herramienta, las PYMES pueden protegerse sin grandes inversiones ni equipos técnicos complejos. 11:20 &#8211; 12:00: Coffee BreakUna pausa perfecta para relajarse, disfrutar de un buen café y aprovechar el tiempo de networking. Durante este tiempo, los asistentes podrán socializar, compartir experiencias y establecer contactos clave en el sector de la ciberseguridad. 12:00 &#8211; 12:40: Mesa redonda – «Aplicaciones de la IA en Ciberseguridad»En esta mesa redonda, expertos discutirán cómo la IA está revolucionando la forma de detectar amenazas, prevenir ataques y proteger a las empresas. Es una excelente oportunidad para aprender sobre el futuro de la ciberseguridad inteligente. 12:40 &#8211; 13:00: Ponencia 3 – «Panorama de la seguridad»Una ponencia sobre el panorama actual de la seguridad y las tendencias que dominarán el campo de la ciberseguridad en los próximos años. Una charla imprescindible para entender cómo las empresas pueden anticiparse a las amenazas. ¿Por qué asistir a Cyber IA Day? Cyber IA Day es mucho más que un evento: es una oportunidad única para aprender, conectar y explorar las últimas innovaciones en ciberseguridad y inteligencia artificial. Si eres responsable de IT, gerente de ciberseguridad o simplemente te interesa conocer más sobre cómo proteger tu empresa, este evento está hecho a medida para ti. Además, habrá un momento clave para el networking durante el coffee break, que te permitirá conocer a otros profesionales y compartir conocimientos sobre cómo mejorar la ciberseguridad en las PYMES. ¡No olvides registrarte! Para participar en Cyber IA Day, es necesario inscribirse previamente. No pierdas tu plaza y regístrate ahora haciendo clic en el siguiente enlace: Regístrate aquí ¡Te esperamos en Cyber IA Day! La entrada ¡No te pierdas Cyber IA Day! se publicó primero en Revista de Ciberseguridad y Seguridad de la Información para Empresas y Organismos Públicos..",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}