{
  "id": "bleeping-computer-2025-11-03-e2d99406",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/security/us-cybersecurity-experts-indicted-for-blackcat-ransomware-attacks/",
  "title": "US cybersecurity experts indicted for BlackCat ransomware attacks",
  "url": "https://www.bleepingcomputer.com/news/security/us-cybersecurity-experts-indicted-for-blackcat-ransomware-attacks/",
  "published_at": "2025-11-03T17:15:39+00:00",
  "fetched_at": "2025-11-04T12:47:22.164344+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Three former employees of cybersecurity incident response companies DigitalMint and Sygnia have been indicted for allegedly hacking the networks of five U.S. companies in BlackCat (ALPHV) ransomware attacks between May 2023 and November 2023. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Three former employees of cybersecurity incident response companies DigitalMint and Sygnia have been indicted for allegedly hacking the networks of five U.S. companies in BlackCat (ALPHV) ransomware attacks between May 2023 and November 2023.\n28-year-old Kevin Tyler Martin of Roanoke, Texas (who pleaded not guilty), 33-year-old Ryan Clifford Goldberg of Watkinsville, Georgia (in federal custody since September 2023), and an unnamed accomplice face charges of conspiracy to interfere with interstate commerce by extortion, interference with interstate commerce by extortion, and intentional damage to protected computers.\nIf convicted, the defendants could face a maximum penalty of up to 50 years in prison: 20 years for each extortion charge and an additional 10 years for damage to computer systems.\nAccording to the Chicago Sun-Times, which first spotted the unsealed court documents, Martin worked at DigitalMint as a ransomware threat negotiator (just as the unnamed co-conspirator), while Goldberg is a former Sygnia incident response manager.\nThe Department of Justice claims the defendants operated as ALPHV BlackCat affiliates, gaining unauthorized access to the victims' networks, stealing data, deploying encryption malware, and demanding cryptocurrency payments in exchange for decryption keys and promises not to leak the stolen information online.\nPer the indictment, the group's alleged victims include a Tampa medical device manufacturer, a Maryland pharmaceutical company, a California doctor's office, a California engineering firm, and a Virginia drone manufacturer.\nProsecutors said the attackers have demanded ransoms ranging from $300,000 to $10 million. Still, they were only paid $1.27 million by the Tampa medical device company after they encrypted its servers and demanded $10 million in May 2023. Although other victims also received ransom demands, the indictment does not indicate whether additional payments were made.\nAs BleepingComputer previously reported, the Department of Justice was investigating a former DigitalMint ransomware negotiator for allegedly working with ransomware gangs to profit from extortion payment deals. The DOJ and the FBI declined to comment when contacted at the time for more information. It is unclear if this indictment is related to the DOJ's previous investigation.\nA 2019 ProPublica report revealed that some U.S. data recovery firms have also secretly paid ransomware gangs while charging clients for restoration services without disclosing these payments.\nIn a February 2024 joint advisory, the FBI, CISA, and the Department of Health and Human Services (HHS) warned that Blackcat ransomware affiliates were primarily targeting organizations in the U.S. healthcare sector.\nThe FBI has also linked BlackCat to over 60 breaches between November 2021 and March 2022 (the ransomware group's first four months of activity) and said they raked in at least $300 million in ransoms from more than 1,000 victims until September 2023.\nSecrets Security Cheat Sheet: From Sprawl to Control\nWhether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start.\nGet the cheat sheet and take the guesswork out of secrets management.",
      "enhanced_at": 1762260783.691725,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:53:03.691994+00:00Z"
}