{
  "id": "bleeping-computer-2025-11-03-e317b509",
  "source_id": "bleeping-computer",
  "guid": "https://www.bleepingcomputer.com/news/cryptocurrency/hacker-steals-over-120-million-from-balancer-defi-crypto-protocol/",
  "title": "Hacker steals over $120 million from Balancer DeFi crypto protocol",
  "url": "https://www.bleepingcomputer.com/news/cryptocurrency/hacker-steals-over-120-million-from-balancer-defi-crypto-protocol/",
  "published_at": "2025-11-03T21:53:35+00:00",
  "fetched_at": "2025-11-04T12:47:22.163533+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Balancer Protocol announced that hackers had targeted its v2 pools, with losses reportedly estimated to be more than $128 million. [...]",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "The Balancer Protocol announced that hackers had targeted its v2 pools, with losses reportedly estimated to be more than $128 million.\nBalancer is a decentralized finance (DeFi) protocol built on the Ethereum blockchain as an automated market maker and liquidity infrastructure layer.\nIt provides flexible pools with custom token mixes, allowing users to deposit assets, earn fees, and let traders swap assets, and it is governed by the BAL token, which had a market cap of $65 million right before the incident.\nBalancer has not shared many details about the incident but warned users to be cautious against potential scams or phishing attempts.\nBalancer confirmed today that an exploit affected its V2 Compostable Stable Pools at 7:48 AM UTC and that the issue does not impact any other Balancer pools, including V3.\n\"Our team is working with leading security researchers to understand the issue,\" the company said in an update a few hours ago.\nAccording to GoPlus Security, the Balancer V2 exploit stemmed from a precision rounding error in the Vault’s swap calculations.\nEach swap operation rounded down token amounts, creating tiny discrepancies that the attacker could repeatedly exploit. By chaining multiple swaps through the batchSwap function, those rounding losses compounded into a large price distortion.\nHowever, other users claiming to know what happened attribute the hack to improper authorization and callback handling inside Balancer’s V2 vaults.\nAccording to Aditya Bajaj, a maliciously deployed contract manipulated vault calls during pool initialization, effectively bypassing safeguards and enabling unauthorized swaps and balance manipulations across interconnected pools.\nWhile there is no agreement on the attack method yet, Balancer promised to share more details about the hack \"and a full post-mortem as soon as possible.\"\nIt is worth noting that Balancer V2 has been audited 11 times since 2021, with varying examination scopes.\nAttempt to trick the hacker\nMeanwhile, it appears that someone tried to take advantage of the situation by impersonating Balancer and offering the hacker a \"white-hat bounty\" of 20% of the stolen amount if they agreed to return the rest of the funds to a specific address.\nThe phishing message is well-written and checks the tricks to appear credible, including the reward, a deadline, and a threat, all part of a negotiation pressing for immediate cooperation.\nIf the hacker refuses the deal, the fraudster impersonating Balancer threatens to use all information they have from blockchain forensics experts, law enforcement agencies, and regulatory partners to identify and prosecute the attacker.\n“Our partners have a high degree of confidence you will be identified from access-log metadata collected by our infrastructure, indicating connections from a defined set of IP addresses/ASNs and associated ingress timestamps that correlate with the transaction activity on chain,” concludes the fraudulent message.\nThe Balancer hack is one of the largest cryptocurrency heists in 2025. Although there is no attribution, the greatest threat to DeFi entities is North Korean hackers.\nAs of October 3, the amount of cryptocurrency linked to North Korean thefts this year had exceeded $2 billion, with the largest by far being the Bybit attack in February, when they stole $1.5 billion in cryptocurrency.\nSecrets Security Cheat Sheet: From Sprawl to Control\nWhether you're cleaning up old keys or setting guardrails for AI-generated code, this guide helps your team build securely from the start.\nGet the cheat sheet and take the guesswork out of secrets management.",
      "enhanced_at": 1762260692.2574,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:32.257750+00:00Z"
}