{
  "id": "blog-cybereason-com-2025-11-03-9943636f",
  "source_id": "blog-cybereason-com",
  "guid": "https://www.cybereason.com/blog/tycoon-phishing-kit-analysis",
  "title": "Tycoon 2FA Phishing Kit Analysis",
  "url": "https://www.cybereason.com/blog/tycoon-phishing-kit-analysis",
  "published_at": "2025-11-03T17:42:04+00:00",
  "fetched_at": "2025-11-04T12:50:34.456415+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Tycoon 2FA phishing kit is a sophisticated Phishing-as-a-Service (PhaaS) platform that emerged in August 2023, designed to bypass two-factor authentication (2FA) and multi-factor authentication (MFA) protections, primarily targeting Microsoft 365 and Gmail accounts. Utilizing an Adversary-in-the-Middle (AiTM) approach, it employs a reverse proxy server to host deceptive phishing pages that mimic legitimate login interfaces, capturing user credentials and session cookies in real-time. According to the Any.run malware trends tracker, Tycoon 2FA leads with over 64,000 reported incidents this year.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Deceptive Signatures: Advanced Techniques in BEC Attacks\nThe Cybereason DFIR team has observed threat actors leveraging email signatures to enhance their phishing lures. Read about their full discovery into the tactic.\nCybereason Security Services Team\nThe Tycoon 2FA phishing kit is a sophisticated Phishing-as-a-Service (PhaaS) platform that emerged in August 2023, designed to bypass two-factor authentication (2FA) and multi-factor authentication (MFA) protections, primarily targeting Microsoft 365 and Gmail accounts. Utilizing an Adversary-in-the-Middle (AiTM) approach, it employs a reverse proxy server to host deceptive phishing pages that mimic legitimate login interfaces, capturing user credentials and session cookies in real-time. According to the Any.run malware trends tracker, Tycoon 2FA leads with over 64,000 reported incidents this year.\nThis allows attackers to steal authentication (2FA) codes and gain access to a victim’s account, even if 2FA is enabled.\nThe Tycoon 2FA campaign specifically targets:\nThe phishing links associated with the Tycoon 2FA campaign are distributed through a variety of methods designed to trick unsuspecting users. Attackers share these links using:\nPDF documents\nSVG Files\nMalicious Website\nPowerPoint (PPT) Presentations\nEmails\nAmazon S3 Storage\nThe Tycoon threat actors are using Amazon S3 buckets to host the malicious fake login page.\nhttps://click.mailchimp.com/track/click/30010842/s3.ap-northeast-3.=amazonaws.com?p=3DeyJzIjoiUUhxQS1jMmJmNW9QeS1lNUFZT2RMeVE4WlJjIiwidiI6Miwic=CI6IntcInVcIjozMDAxMDg0MixcInZcIjoyLFwidXJsXCI6XCJodHRwczpcXFwvXFxcL3MzLmFw=LW5vcnRoZWFzdC0zLmFtYXpvbmF3cy5jb21cXFwvYmFzc2V0dGhvdXNlaW5uLmNvbVxcXC9pbmR=leC5odG1sXCIsXCJpZFwiOlwiZTFjOTg0N2U5YzM1NDc0NjhhZGIyYTAxMGNhZWQxNGZcIixcIn=VybF9pZHNcIjpbXCJhMTlmMmI4NzE3MjNjNGU4YTFmYjU2Mjc2OTY2NDE3ZTQzYTkzNWYyXCJdL=FwibXNnX3RzXCI6MTc1NDkxMTMzM30ifQ\"\nCanva and Dropbox\nThese pre-redirection checks are a key part of the phishing kit’s defense against detection. They include:\nThe Tycoon 2FA phishing kit utilizes boilerplate templates to dynamically generate a fake login page based on responses from Microsoft’s servers. One of these templates prompts users to input their multi-factor authentication (MFA) code, which is then relayed to Microsoft’s servers in real-time, effectively bypassing this critical security step.\nA particularly advanced feature of the Tycoon 2FA campaign is its ability to understand an organization’s specific security policies. By analyzing error messages from the login process, the phishing kit can tailor its attacks to create highly targeted campaigns, increasing its chances of successfully stealing credentials.\nBot Check\nThe Tycoon 2FA attack begins with a CAPTCHA check to filter out automated bots. This is a key step in ensuring that the campaign only targets real people.\nFirst Stage (Email Extraction)\nThe initial HTML page includes a JavaScript file with a base64-encoded payload. This payload is compressed using the LZ-string algorithm. The script then uses the LZ-string library to decompress and execute the hidden payload.\nJavaScript 1 (Domain Check)\nThe second stage of the attack uses a technique called DOM Vanishing Act to evade detection. The malicious JavaScript code removes itself from the Document Object Model (DOM) but the JavaScript is executed in the memory after leaving no visible trace for security tools that inspect the page’s code.\nThe malicious script contains three different base64-encoded payloads, each of which is designed to run under a specific condition.\nPayload 1\nThis payload is obfuscated using an XOR cipher. Once deobfuscated, it drops the second-stage payload script. This payload is executed only if a specific condition is met: the window.location.pathname.split must contain an exclamation mark (!) or a dollar sign ($). This check likely enables the attacker to confirm that the user was redirected via the intended malicious document or link, rather than an automated security scanner. The string following a dollar sign ($) represents a victim’s email address encoded in base64.\nSample URL: https://qaok5hty3.vraudo.es/ITITRt408hJWgm!5Cj/$ZmhhZ2tZWllckBwdGMuY29t\nPayload 2 & 3\nIf the above condition is not met, it loads the following error page.\nJavaScript 2 – Email Extraction\nWhen the script detects that a debugger is active, it redirects the user to https://google.com by replacing the window.location variable.\nIf a debugger is not detected, the script retrieves the current URL using the window.location property to check for an embedded email address.\nThe script performs the following actions to extract and transmit data:\nurl: “/zcYbH5gqRHbzSQXiK8YtTbhpNSGtkZc6xbMyRBGazbWU8fjfq”,\nThe C2 server’s response contains the next-stage payload, which is encrypted using the AES algorithm and the CryptoJS library. The script then decrypts and loads the payload to continue the attack.\nSecond Stage (Debugger check & Bot Check)\nThe script is composed of two main parts, both designed to evade detection and deliver the final payload.\nEvasion and Redirection\nThe first part of the script is heavily obfuscated using base64 encoding and CryptoJS encryption. When this code is deobfuscated, it performs a crucial debugger check. If a debugger is detected, the script immediately redirects the user to a benign website, such as https://www.target.com, by using window.location.replace. This first script is executed using a global Windows object.\nDecrypting the Payload\nIf no debugger is found, the second part of the script is executed. Similar to the first, this script is also obfuscated, but it uses a combination of base64 encoding, concatenation, and CryptoJS encryption. Once decrypted, this code is responsible for decrypting and launching the next stage of the attack—the final payload. Like the first script, this part is also loaded and executed through a global Windows object.\nBot Check Payload\nThe next stage of the attack is a bot check designed to weed out automated scanners and security tools.The next stage of the attack is a bot check designed to weed out automated scanners and security tools.\nIf a bot is detected, it will immediately try to connect to a specific, hardcoded URI. (‘https://egk1w.onkttyhqjycn.es/sunel$bqtaxtc’).The script then redirects the user to https://www.target.com using window.location.replace, parameter.\nIf no bot is detected, the script uses a setTimeout function to pause for 150 milliseconds before attempting a connection. The script proceeds with the next step, sending a POST request with form data to the attacker’s endpoint (“../eypkDtn5lPJjyOMUrofhYfQwPk9fbGCAjUgZztc9dMlLdgv”;).\nThird Stage\nJavaScript Payload 1\nThe script contains the two different base64 payload and Microsoft O365 graphics code.\nMicrosoft O365 login graphics code\nThe first payload is the Microsoft O365 login graphics code. This is responsible for creating a realistic-looking Microsoft login page, which tricks the user into entering their credentials.\nDebugger Check\nThe second payload checks for the presence of a debugger.\nEncrypted JavaScript Payload\nThe third payload is a CryptoJS-encrypted payload. Once decrypted, this payload loads the next stage JavaScript payload.\nJavaScript Payload 2\nThe script contains the two different base64 payload:\nHTML Payload 3\nThe script contains a dual-purpose component that includes both a debugger check and a Boilerplate template code.\nHow the Attack Unfolds\nWhen a victim enters their credentials into the fake login page, the attacker immediately receives this information. Acting as a man-in-the-middle, the attacker uses these stolen credentials to send a new login request to the legitimate Microsoft server.\nThe website that the victim sees is then dynamically updated based on the response from the Microsoft server. The webpage is dynamically updated using the following webparts.\nBased on the error messages received from the login process, the attacker can reverse-engineer an organization’s specific email configurations. This allows them to create more effective, targeted phishing campaigns.\nFinal JavaScript Payload\nThe malicious JavaScript code executes a series of actions to gather user data, transmit it to an attacker, and then serve a dynamic phishing page.\nData Collection and Transmission\nThe script first gathers information from the user’s browser:\nThis collected data—including the user’s geolocation and user agent—is then encrypted using CryptoJS with a hardcoded key and IV (1234567890123456). The encrypted data is converted to a binary format and sent to an attacker’s endpoint via an AJAX POST request.( /tdwsch3h8IoKcUOkog9d14CkjDcaR0ZrKSA95UaVbbMPZdxe)\nOnce a user enters their credentials, the script tracks their actions based on the request type: checkemail, checkpass, twofaselect, or twofaselected.\nTo identify the user’s choice, a unique, randomized pattern is generated for each action:\n‘https[:]//3eJBE8eo5f13oigGmQkDKhEkKNK9c2TlnVZPVRc16Hnhi0G4kxTsXEf2gH[.]jgcrrouu[.]es/sZzqqvSHaFLRSRFbpIgHEzUhFBimCQAHTCPYNKQFZGMAFYFZUSEVATEOXHQKEXAQDWFXJOAYHETC‘\nThe attacker, acting as a middleman, submits the stolen credentials to the Microsoft server. Based on the server’s response (e.g., successful login, incorrect password, or MFA required), the attacker’s server sends back an encrypted payload. The victim’s browser then decrypts this response and loads the appropriate webpage template. This makes the phishing attempt appear seamless and highly convincing, as the page’s behavior mimics a genuine login process.\nDebugger Check\nThe script first performs a user agent check to see if the browser is being controlled by an automated tool, PhantomJS or Burp Suite. If any of these are detected, the script immediately loads a blank page to prevent further analysis.\nDetecting a Debugger\nThe script also actively tries to detect if a debugger is being used. It checks for specific key presses that activate a browser’s debugging modules. The script monitors how long the debugger has been open. If it has been on for more than 0.1 seconds, it assumes a security researcher is present and redirects the user to google.com to terminate the attack.\nThe Tycoon 2FA phishing attack is increasingly targeting organizations, enabling attackers to gain unauthorized access to Microsoft and Google accounts. This access exposes sensitive resources such as emails, OneDrive, Google Drive, and other applications. Attackers leverage stolen data to conduct targeted phishing campaigns against high-value accounts, move laterally within the environment, exfiltrate data, and deploy ransomware.\nRecommendations\nTo safeguard against these phishing attacks, organizations should implement the following measures:\nHema Loganathan, T2 GSOC Analyst\nHema Loganathan is a GSOC Analyst with the Cybereason Global SOC team. She is involved in MalOp Investigation, Malware Analysis, Reverse Engineering and Threat Hunting. Hema has a Master of Science degree in Information Systems.\nThe Cybereason DFIR team has observed threat actors leveraging email signatures to enhance their phishing lures. Read about their full discovery into the tactic.\nAfter exploitation of ProxyShell, attackers used Exchange to distribute phishing emails with the QBot payload and DatopLoader, a loader previously used to distribute the Cobalt Strike malware...\nThe Cybereason DFIR team has observed threat actors leveraging email signatures to enhance their phishing lures. Read about their full discovery into the tactic.\nAfter exploitation of ProxyShell, attackers used Exchange to distribute phishing emails with the QBot payload and DatopLoader, a loader previously used to distribute the Cobalt Strike malware...\nGet the latest research, expert insights, and security industry news.\nSubscribe",
      "enhanced_at": 1762260778.1488657,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:52:58.149143+00:00Z"
}