{
  "id": "ciberseguridad-latam-ciberseguridadlatam-com-2025-11-03-0d31d9bb",
  "source_id": "ciberseguridad-latam-ciberseguridadlatam-com",
  "guid": "https://ciberseguridadlatam.com/?p=19702",
  "title": "La venta de tu identidad: Cómo Argentina legaliza tu explotación digital",
  "url": "https://ciberseguridadlatam.com/la-venta-de-tu-identidad-como-argentina-legaliza-tu-explotacion-digital/",
  "published_at": "2025-11-03T14:35:19+00:00",
  "fetched_at": "2025-11-04T12:49:10.448067+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Por Daniel Monastersky &#8211; www.danielmonastersky.com Argentina ha legalizado, sin proponérselo deliberadamente pero con plena conciencia de las consecuencias, un sistema de explotación masiva de datos personales. No es teoría conspirativa. Es hecho documentado que sucede en escala industrial todos los días, y tenemos pruebas concretas de esto en acciones legales que hemos tenido que interponer contra corporaciones que operan exactamente bajo este vacío normativo. Empresas de data brokerage recopilan información sobre vos de cientos de fuentes: tus registros de transacciones, tus movimientos bancarios, tus búsquedas en línea, tu historial de compras, tus movimientos físicos registrados a través de geolocalización. Luego venden esos datos a quien pague. Reclutadores que quieren saber si eres empleable. Instituciones financieras que quieren calcular si eres «riesgoso». Aseguradoras que quieren predecir cuánto pagarás en servicios. Políticos que quieren saber cómo influenciarte. Y vos no tenés derecho legal a saber que esto está sucediendo. No tenés derecho a acceder a ese perfil. No tenés derecho a corregir información falsa. No tenés derecho a decir que no. Esa ausencia de derechos no es accidental. Es producto directo de una ley que fue redactada cuando esto era imposible de imaginar. Argentina no solo tolera este sistema: lo facilita activamente mientras nosotros presentamos denuncias contra corporaciones que operan en la penumbra regulatoria. Tomá Worldcoin como ejemplo. Una empresa que llegó a Argentina con un modelo de negocio basado en recopilar datos biométricos extremadamente sensibles: tu iris. Tu identidad retiniana. Información que es más única que tu huella dactilar, más inmutable que cualquier documento. ¿Y sabe qué? Bajo nuestra ley, lo hacen sin que vos tengas derecho explícito a saber la dimensión completa de lo que está siendo recopilado, sin mecanismos para decir que no, sin protecciones claras si esa información es mal utilizada. Worldcoin fue prohibida en Alemania. Prohibida en Colombia. País tras país está diciendo no. Porque otros gobiernos reconocieron lo que Argentina tardó en entender: que recopilar datos biométricos de la población sin protecciones claras es violación sistemática de derechos fundamentales. Fui yo mismo quien presenté la denuncia ante el regulador argentino en agosto de 2024, quien documentó el funcionamiento de esta empresa, quien expuso públicamente lo que estaba sucediendo bajo cobertura de legislación obsoleta. Mientras Alemania y Colombia protegen a sus ciudadanos, Argentina sigue permitiendo que máquinas de escaneo de iris operen en nuestras calles. Meta es otro caso. Facebook, Instagram, WhatsApp. Plataformas que construyeron imperios multimillonarios sobre tu información personal. Saben dónde vivís, a quién conocés, qué comprás, qué te asusta, qué te atrae, qué crees políticamente. Y bajo nuestra ley, lo hacen sin que vos tengas derecho explícito a saber la dimensión completa de lo que está siendo recopilado, sin mecanismos para decir que no, sin protecciones claras si esa información es mal utilizada. Nuevamente: tuvimos que presentar denuncias contra prácticas que nuestro propio ordenamiento jurídico permitía. Ese derecho—el derecho a ser informado cuando tu información es comprometida—no podemos hacerlo valer en Argentina. No existe en nuestra normativa. No está protegido. No hay mecanismo que obligue al Estado o a las corporaciones a decirte: tu información fue expuesta. Tenés que saberlo. Tenés que poder actuar. En Europa, es obligatorio. Tienen hasta 72 hs. Eso es lo máximo que pueden guardar silencio. Setenta y dos horas y después deben notificar. En Brasil, es obligatorio. En prácticamente cualquier democracia seria, es obligatorio. Pero en Argentina, Las organizaciones y empresas pueden guardar silencio mientras millones de ciudadanos permanecen ignorantes de que fueron víctimas de violación de privacidad masiva. Estos no son casos aislados. Son síntomas del mismo tumor: una legislación que permite que corporaciones extranjeras y entidades estatales operen sobre datos de ciudadanos argentinos sin restricciones claras, sin sanciones reales, sin mecanismos de reclamo efectivos. Mientras el mundo avanza, nosotros permanecemos atrapados en el pasado legal permitiendo que suceda lo que otros países ya prohibieron hace años. Nos dicen que esto es inevitable. Que es «el precio de internet». Que si querés servicios digitales, tenés que aceptar que te monitoreen. Que si no te gusta, no uses redes sociales. Es una gran mentira que dicen por ahí para justificar lo injustificable. Otros países rechazaron ese argumento hace años. Europa dijo: no. Los datos son de la persona. Si querés usarlos, necesitas permiso expreso. Brasil dijo: no. Tenés que ser claro sobre qué recopila, por qué lo recopila, y quién tiene acceso y como. Tenés que notificar si hay brechas. Chile, Uruguay, Colombia: todos dijeron no a la explotación sistemática. Argentina, en cambio, sigue diciendo sí. Sigue permitiendo que corporaciones construyan perfiles económicamente valiosos sobre ciudadanos sin que esos ciudadanos tengan poder de veto, poder de acceso, poder de corrección. Todos sabemos a esta altura que nuestra privacidad está protegida constitucionalmente. Pero la ley específica que debería hacerla efectiva en contexto digital fue escrita hace un cuarto de siglo. Las empresas saben esto. Lo explotan deliberadamente. ¿Por qué? Porque el costo de violar tus derechos es prácticamente nulo. No hay sanciones significativas. No hay autoridad que las investigue sistemáticamente porque no tiene el enforcement para hacerlo, no tienen presupuesto, están casi atados de brazos. No hay mecanismos para que vos reclames. El resultado: actúan con impunidad calculada. Una empresa recopila tus datos ilegalmente—en términos de lo que debería ser ilegal, pero que bajo nuestra ley es perfectamente legal. Vos descubrís. Presentás reclamo ante la autoridad regulatoria. La autoridad, con recursos limitados, tarda meses en responder. Mientras tanto, tus datos ya fueron vendidos a docenas de terceros y nunca sabrás a quién, para qué, con qué consecuencias. Eso es el sistema que permitimos que funcione. ¿Quién se beneficia de que Argentina permanezca regulatoriamente ciega frente a esto? No es misterio. Son empresas que construyeron modelos de negocios basados en la venta y explotación de nuestros datos. Lucran vendiendo acceso a datos sobre vos. Son sistemas publicitarios que dependen de perfiles detallados. Todos tienen interés financiero en que Argentina no actualice esta ley. Hoy estamos en la era de la hiper-personalizacion. ¿Y quién pierde? Vos. Todos nosotros. Perdés oportunidades laborales porque un algoritmo alimentado por datos incompletos o incorrectos sobre vos—datos que ni siquiera sabías que existían—decidió que no eres candidato. Perdés acceso a servicios financieros porque una puntuación de riesgo basada en vigilancia de tus movimientos decidió que eres demasiado riesgoso. Perdés libertad política porque algoritmos construidos a partir de datos sobre vos pueden predecirte, manipularte, dirigirse a vos con precisión quirúrgica. Y lo más grave: perdés la capacidad de elegir quién tenés derecho a ser, porque esa elección está siendo hecha por máquinas que analizan información sobre vos que ni siquiera sabés que existe. Información que circula en bases de datos sin que tengas derecho a saber qué dicen, sin que tengas poder para corregirla si es falsa, sin que tengas opción de rechazar su recopilación. En una democracia genuina, los datos sobre ciudadanos no son commodity para ser vendidos al mejor postor. Son información sobre personas que poseen derechos fundamentales sobre esa información. Una verdadera reforma significaría: vos tenés derecho absoluto a saber. No «en diez días si presentás un derecho de acceso». Significa acceso real, completo, comprensible. Todas las empresas que recopilan datos sobre vos deben poder identificarse y explicar qué tienen, por qué lo tienen, a quién se lo vendieron. Cuando una empresa viola estos derechos—como Worldcoin hizo, como Meta hace, no es una «multa administrativa menor». Multas proporcionales al ingreso global de la empresa infractora. Responsabilidad personal para ejecutivos que autorizan violaciones. Autoridad regulatoria con poder real de investigar, sancionar, y ordenar cambios operacionales. Eso es lo que otros países implementaron. Eso es lo que Argentina rechaza deliberadamente seguir permitiendo. Se te dirá que la reforma está «en proceso». Que hay «debate multisectorial». Que los «expertos están trabajando en ello». Todo verdadero. Todo también completamente insuficiente. Porque mientras «debatimos», millones de argentinos están siendo perfilados sin consentimiento. Mientras «trabajamos en propuestas», datos sobre vos se venden a terceros desconocidos. Mientras «construimos consenso», sistemas automatizados toman decisiones sobre tu acceso a oportunidades basadas en vigilancia que vos ni autorizaste. Tuvimos que presentar denuncias contra Worldcoin porque el «debate» no detuvo la recopilación de datos biométricos. Tuvimos que presentar denuncias contra Meta porque el «consenso» no frenó la explotación de información personal. El debate es escudo para la inacción. El «consenso» es excusa para no decidir. Los «expertos trabajando» es distracción mientras el daño continúa exponencialmente. Lo que falta es voluntad política. Voluntad de decidir que los derechos de ciudadanos importan más que conveniencia de corporaciones. Eso es lo único que realmente falta. Y la evidencia de esa falta de voluntad está en cada denunciación que presentamos que permanece sin resolver, en cada corporación que continúa operando mientras nosotros litigamos, en cada dato tuyo que se vende, en cada brecha que sucede y es negada mientras millones de argentinos permanecen en la ignorancia. Argentina está apostando que vos no vas a entender lo que sucede hasta que sea demasiado tarde. Que vas a seguir usando servicios digitales sin darte cuenta de quién más te está usando a vos. Que no vas a presionar para cambiar las cosas porque la violación es invisible. Es apuesta que probablemente ganen si continuamos permitiendo que esto suceda en la oscuridad legal. Pero hay alternativa. Existe. Otros países la eligieron. Argentina puede elegirla. Requiere que ciudadanos entiendan qué está siendo negado. Que empresas entiendan que operan en zona gris insostenible. Que legisladores entiendan que modernizar protección de datos no es favor a corporaciones sino obligación con ciudadanos. La pregunta no es si Argentina puede modernizar su ley de protección de datos. Puede. La pregunta es si va a permitir que eso suceda antes de que toda una generación crezca creyendo que la explotación de datos biométricos y la venta de perfiles es cómo funciona el mundo. Porque va a llegar el momento en que descubramos que fuimos nosotros mismos quienes permitimos que normalizaran nuestra explotación. Que fuimos nosotros quienes nos quedamos callados mientras Worldcoin recopilaba el iris en nuestras calles mientras otros países ya decían no y mientras Meta construía imperios sobre información que nos pertenece. Y entonces será demasiado tarde para reclamar el derecho que nunca defendimos. La batalla ya está ocurriendo. Nosotros la estamos librando denunciando corporaciones, presentando casos. Pero no es suficiente que la batalla la libremos abogados y activistas digitales. La tenés que librar vos también. Solo que vos no sabés todavía que estás en ella.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}