{
  "id": "cyberscoop-2025-11-03-e555e313",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86598",
  "title": "Zscaler adds more AI to its offerings with Splx acquisition",
  "url": "https://cyberscoop.com/zscaler-splx-acquistion/",
  "published_at": "2025-11-03T17:09:04+00:00",
  "fetched_at": "2025-11-04T12:49:25.661808+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Cloud security company Zscaler announced Monday it has acquired SplxAI, an artificial intelligence security platform, in a move to strengthen its ability to protect enterprise AI assets. Terms were not disclosed.&nbsp; Zscaler said the purchase is aimed at enhancing its zero-trust security offerings by integrating Splx’s technology for AI asset discovery, automated red-teaming, and governance. The company said these features will help secure AI applications and services during development and after deployment. “AI is creating enormous value, but its full potential can only be realized when it can be secured,” Zscaler CEO Jay Chaudhry said in a statement. Founded by Kristian Kamber and Ante Gojsalic, Splx has developed a platform focused on helping organizations identify and protect AI models, workflows, and underlying infrastructure. The platform includes automated red-teaming, which simulates attacks to find weaknesses in AI systems before they are targeted by real-world threats. Splx’s technology also provides live recommendations to address any security issues it uncovers. The acquisition comes as cybersecurity companies continue to add AI to their products and service offerings. The Splx deal follows Zscaler’s recent acquisition of Red Canary, an AI-driven threat management company.&nbsp; The deal is another in a lengthy list of cybersecurity companies acquiring AI-focused companies in 2025. Similar deals this year include:&nbsp; Check Point acquires AI security firm Lakera F5 Networks acquiring CalypsoAI Cato Networks acquires AI security startup Aim Security Varonis buys AI email security firm SlashNext Veeam acquires Securiti AI Zscaler said Splx’s tools will help address the security risks created by new and largely untested AI applications. These systems often operate autonomously, connect to various data sources, and can introduce vulnerabilities that are difficult to detect using traditional security methods. Splx, founded in 2023, is a venture capital-backed company that has raised about $9 million to date. Its investors include LAUNCHub Ventures, Rain Capital, Inovo Runtime Ventures, DNV Ventures AS and South Central Ventures. Both companies said they share the same vision of tackling the expanding attack surface created by increased AI adoption. “By joining forces with Zscaler, we’ll bring our innovation to one of the most trusted security platforms in the world, securing AI innovation at the speed organizations are adopting it,” Kamber, co-founder and CEO of Splx, said in a statement. The post Zscaler adds more AI to its offerings with Splx acquisition appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Zscaler adds more AI to its offerings with Splx acquisition\nCloud security company Zscaler announced Monday it has acquired SplxAI, an artificial intelligence security platform, in a move to strengthen its ability to protect enterprise AI assets.\nTerms were not disclosed.\nZscaler said the purchase is aimed at enhancing its zero-trust security offerings by integrating Splx’s technology for AI asset discovery, automated red-teaming, and governance. The company said these features will help secure AI applications and services during development and after deployment.\n“AI is creating enormous value, but its full potential can only be realized when it can be secured,” Zscaler CEO Jay Chaudhry said in a statement.\nFounded by Kristian Kamber and Ante Gojsalic, Splx has developed a platform focused on helping organizations identify and protect AI models, workflows, and underlying infrastructure. The platform includes automated red-teaming, which simulates attacks to find weaknesses in AI systems before they are targeted by real-world threats. Splx’s technology also provides live recommendations to address any security issues it uncovers.\nThe acquisition comes as cybersecurity companies continue to add AI to their products and service offerings. The Splx deal follows Zscaler’s recent acquisition of Red Canary, an AI-driven threat management company.\nThe deal is another in a lengthy list of cybersecurity companies acquiring AI-focused companies in 2025. Similar deals this year include:\n- Check Point acquires AI security firm Lakera\n- F5 Networks acquiring CalypsoAI\n- Cato Networks acquires AI security startup Aim Security\n- Varonis buys AI email security firm SlashNext\n- Veeam acquires Securiti AI\nZscaler said Splx’s tools will help address the security risks created by new and largely untested AI applications. These systems often operate autonomously, connect to various data sources, and can introduce vulnerabilities that are difficult to detect using traditional security methods.\nSplx, founded in 2023, is a venture capital-backed company that has raised about $9 million to date. Its investors include LAUNCHub Ventures, Rain Capital, Inovo Runtime Ventures, DNV Ventures AS and South Central Ventures.\nBoth companies said they share the same vision of tackling the expanding attack surface created by increased AI adoption. “By joining forces with Zscaler, we’ll bring our innovation to one of the most trusted security platforms in the world, securing AI innovation at the speed organizations are adopting it,” Kamber, co-founder and CEO of Splx, said in a statement.",
      "enhanced_at": 1762260784.683961,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:53:04.684285+00:00Z"
}