{
  "id": "cyberscoop-2025-11-03-e0ebb90c",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86615",
  "title": "OPM plans to give CyberCorps members more time to find jobs after shutdown ends",
  "url": "https://cyberscoop.com/opm-nsf-cybercorps-sfs-mass-deferment-government-shutdown/",
  "published_at": "2025-11-03T22:11:07+00:00",
  "fetched_at": "2025-11-04T12:49:25.661055+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Office of Personnel Management plans to collaborate on a &#8220;mass deferment&#8221; for a cyber scholarship-for-service program after the government shutdown ends, a spokesman said Monday, as scholarship recipients have sounded fears about being on the hook for their schooling costs during federal hiring freezes and budget cuts. The National Science Foundation (NSF) leads and manages the CyberCorps: Scholarship-For-Service (SFS) program, in coordination with the Office of Personnel Management (OPM) and Department of Homeland Security. Participants in the program must get an internship with the government, then serve in a government position within 18 months of graduation. Those who cannot meet the terms must repay the government in the form of loans. &#8220;After the shutdown ends, OPM will collaborate with NSF on a mass deferment to give graduates more time to secure qualifying positions and further guidance to encourage agencies to make use of the SFS program for their hiring needs,&#8221; the OPM spokesperson, McLaurine Pinover, told CyberScoop. The agency also provided a statement from OPM Director Scott Kupor. “Bringing top cybersecurity and AI talent into the federal government are critical to our national security. Scholarships for Service is an innovative program that covers the tuition for students who specialize in these areas in exchange for a federal service commitment,&#8221; he said. &#8220;OPM is committed to the success of SFS and is working closely with the National Science Foundation to ensure CyberCorps participants are supported during this challenging time. Once the shutdown ends, we will issue guidance to agencies encouraging them to fully leverage the program to bring these highly skilled professionals into public service.” The National Science Foundation has not yet responded to questions about the program, with an automated email saying &#8220;most National Science Foundation staff will not be receiving or responding to email until further notice&#8221; during the shutdown, which shows few signs of resolving. The OPM remarks come shortly after program participants told news outlets, including CyberScoop, about their concerns regarding potentially having to repay the government sums of upwards of $100,000, since they said hiring freezes and budget cuts under the Trump administration have made seeking federal employment significantly more difficult. Current participants also have criticized program overseers for their communications about job fairs, assistance and related activities. &#8220;No scholars have been sent to repayment,&#8221; Pinover said. &#8220;OPM continues to communicate with scholars, reminding them of their service obligations and sharing resources — including qualifying state, local, tribal, and territorial opportunities — to help them meet those obligations.&#8221; The post OPM plans to give CyberCorps members more time to find jobs after shutdown ends appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "OPM plans to give CyberCorps members more time to find jobs after shutdown ends\nThe Office of Personnel Management plans to collaborate on a “mass deferment” for a cyber scholarship-for-service program after the government shutdown ends, a spokesman said Monday, as scholarship recipients have sounded fears about being on the hook for their schooling costs during federal hiring freezes and budget cuts.\nThe National Science Foundation (NSF) leads and manages the CyberCorps: Scholarship-For-Service (SFS) program, in coordination with the Office of Personnel Management (OPM) and Department of Homeland Security. Participants in the program must get an internship with the government, then serve in a government position within 18 months of graduation. Those who cannot meet the terms must repay the government in the form of loans.\n“After the shutdown ends, OPM will collaborate with NSF on a mass deferment to give graduates more time to secure qualifying positions and further guidance to encourage agencies to make use of the SFS program for their hiring needs,” the OPM spokesperson, McLaurine Pinover, told CyberScoop.\nThe agency also provided a statement from OPM Director Scott Kupor.\n“Bringing top cybersecurity and AI talent into the federal government are critical to our national security. Scholarships for Service is an innovative program that covers the tuition for students who specialize in these areas in exchange for a federal service commitment,” he said. “OPM is committed to the success of SFS and is working closely with the National Science Foundation to ensure CyberCorps participants are supported during this challenging time. Once the shutdown ends, we will issue guidance to agencies encouraging them to fully leverage the program to bring these highly skilled professionals into public service.”\nThe National Science Foundation has not yet responded to questions about the program, with an automated email saying “most National Science Foundation staff will not be receiving or responding to email until further notice” during the shutdown, which shows few signs of resolving.\nThe OPM remarks come shortly after program participants told news outlets, including CyberScoop, about their concerns regarding potentially having to repay the government sums of upwards of $100,000, since they said hiring freezes and budget cuts under the Trump administration have made seeking federal employment significantly more difficult.\nCurrent participants also have criticized program overseers for their communications about job fairs, assistance and related activities.\n“No scholars have been sent to repayment,” Pinover said. “OPM continues to communicate with scholars, reminding them of their service obligations and sharing resources — including qualifying state, local, tribal, and territorial opportunities — to help them meet those obligations.”",
      "enhanced_at": 1762260686.7809498,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:26.781223+00:00Z"
}