{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-03-466c381b",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42273",
  "title": "Los hogares inteligentes enfrentan 29 ataques IoT diarios",
  "url": "https://cybersecuritynews.es/los-hogares-inteligentes-enfrentan-29-ataques-iot-diarios/",
  "published_at": "2025-11-03T22:00:00+00:00",
  "fetched_at": "2025-11-04T12:48:59.128194+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Bitdefender, empresa global de ciberseguridad, ha publicado en colaboración con NETGEAR el Informe sobre el panorama de la seguridad IoT 2025, que ofrece un análisis exhaustivo sobre el creciente número de amenazas que afectan a los dispositivos conectados en los hogares modernos. La investigación pone de relieve cómo la expansión del ecosistema de Internet de las cosas (IoT) —que abarca desde televisores inteligentes y dispositivos de streaming hasta routers y cámaras de seguridad— ha incrementado drásticamente la exposición de los consumidores a ciberataques automatizados y a campañas de explotación a gran escala. Basado en la telemetría recopilada de millones de hogares inteligentes en varios continentes, el informe revela que el hogar medio cuenta actualmente con 22 dispositivos conectados y es objeto de casi 29 ataques al día, casi el triple de los registrados el año anterior. Este aumento demuestra cómo los ciberdelincuentes están aprovechando cada vez más la automatización, el firmware inseguro y los dispositivos obsoletos para comprometer hogares digitales a gran escala. “La explosión de dispositivos conectados ha transformado los hogares en complejos ecosistemas digitales, pero también ha convertido cada bombilla, cámara o router en un posible objetivo”, explica Ciprian Istrate, vicepresidente sénior de Operaciones de Bitdefender Consumer Solutions Group. “Nuestra investigación con NETGEAR demuestra que la seguridad IoT ya no puede considerarse opcional. La protección debe comenzar en el propio nivel de red —en routers, pasarelas e incluso en el borde del ISP— para adelantarse a ataques cada vez más automatizados y de escala industrial.” El Informe sobre el panorama de la seguridad IoT 2025 se basa en datos procedentes de más de 6,1 millones de hogares inteligentes en Norteamérica, Europa y Australia. Entre enero y octubre de 2025, los investigadores de Bitdefender analizaron 13.600 millones de ataques IoT y 4.600 millones de intentos de explotación de vulnerabilidades, proporcionando una visión detallada del riesgo global del IoT. El informe también destaca varios incidentes relevantes que han marcado el panorama de la seguridad IoT en 2025, entre ellos, el ataque DDoS sin precedentes de 22,2 terabytes por segundo impulsado por routers comprometidos, la propagación de BadBox, una botnet que infectó más de un millón de dispositivos Android antes de salir de fábrica, y el descubrimiento de que los inversores solares podían ser secuestrados para interrumpir las redes eléctricas nacionales. Principales conclusiones del Informe sobre el panorama de la seguridad IoT 2025 Los hogares conectados están bajo ataque constante. El hogar medio cuenta con 22 dispositivos conectados y sufre una media de 29 ataques diarios, frente a los 10 de 2024. Este crecimiento evidencia cómo la mayor conectividad y las vulnerabilidades de los dispositivos ofrecen más oportunidades de explotación a los ciberdelincuentes. Los dispositivos de entretenimiento son los más vulnerables. Los reproductores de streaming (25,9 %), televisores inteligentes (21,3 %) y cámaras IP (8,6 %) concentran más de la mitad de todas las vulnerabilidades detectadas en el IoT. Estos dispositivos, de uso cotidiano, suelen quedar sin actualizar, convirtiéndose en puertas de entrada fáciles para los atacantes. Las vulnerabilidades conocidas siguen siendo el principal riesgo. Casi todos (99,4 %) los ataques a dispositivos IoT explotan vulnerabilidades ya identificadas y corregidas (Common Vulnerabilities and Exposures o CVE), lo que refuerza la importancia de aplicar actualizaciones y mantener una gestión proactiva de los dispositivos. Los móviles dominan el ecosistema IoT doméstico. Los teléfonos móviles representan el 19,6 % de los endpoints conectados, seguidos de los televisores inteligentes (9,5 %) y los dispositivos de streaming (7,3 %). Este dato confirma que el smartphone se ha convertido en el eje central del hogar conectado. Los ataques básicos siguen siendo los más efectivos. Los ataques de desbordamiento (overflow) y denegación de servicio (DoS) son los más frecuentes, mientras que los de escalada de privilegios y ejecución de código permiten a los ciberdelincuentes tomar el control total de los dispositivos comprometidos. “La conectividad ya no trata solo de velocidad o cobertura, sino también de confianza”, señala Jonathan Oakes, vicepresidente sénior y director general de Home Networking en NETGEAR. “El router es el corazón de cada hogar digital, el punto donde la protección resulta más crítica: la propia red. La seguridad no puede ser una idea posterior; debe integrarse desde el principio.” Bitdefender y NETGEAR abordan estos desafíos mediante NETGEAR Armor™, impulsado por Bitdefender®, una plataforma de seguridad integrada disponible en los routers Nighthawk y los sistemas Orbi Mesh WiFi. Armor ayuda a detectar y bloquear amenazas conocidas y emergentes, identificar vulnerabilidades y proteger a los usuarios frente a phishing, robo de datos y otros ataques, contribuyendo a que las familias disfruten de un entorno inteligente más seguro y resiliente. La entrada Los hogares inteligentes enfrentan 29 ataques IoT diarios se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Bitdefender, empresa global de ciberseguridad, ha publicado en colaboración con NETGEAR el Informe sobre el panorama de la seguridad IoT 2025, que ofrece un análisis exhaustivo sobre el creciente número de amenazas que afectan a los dispositivos conectados en los hogares modernos.\nLa investigación pone de relieve cómo la expansión del ecosistema de Internet de las cosas (IoT) —que abarca desde televisores inteligentes y dispositivos de streaming hasta routers y cámaras de seguridad— ha incrementado drásticamente la exposición de los consumidores a ciberataques automatizados y a campañas de explotación a gran escala.\nBasado en la telemetría recopilada de millones de hogares inteligentes en varios continentes, el informe revela que el hogar medio cuenta actualmente con 22 dispositivos conectados y es objeto de casi 29 ataques al día, casi el triple de los registrados el año anterior. Este aumento demuestra cómo los ciberdelincuentes están aprovechando cada vez más la automatización, el firmware inseguro y los dispositivos obsoletos para comprometer hogares digitales a gran escala.\n“La explosión de dispositivos conectados ha transformado los hogares en complejos ecosistemas digitales, pero también ha convertido cada bombilla, cámara o router en un posible objetivo”, explica Ciprian Istrate, vicepresidente sénior de Operaciones de Bitdefender Consumer Solutions Group. “Nuestra investigación con NETGEAR demuestra que la seguridad IoT ya no puede considerarse opcional. La protección debe comenzar en el propio nivel de red —en routers, pasarelas e incluso en el borde del ISP— para adelantarse a ataques cada vez más automatizados y de escala industrial.”\nEl Informe sobre el panorama de la seguridad IoT 2025 se basa en datos procedentes de más de 6,1 millones de hogares inteligentes en Norteamérica, Europa y Australia. Entre enero y octubre de 2025, los investigadores de Bitdefender analizaron 13.600 millones de ataques IoT y 4.600 millones de intentos de explotación de vulnerabilidades, proporcionando una visión detallada del riesgo global del IoT.\nEl informe también destaca varios incidentes relevantes que han marcado el panorama de la seguridad IoT en 2025, entre ellos, el ataque DDoS sin precedentes de 22,2 terabytes por segundo impulsado por routers comprometidos, la propagación de BadBox, una botnet que infectó más de un millón de dispositivos Android antes de salir de fábrica, y el descubrimiento de que los inversores solares podían ser secuestrados para interrumpir las redes eléctricas nacionales.\nPrincipales conclusiones del Informe sobre el panorama de la seguridad IoT 2025\n- Los hogares conectados están bajo ataque constante. El hogar medio cuenta con 22 dispositivos conectados y sufre una media de 29 ataques diarios, frente a los 10 de 2024. Este crecimiento evidencia cómo la mayor conectividad y las vulnerabilidades de los dispositivos ofrecen más oportunidades de explotación a los ciberdelincuentes.\n- Los dispositivos de entretenimiento son los más vulnerables. Los reproductores de streaming (25,9 %), televisores inteligentes (21,3 %) y cámaras IP (8,6 %) concentran más de la mitad de todas las vulnerabilidades detectadas en el IoT. Estos dispositivos, de uso cotidiano, suelen quedar sin actualizar, convirtiéndose en puertas de entrada fáciles para los atacantes.\n- Las vulnerabilidades conocidas siguen siendo el principal riesgo. Casi todos (99,4 %) los ataques a dispositivos IoT explotan vulnerabilidades ya identificadas y corregidas (Common Vulnerabilities and Exposures o CVE), lo que refuerza la importancia de aplicar actualizaciones y mantener una gestión proactiva de los dispositivos.\n- Los móviles dominan el ecosistema IoT doméstico. Los teléfonos móviles representan el 19,6 % de los endpoints conectados, seguidos de los televisores inteligentes (9,5 %) y los dispositivos de streaming (7,3 %). Este dato confirma que el smartphone se ha convertido en el eje central del hogar conectado.\n- Los ataques básicos siguen siendo los más efectivos. Los ataques de desbordamiento (overflow) y denegación de servicio (DoS) son los más frecuentes, mientras que los de escalada de privilegios y ejecución de código permiten a los ciberdelincuentes tomar el control total de los dispositivos comprometidos.\n“La conectividad ya no trata solo de velocidad o cobertura, sino también de confianza”, señala Jonathan Oakes, vicepresidente sénior y director general de Home Networking en NETGEAR. “El router es el corazón de cada hogar digital, el punto donde la protección resulta más crítica: la propia red. La seguridad no puede ser una idea posterior; debe integrarse desde el principio.”\nBitdefender y NETGEAR abordan estos desafíos mediante NETGEAR Armor™, impulsado por Bitdefender®, una plataforma de seguridad integrada disponible en los routers Nighthawk y los sistemas Orbi Mesh WiFi. Armor ayuda a detectar y bloquear amenazas conocidas y emergentes, identificar vulnerabilidades y proteger a los usuarios frente a phishing, robo de datos y otros ataques, contribuyendo a que las familias disfruten de un entorno inteligente más seguro y resiliente.",
      "enhanced_at": 1762260690.6018367,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:30.602187+00:00Z"
}