{
  "id": "latest-news-zdnet-com-2025-11-03-e8987fdc",
  "source_id": "latest-news-zdnet-com",
  "guid": "316c7cad-9aab-479d-b0a4-1d84c725fd09",
  "title": "My cheap and simple solution to loose AirPods, and how they made them ideal for workouts",
  "url": "https://www.zdnet.com/article/my-cheap-and-simple-solution-to-loose-airpods-and-how-they-made-them-ideal-for-workouts/",
  "published_at": "2025-11-03T18:09:00+00:00",
  "fetched_at": "2025-11-03T19:01:34.013673Z",
  "status": "fetched",
  "content": {
    "raw": "AirPods keeping dangling off your ears? Try these three affordable accessories before giving up on them.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nMy cheap and simple solution to loose AirPods, and how they made them ideal for workouts\nFollow ZDNET: Add us as a preferred source on Google.\nYour AirPods can be your best friend, small enough to stay in your pocket or bag until you need them. But if you like to work out with your AirPods, pushing your slippery earbuds back into your ear can become a particularly intense workout. I've found three products to help with this problem -- a few dollars spent can revitalize your AirPods experience.\nAlso: 3 Apple devices you probably shouldn't buy this month (and 9 that are safe for now)\nUnfortunately, some people's ear anatomy may not be compatible with certain earbuds, and the best option may be to purchase from another brand. However, if you're determined to keep your AirPods in your ear, try these tips first.\n1. Detachable ear hooks\nIf you like to run or weightlift, the impact of your feet hitting the ground or the explosiveness of specific compound movements can shift your AirPods in your ears. Earbuds with ear hooks, like the Beats Powerbeats Pro 2, provide the in-ear stability to keep them in your ear for your entire workout.\nIf you don't want to buy another pair of earbuds, you can purchase detachable ear hooks to attach to your AirPods. I tried the Icarerspace hooks from Amazon. You get two pairs of hooks for $16, and this product has 4/5 stars out of 1,591 reviews.\nAlso: Powerbeats Pro 2 vs. AirPods Pro 2: Which earbuds are best for working out?\nThese ear hooks are compatible with AirPods Pro and all base model AirPods. I tested them on my AirPods Pro 2 and AirPods 4. The ear hooks clip onto the AirPods' stem, and then you can rock and roll.\nThe stems offer more in-ear stability for dynamic movements like running, biking, walking, and exercises that require bending over or lying on a bench, like bench presses or push-ups. I found that I didn't have to adjust my AirPods in between sets.\nThese stems aren't as comfortable or high-quality as the stems on the Powerbeats Pro 2, and after a few hours, they began to irritate the back of my ear. I'm generally not a fan of ear hooks; even the better quality ones irritate my ears.\n2. Silicone wings\nSilicone wings or grips are an option if you don't want plastic ear hooks to go around your ears. I tried the Proof Labs silicone wings from Amazon. For $16, you get four pairs in different sizes, a storage pouch, and a carabiner for portability. You can buy them for AirPods Pro 1 and 2, and AirPods 4. Out of 22,100 ratings, this product has 4.3/5 stars.\nThese wings cover the AirPods' bud and sit at the top of your concha, or the top part of the ear's thick cartilage fold. The Proof Labs wings eliminated the extra space in my ear for my AirPods to wiggle around, offering stability and comfort.\nAlso: I wore the best headphones from Sony, Bose, Apple, and Sonos: Here's how the AirPods Max wins\nI found the wing tips helpful when working out, but they also helped my AirPods Pro 2 create a better seal in my ear. During a long car ride, I forgot my beloved Sonos Ace and had to resort to my AirPods. The improved fit and seal in my ear made for maximized audio and noise cancellation performance.\nIf you find that too much external noise reaches your ears due to loose AirPods, these silicone wings could help. Like the detachable ear hooks, these silicone tips must be removed before placing your AirPods back in their charging case.\n3. Ear tip replacements\nIf you want to try an option that doesn't need to be removed to put your AirPods back in their charging case, the Azla Crystal silicone ear tip replacements are ZDNET editor-in-chief Jason Hiner's product of choice.\nAlso: After using M5 iPad Pro, I'm seriously considering putting away my MacBook for it\nThese ear tip replacements are fairly priced, coming in at two pairs of tips for $15 (at the time of writing). They're only compatible with AirPods Pro models and received 4.1/5 stars out of 1,248 reviews. Thanks to their less slick surface, users say these tips provide a more stable fit than the original AirPods Pro tips.\nFAQs\nWhy do my AirPods keep falling out?\nThe main culprit of loose, ill-fitting AirPods is your ear anatomy. Everyone's ear shape is different, and some are better suited for AirPods than others. For the non-Pro model AirPods, if your concha bowl is too small, they may fall out. If your antihelix ridge (the piece of cartilage that sticks out into the concha bowl) is too flat, it may not be able to hold and secure your AirPods in your ear.\nThe AirPods Pro 2 use silicone tips to stay in your ear, but those are highly dependent on your ear canal depth and width. If your outer canal is too shallow or narrow, your AirPods may not seal properly in your ear, leading to poor audio, noise cancellation, and fit.\nAccessories like the ones in this article can help, but if they don't, your best bet may be to try another brand with different earbud shapes or consider over-ear headphones instead.",
      "enhanced_at": 1762260770.575956,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:52:50.576276+00:00Z"
}