{
  "id": "latest-news-zdnet-com-2025-11-03-411c9cf3",
  "source_id": "latest-news-zdnet-com",
  "guid": "90f2ced7-1be5-4020-b05d-de1f3cfa2565",
  "title": "Perplexity's new AI tool lets you search patents with natural language - and it's free",
  "url": "https://www.zdnet.com/article/perplexitys-new-ai-tool-lets-you-search-patents-with-natural-language-and-its-free/",
  "published_at": "2025-11-03T01:00:26+00:00",
  "fetched_at": "2025-11-03T11:16:06.514237Z",
  "status": "rejected",
  "content": {
    "raw": "Perplexity Patents is currently in beta and free for all users. Here's how to try it.",
    "full": "Perplexity's new AI tool lets you search patents with natural language - and it's free\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Perplexity launched Perplexity Patents on Thursday.\n- The new AI-powered database makes finding patents easier.\n- You don't need specific language or codes to find patents.\nPatent searching is a lengthy, extensive, and imperfect process for innovators. If someone wanted to find patents in a certain area, they'd have to use several tools, like Google Patents, the United States Patent and Trademark Office, or a global patent database. Then, they'd have to search using specific keywords or codes -- or even rely on a patent attorney for supreme accuracy.\nAlso: Why AI coding tools like Cursor and Replit are doomed - and what comes next\nPerplexity Patents, the AI company's latest tool, aims to not only democratize but also speed up that process. Released Thursday, the AI-powered database uses natural language to help researchers find the patents they're looking for.\n\"Perplexity Patents ushers in a new era, in which anybody can access patent intelligence and get clear answers quickly, maintaining context across multiple questions,\" the Perplexity team wrote in a blog post.\nHow it works\nPerplexity Patents users can ask the database questions that don't rely on specific keywords or classification codes. For example, Perplexity said a user could ask Perplexity Patents, \"Are there any patents on AI for language learning?\" or \"Key quantum computing patents since 2024?\" for a more vague research approach, as opposed to using a carefully strung-together query with keywords and precise language.\nWhen a user prompts Patents, it uses Perplexity's patent knowledge index to return collections of patents and direct links to original patent documents.\nAlso: You can now give NotebookLM more instructions - here's why that's a game changer\nIf you ask the tool about one type of patent, it will also return answers to adjacent patents, compare different inventions, and enable follow-up questions, so users don't have to restart their search to learn more information. This means if you ask it about fitness trackers, Perplexity Patents will also return results on similar topics, like health wearables or activity bands.\nWant more stories about AI? Sign up for the AI Leaderboard newsletter.\nThe tool will find prior art -- that is, any evidence of an existing patented invention in blogs, videos, code, academic papers, public software repositories, and other sources -- not just official patent databases.\nHow to try it\nPerplexity Patents is currently in beta and free for all users. Pro and Max subscribers have more access to the model, alongside additional configuration options. Just visit Perplexity's site to try it.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-03T11:20:02.822861Z"
}