{
  "id": "latest-news-zdnet-com-2025-11-03-6a84ab94",
  "source_id": "latest-news-zdnet-com",
  "guid": "ee98a308-bf3f-44bc-a041-3fff29f22e57",
  "title": "This $99 gadget can prevent electrical fires at home by doing nothing - how it works",
  "url": "https://www.zdnet.com/article/this-99-gadget-can-prevent-electrical-fires-at-home-by-doing-nothing-how-it-works/",
  "published_at": "2025-11-03T02:55:00+00:00",
  "fetched_at": "2025-11-03T11:16:06.514114Z",
  "status": "rejected",
  "content": {
    "raw": "I tested a tiny plug-in that claims to prevent electrical fires - can something so simple really bring peace of mind?",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis $99 gadget can prevent electrical fires at home by doing nothing - how it works\nTing Smart Sensor\nZDNET's key takeaways\n- Ting quietly monitored the wiring but thankfully detected no problems after months of use.\n- Weekly reports show appliance cycles and household power usage trends.\n- Outage maps are limited compared to utility and PowerOutage.us\nFollow ZDNET: Add us as a preferred source on Google.\nHow do you review a product that does absolutely nothing except sit there with a little green indicator light on?\nAs background, I should tell you about the pitch I got. Product vendors often employ press representatives who reach out to journalists, writers, bloggers, and influencers, whatever you want to call us, to try to convince us to cover their products.\nBack in July, I had just published an article about finding electrical circuits in my Fab Lab when I got a pitch from a PR person saying, \"Given the Fab Lab has electronics with high electricity demand, Ting could give you some serious peace of mind, especially when you're away from home.\"\nAlso: How a circuit breaker finder helped me map my home's wiring (and why that matters)\nI have a lot of robots here. The Fab Lab (short for fabrication lab) is a room filled with 3D printers, servers, and a laser cutter. It uses quite a bit of electricity, which is why I wrote that article about mapping electrical use.\nNow, to be fair, I almost never run the Fab Lab machines when nobody is home. It has happened, but it's a very rare occurrence. Even so, my interest was piqued. I would like to know more about the power profile in my home.\nWhen the Ting device arrived, I opened it up, set it up, and plugged it in. Setting it up involves loading an app and connecting that app to my wireless network and to the device. That process works just about the same as connecting any other smart home device.\nAfter that, you wait. The device takes about seven days to \"analyze the electrical background signal levels to establish a baseline before electrical fire hazards can be detected.\" It looks for indications of electrical arcing events, which often get worse over time, leading to fires.\nI've been running the Ting for a few months now.\nHome monitoring\nFortunately, the device has done absolutely nothing. That's a good thing because it means that there's nothing wrong with the electricity or electrical circuits in my house.\nIt just sits there. Sometimes, it stares at us. It mostly minds its own business while it's minding the business of our electrical system. But there's no action. It doesn't do anything. It doesn't move. So how do I recommend it?\nAlso: 8 smart home gadgets I invested in this year - and how they're already paying off\nNormally, I do hands-on testing in my reviews, but my hands-on testing for this thing has basically amounted to keeping my hands off of it until it complains, and it hasn't complained.\nWhat it has done is send me reports. Each week, it sends me a voltage report for all seven days of the previous week. Here's one from last week.\nNotice, in particular, how quiet things are between about 3 a.m. and noon. The bigger spikes are generally indicative of major appliances drawing power or our HVAC system turning on, etc.\nAlso: How to check for electrical fire hazards at home - and my go-to smart sensor for the task\nNow, here's one from mid-August. There's a lot more activity in the middle of the night because we were running the AC during the height of the summer heat. You can see the various systems cycling on and off.\nNow check this one out. The activity is dense throughout the whole chart, including in the middle of the night. That's the Fab Lab in action. Every time a 3D printer heats up, moves its gantry, or cycles its internal temperature management, there's a change in power usage.\nApp features\nThe connected app has some other monitoring features that are… well, they could be better. One feature is real-time monitoring. Here you can see two charts.\nThe one on the left was captured for a baseline of house usage. The one on the right was captured while one of the 3D printers was active. As you can see, there's not much to see here.\nUnfortunately, the chart only shows a rolling 20 seconds of usage, so it's not easy to see any patterns or trends. I'd like to see this have a scale where you can see five minutes, 30 minutes, an hour, and maybe three hours. That way, you would be able to see any changes in electrical behavior practically as they occur.\nAlso: This new app lets you easily track power outages nearby - and it's free\nAnother heavily-touted feature is real-time data on local power outages. ZDNET's Artie Beaty showcased this a few weeks ago. He noted, \"Since the map is based on Ting devices, it might not be 100% accurate.\" Boy, is this true.\nTake a look at these two maps. The one on the left was produced by the Ting app. The one on the right was produced by my power company's app, which has an outages tab.\nObviously, there's a whole lot less information on the Ting map than on the one from the power company. I also don't like the dark gray on black style of the Ting map, because it's hard to see the location information.\nI think the idea that Ting is doing nationwide power monitoring is interesting. But until there are a ton of these devices out there, and more information is shown than is evidenced now, it's more a stunt feature than anything particularly useful for emergency management.\nRight now, if I wanted to see nationwide power outage information, I'd probably look at PowerOutage.us, which has some pretty good data. I just looked at its Oregon data and it matched that of my power company quite closely.\nZDNET's buying advice\nThe Ting electrical fire prevention sensor is $99 on Amazon. Do not confuse it with the Ting anti-fungal cream, the Ting sparkling Jamaican grapefruit drink, the Ting mango Vitamin B complex + ginseng supplement Moon Juice, the Ting Ting Jahe ginger candy, or the Ting Ao quick disconnect electrical wire harness kit. Because those are different.\nLook, the Ting sensor is interesting. There do appear to be some battle-tested examples of the value of the device.\nAccording to WashPo, Ting devices helped public officials identify the cause of an outbreak of wildfires in Hawaii. NBC News reported (buried way down in the article) that Whisker Labs (the makers of Ting) provided county-level outage data during Hurricane Milton. In July, Bloomberg reported that Ting sensors provided indicators of a major blackout in Spain hours before the crisis hit.\nSo, there is potential here. Personally, I like knowing that the sensor hasn't reported any problems. But is the Ting a substitute for bringing an electrician in to evaluate your circuits, your breaker panel, and your wiring? Absolutely not.\nIf you don't mind spending a hundred bucks for a bit more peace of mind and some possible protection, go for it. If not, both the Ting ginger candies and the Ting Jamaican grapefruit juice look good, and both are considerably less expensive. But they don't come with peace of mind, which is kind of priceless.\nTing specs\n- Requires grounded receptacle\n- Provides real-time 24/7 alerts\n- Connects via Wi-Fi (2.4 GHz or 5 GHz)\n- Requires smart phone (recent Android or iPhone)\n- Weight: 5 oz\n- Dimensions: 1.34\"D x 2.51\"W x 3.96\"H\nYou can follow my day-to-day project updates on social media. Be sure to subscribe to my weekly update newsletter, and follow me on Twitter/X at @DavidGewirtz, on Facebook at Facebook.com/DavidGewirtz, on Instagram at Instagram.com/DavidGewirtz, on Bluesky at @DavidGewirtz.com, and on YouTube at YouTube.com/DavidGewirtzTV.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-03T11:20:02.821059Z"
}