{
  "id": "latest-news-zdnet-com-2025-11-03-2d6ad819",
  "source_id": "latest-news-zdnet-com",
  "guid": "41a21989-e4c9-40c4-b4ae-3d3c3120ca3d",
  "title": "I tried a $400 Android phone that looks dull on paper, and I couldn't put it down",
  "url": "https://www.zdnet.com/article/i-tried-a-400-android-phone-that-looks-dull-on-paper-and-i-couldnt-put-it-down/",
  "published_at": "2025-11-03T09:47:27+00:00",
  "fetched_at": "2025-11-03T11:16:06.513218Z",
  "status": "rejected",
  "content": {
    "raw": "The TCL Nxtpaper 60 Ultra redefines 'Ultra,' prioritizing eye comfort and stylus performance over raw power.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI tried a $400 Android phone that looks dull on paper, and I couldn't put it down\nTCL Nxtpaper 60 Ultra\nZDNET's key takeaways\n- The TCL Nxtpaper 60 Ultra is currently available in Europe for €449 for the 256GB version or €499 for 512GB.\n- It has a large, 7.2-inch screen with a 120 Hz refresh rate that mimics an e-Ink display and a pleasant writing experience with the stylus.\n- It's not yet available in the US.\nTCL's Nxtpaper technology is truly unique, but after reviewing the TCL 60 XE Nxtpaper 5G, I realized its potential has been limited to lower-end smartphones.\nThe TCL Nxtpaper 60 Ultra changes that, integrating the latest version of Nxtpaper 4.0 technology into a larger-format mid-range device. This is not a spec-chasing flagship like the Galaxy S25 Ultra or the Pixel 10 Pro, instead positioned as an \"Ultra\" in terms of comfort and size rather than sheer performance.\nA screen built for eye comfort\nThe first thing I noticed when I unboxed the Nxtpaper 60 Ultra was its unmistakably large 7.2-inch panel, which dwarfs the Galaxy S25 Ultra I carry. One-handed use is nearly impossible, and I had to be sure my pockets could handle the footprint of the device, especially when equipped with the case that also stores a stylus.\nAlso: This $200 Android phone with a paper-like display made my Pixel look overbearing\nThe LCD panel features a 120 Hz refresh for smooth navigation, and black levels impressed me more than I expected from LCD. In fact, much of the color science resembled an OLED display. The tech that drives Nxtpaper's eye-soothing display adds extra layers on top, which can give content a subtle haze. The matte finish kills any reflections and most fingerprints, but also makes it somewhat difficult to view in direct sunlight.\nBest mobile deals of the week\n- $350 (save $50)\n- $525 (save $125)\n- $300 (save $100)\n- $338 (save $291)\nFor eye comfort, two things stand out. First, the Nxtpaper technology is effective down to around 3.4% battery life according to TCL, a feature that doesn't require color tinting or software settings.\nAnother important note is the total lack of pulse-width modulation to achieve its low brightness capability. This is great for anyone who suffers from headaches or strain from flickering displays. The panel can dim all the way down to two nits, which for me meant bedtime scrolling stayed peaceful even with the lights out.\nChanging modes at the flick of a switch\nNxtpaper devices like the 60 Ultra include a physical switch on the side to unlock different display modes with variable color characteristics, along with deeper system adjustments meant to increase battery performance and limit distraction.\nMax Ink Mode is the most drastic change, with everything turning black and white while the system is reduced to a few key apps. This mode was the perfect choice for no-distraction reading. It's not E Ink technology, but it sure looks like it, and it increases battery life to hundreds of hours on a full charge. While I didn't push it that far, I logged quite a few hours of reading and plan to take this on my upcoming trip to Ireland for exactly this purpose.\nAlso: The tablet that successfully replaced my Kindle and iPad now has a worthy follow-up\nInk Paper Mode also goes to grayscale but keeps the full Android operating system intact. I found it ideal for news and casual browsing. Switching to Google Photos or the Camera app temporarily returns the device to full color, and that sudden burst of color from black and white really helped me appreciate just how vibrant this panel can be.\nColor Paper Mode mutes saturation without eliminating it. This is perhaps my favorite mode because it keeps everything easy on the eyes while still letting me watch videos or browse Instagram without feeling like I'm using a monochromatic e-ink device.\nWriting feels great\nUsing a stylus on a smartphone isn't essential in my experience, but I appreciate the lengths TCL has gone to integrate a capable stylus experience into the 60 Ultra. The T-Pen, sold separately, uses electro-magnetic resonance, the same tech behind Wacom and Samsung's S Pen. The passive stylus has no battery, though you'd never know it. A short hover over the display presents a cursor, and the T Pen offers 4,096 levels of pressure sensitivity. I had a difficult time detecting any latency.\nAlso: I tried Meta's new Oakley smart glasses in my production studio - my verdict as a content creator\nWhat stands out is how the T Pen feels on this screen. The matte texture gives the pen paper-like friction, and I noticed a faint sound when writing that adds to the illusion.\nMy biggest frustration is that the T Pen doesn't store in the phone itself, like on Samsung's Galaxy S Ultra phones. TCL does sell a bulky case with a side-mounted attachment point, but that makes an already huge smartphone that much larger in everyday use.\nAI features fall short\nInside the Nxtpaper 60 Ultra is a MediaTek Dimensity 7400 paired with 12 gigabytes of RAM. I found this midrange chip to perform well across standard OS functions, and PUBG ran smoothly with no noticeable heat. Lag tended to creep up more when taking lots of pictures and maneuvering through the camera interface. Switching Nxtpaper display modes with the toggle also takes longer than expected.\nThe battery is a healthy 5,200 mAh, which easily lasted through full days with consistent use. Features like Max Ink Mode help relieve battery anxiety, particularly since it's a simple flick of the switch away. Wired charging tops out at 33 watts, reaching 50% in 30 minutes. However, there's no wireless charging, which feels like a missed opportunity on a phone branded as \"Ultra.\"\nAlso: I found a budget Android tablet qualified to replace my Kindle (and the price is right)\nTCL includes a handful of AI features, many of which are table stakes. Summaries, transcriptions, Magic Eraser, and Circle to Search are all present. A unique Bookshelf app appears within Max Ink Mode that can turn any book into an audiobook or two-person podcast with AI-driven text-to-speech. I could not listen to \"The Odyssey\" for more than a few minutes before becoming annoyed by the odd voice characteristics and robotic delivery.\nOn the plus side, software support is stronger than I expected. TCL promises three major Android OS updates along with seven years of security patches. That's a solid update promise for a mid-range smartphone like this one.\nA rare mid-range phone with periscope zoom\nThe rear camera system features a 50-megapixel periscope lens offering 3x optical zoom, along with 6x optical quality zoom. That lens can go all the way to 100x, although I would never recommend using those settings. Unlike Google's sharpening on 100x photos shot with the Pixel 10 Pro series, TCL's processing is harsh and unusable.\nAlso: Want the Pixel 10 Pro? I recommend buying these 5 phones instead - here's why\nThat said, I'm always happy to have an optical zoom in my toolset, and I enjoyed using the periscope for macro photography of food and flowers. The primary 50MP lens can capture nice results in good lighting, but TCL's post-processing often leaves images looking washed out. The 8MP ultrawide is forgettable and an easy tell that some corners were cut.\nZDNET's buying advice\nThe Nxtpaper 60 Ultra performs well as a less expensive alternative to the Samsung S25 Ultra, with a surprisingly capable stylus integration and an impressively differentiated display. There are compromises in the camera system, the AI features promise more than they can deliver, and the larger size might be a polarizing design choice.\nAnother big downside for US buyers is that TCL has yet to announce whether it plans to bring the phone to the States. Currently, it can be found in Europe, Latin America, and Asia-Pacific, and priced at €449 for the model with 256GB of storage, or €499 euros for 512GB.\nFollow my latest tech reviews and projects across social media. You'll find me on YouTube at YouTube.com/@JasonHowell, on X (formerly Twitter) at @JasonHowell, and on Instagram at Instagram.com/thatjasonhowell.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-03T11:19:12.750087Z"
}