{
  "id": "latest-news-zdnet-com-2025-11-03-cb08504d",
  "source_id": "latest-news-zdnet-com",
  "guid": "5f3caf62-ea18-4481-8a07-0b7762dac78a",
  "title": "Last chance to get a free year of Disney+, Hulu, and ESPN+ with Verizon home internet",
  "url": "https://www.zdnet.com/article/last-chance-to-get-a-free-year-of-disney-hulu-and-espn-with-verizon-home-internet/",
  "published_at": "2025-11-03T18:45:32+00:00",
  "fetched_at": "2025-11-04T12:51:22.629848+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "When you sign up for the new Verizon home internet Gigabit plan, you'll be eligible to get a free Nintendo Switch or a free year of Disney+, Hulu, and ESPN+ (with ads) - but this deal ends this week.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nLast chance to get a free year of Disney+, Hulu, and ESPN+ with Verizon home internet\nIt's about to become the coziest time of year -- the best time to enjoy premium streaming services. Right now, when you sign up for the new Verizon home internet Gigabit plan, you'll get a free year of Disney+, Hulu, and ESPN+. This deal ends on Wednesday, Nov. 5.\nAlso: The best early Black Friday phone deals available right now\nJack-o'-lanterns haven't even rotted yet, but winter weather is around the corner, which, if you're anything like me, means that your TV will become your BFF for the next few months. Streaming services can be impossibly expensive, but Verizon is now offering a way to get the Disney+ bundle (which includes Hulu and ESPN+) for free for an entire year.\nAlso: Expert tested: The best TVs available right now\nWhen you sign up for the new Verizon home internet 1 gigabit or 2 gigabit plans, you'll be able to choose from a number of perks, including a Nintendo Switch console, the Nintendo Switch gaming accessory bundle, a discount of $15 a month for three years, or a free year of Disney+, Hulu, and ESPN+ (with ads). You can also opt for a collection of other discounts on streaming services, such as Google One AI Premium for $10/month, Netflix and HBO Max with ads for $10/month, YouTube Premium for $10/month, and unlimited cloud storage for $10/month.\nAlso: Verizon's new phone plan starts at just $20 per month\nThese offers are available when you sign up for Verizon's home internet service under the 1 Gig ($90/month with autopay) or 2 Gig plan ($110/month with autopay), which are both guaranteed to be locked in price for the next five years. I'll note that if you choose the $15 off per month for three years perk, you won't get the year of free streaming services, but your monthly costs will be $75 for 1 Gig and $95 for 2 Gig with autopay. (If you're not enrolled in autopay it'll cost you $10 more per month for any plan.) Both plans include a router and Whole-Home Wi-Fi at no additional cost, with the 1 Gig supplying speeds of up to 940 Mbps and the 2 Gig supplying up to 2.3 Gbps.\nAlso: The best early Black Friday deals on TVs right now\nOnce the year of free Disney+, Hulu, and ESPN+ expires, you'll be able to continue the three streaming services at a discounted price of $10 each per month, and that five-year price lock guarantee is pretty enticing. Of course, paying the home internet charge of $90 per month to access the deal means you'll still need to spend a decent amount to access the perks, but if you're looking to add or upgrade your service anyway, this Verizon home internet deal is definitely one to look twice at.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.\nHow I rated this deal\nThe quality of this deal depends on how much you're willing to spend for home internet, as you'll need to pay upwards of $90 per month to get access to the \"free\" streaming services. Still, those discounts add up to over $200 saved from the streaming subscriptions themselves, and the $10/month discount after the first year is a solid lasting perk.\nWhen will this deal expire?\nThis deal expires on Nov. 5, 2025.\nHow do we rate deals at ZDNET?\nWe aim to deliver the most accurate advice to help you shop smarter. ZDNET offers 33 years of experience, 30 hands-on product reviewers, and 10,000 square feet of lab space to ensure we bring you the best of tech.\nIn 2025, we refined our approach to deals, developing a measurable system for sharing savings with readers like you. Our editor's deal rating badges are affixed to most of our deal content, making it easy to interpret our expertise to help you make the best purchase decision.\nAt the core of this approach is a percentage-off-based system to classify savings offered on top-tech products, combined with a sliding-scale system based on our team members' expertise and several factors like frequency, brand or product recognition, and more. The result? Hand-crafted deals chosen specifically for ZDNET readers like you, fully backed by our experts.",
      "enhanced_at": 1762260760.2743754,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:52:40.274728+00:00Z"
}