{
  "id": "latest-news-zdnet-com-2025-11-03-d8ceaca8",
  "source_id": "latest-news-zdnet-com",
  "guid": "6c39d49a-176f-4be1-a944-9431a3aaf6e9",
  "title": "This popular Fitbit is $80 off, and comes with a $20 Amazon credit - here's how to cash in",
  "url": "https://www.zdnet.com/article/this-popular-fitbit-is-80-off-and-comes-with-a-20-amazon-credit-heres-how-to-cash-in/",
  "published_at": "2025-11-03T21:01:48+00:00",
  "fetched_at": "2025-11-04T12:51:22.627131+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "The Fitbit Versa 4 is on sale, and this price beats out the Prime Day low.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis popular Fitbit is $80 off, and comes with a $20 Amazon credit - here's how to cash in\nFollow ZDNET: Add us as a preferred source on Google.\nIf you've been in the market for an affordable smartwatch, every Fitbit Versa 4 model is on sale for a competitive $120 -- $80 off the regular price. Plus, a sweet $20 credit saves you even more. Fitbit is one of the staple fitness and smartwatch brands, and has been around since years before many of its competitors hit the market.\nAlso: Best early Black Friday sales\nAs such, the Versa 4 is not the newest model, but it is definitely a popular one. It has over 16,000 reviews on Amazon, with a 4.5 star rating. At Walmart, it's earned a similar 4.3 star rating, with reviewers calling out the watch's feature set relative to price, and Fitbit's app, which is one of the better fitness trackers.\nAt Amazon right now, you can score an extra $20 credit to your account totally free when you purchase the Fitbit Versa 4 for 40% off. This is one of the best prices we've seen for the Versa 4. During Prime Day, it was available for $70 off, so this $80 off offer (plus free $20 credit) takes the cake. The best part is that all three color options have this same offer.\nAlso: The best smartwatches of 2025\nSo what kinds of features are we talking here? All the basic health metrics are covered in the Versa 4: 24/7 heart rate, GPS, sleep tracking and daily readiness scores, 40+ exercise modes, stress management, menstrual health tracking, mindfulness and meditation content, and more.\nPart of this is due to the maturity of the Fitbit app, which has been around long enough to improve on many of these features. The physical form of the watch follows suit. It's modest but durable, measuring 40.5mm by 40.5mm by 12.3mm with rounded-off corners.\nThe Versa 4 sports a responsive full-color touchscreen and, on the solid aluminum surround, a touch-sensitive button. The heart rate sensor on the underside, and although Fitbit doesn't use IP ratings, the company says that both devices are water-resistant up to a depth of 50m.\nAlso: Best Black Friday smartwatch and fitness tracker deals\nIn terms of battery life, the Versa 4 will easily get up to six days, but with continuous GPS on, it only lasts around 12 hours straight -- something to be mindful of if you plan on taking the watch off-grid for an extended period of time. In that sense, this is better for outdoor activities in the neighborhood or at the gym; I wouldn't bring it camping for multiple days at a time.\nThe Versa 4 has plenty of smartphone integration, including call, text, and app notifications, plus tons of clock faces for added personalization. Other than that, you can take on-wrist Bluetooth calls, utilize the built-in Alexa, Google Wallet, and Maps.\nWhen you buy the Versa 4, you'll also get a free six-month membership to Fitbit's premium plan, which includes personalized insights, advanced analytics, and guided programs. The watch comes in three colors: Black, Pink Sand, and Waterfall Blue, which is more of a blue-gray.\nAlso: I tested a Whoop alternative that's just as smart but with no subscription fees - and it's great\nIf you score this offer, your promotional credit will be automatically added to your account 30 days after shipment of your Versa 4.\nWhen that happens, you'll receive an e-mail from Amazon that indicates the dollar amount of the promotional credit and that the dollar amount of the credit has been added to your customer account. You'll also get details on how to redeem your credit. This offer doesn't apply to digial content and is only availabe while supplies last. Plus, your $20 credit expires at 11:59 p.m. PT on March 5, so you'll need to spend it before.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.\nHow I rated this deal\nI am rating this deal a 4/5 since it isn't the newest smartwatch, but it is still a great value. It is also $10 more in savings than during Prime Day, where it was $70 off. Plus, with this $20 credit, you're really grabbing $100 in savings.\nWhen will this deal expire?\nDeals are subject to sell out or expire anytime, though ZDNET remains committed to finding, sharing, and updating the best product deals for you to score the best savings. Our team of experts regularly checks in on the deals we share to ensure they are still live and obtainable. We're sorry if you've missed out on this deal, but don't fret -- we're constantly finding new chances to save and sharing them with you at ZDNET.com.\nHow do we rate deals at ZDNET?\nWe aim to deliver the most accurate advice to help you shop smarter. ZDNET offers 33 years of experience, 30 hands-on product reviewers, and 10,000 square feet of lab space to ensure we bring you the best of tech.\nIn 2025, we refined our approach to deals, developing a measurable system for sharing savings with readers like you. Our editor's deal rating badges are affixed to most of our deal content, making it easy to interpret our expertise to help you make the best purchase decision.\nAt the core of this approach is a percentage-off-based system to classify savings offered on top-tech products, combined with a sliding-scale system based on our team members' expertise and several factors like frequency, brand or product recognition, and more. The result? Hand-crafted deals chosen specifically for ZDNET readers like you, fully backed by our experts.",
      "enhanced_at": 1762260696.7719836,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:36.772310+00:00Z"
}