{
  "id": "latest-news-zdnet-com-2025-11-03-cb38ec70",
  "source_id": "latest-news-zdnet-com",
  "guid": "aea9768f-85b4-4367-bf1b-c31ab0360764",
  "title": "5 steps to fixing your business's top security risk",
  "url": "https://www.zdnet.com/article/5-steps-to-fixing-your-businesss-top-security-risk/",
  "published_at": "2025-11-03T20:42:13+00:00",
  "fetched_at": "2025-11-04T12:51:22.627901+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Weak or compromised passwords pose the greatest security risk to companies, according to a new report from password manager 1Password.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "5 steps to fixing your business's top security risk\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Weak or compromised passwords pose a significant security risk to companies.\n- Employees continue to reuse passwords or share them via email.\n- A passwordless future is possible, but it will take time and effort.\nUsing a weak or compromised password for a personal account is bad enough. But using one on the job puts not just you but your entire company at risk. That's why the practice is considered a major security threat, according to a new report from password manager 1Password.\nFor its 2025 annual report entitled \"The Access-Trust Gap,\" 1Password looked at the ways that passwords are still problematic despite an ongoing move toward passwordless authentication. The report's findings are based on the results of an online survey of 5,200 workers in the US, Canada, the UK, Germany, France, and Singapore. Those surveyed included desk job workers as well as IT and security professionals.\nAlso: How passkeys work: The complete guide to your inevitable passwordless future\nAsked what has most impacted their security team's ability to deliver adequate protection for your company, 44% of the respondents pointed to employees using weak or compromised credentials. The survey showed that employee password practices are actually getting worse instead of better with an increase in this percentage from last year's report.\nSome two-thirds of the employees admitted to reusing passwords across work and personal accounts, relying on default credentials, or sharing passwords via email or messaging apps. Ironically, IT and security professionals actually are more risky in their use of passwords than are their non-IT peers.\nAs one example, 15% of the non-IT workers polled said they've used the same passwords for work and personal accounts, while 24% of IT pros professed to doing the same thing.\nPoor password practices were evident among those polled. Only 30% of workers and 23% of IT professionals said they always use complex and unique passwords. And though password managers provide some protection against credential compromise, just 38% of the IT pros and 26% of the other workers revealed that their employer provides such a tool.\nAmong the CISOs whose companies were hit by a data breach over the past three years, 50% cited compromised credentials as a root cause, second only to exploited security vulnerabilities. Other factors that led to breaches were employees using unmanaged or unapproved applications and devices as well as data being exfiltrated.\nA passwordless future is certainly one desired by individuals and businesses alike. But the road to getting there has been bumpy. Password managers can be difficult to maintain and manage, even in an enterprise environment. And passkeys still face several hurdles before they become easy, convenient, and ubiquitous enough for more people to adopt.\nAlso: The best password managers for businesses: Expert tested\nStill, passkeys have been gaining traction in the corporate world. Some 41% of the employees surveyed said they've adopted passkeys where they're available. A healthy 89% of the security and IT pros say their company is encouraging or planning to encourage employees to shift to passkeys. Some 25% of the respondents say they would gladly switch from passwords to passkeys when and if they become available.\nThe challenge here is that jumping from passwords to passkeys isn't as simple as turning on a switch. Rather, the transition promises to be a multi-year project for most companies, who must balance their technologies, workflows, and regulatory requirements. During such a move, passwords and passkeys must coexist, which means they both need to be secure and convenient.\n\"A truly passwordless environment has long been the dream of security leaders,\" said one respondent. \"However, fully eliminating passwords is a years-long undertaking, and authentication must be as secure as possible at every step along the way.\"\nAlso: Why SMS two-factor authentication codes aren't safe and what to use instead\nToward that end, 1Password has outlined a 5-step game plan that organizations can use to carry out the transition.\n- Plan your roadmap and process. Here, you'll want to determine how you aim to replace weak passwords with strong ones, add multi-factor authentication, and move toward passwordless authentication, including passkeys.\n- Provide employees with clear guidelines and support for switching to strong passwords, MFA, and passwordless solutions.\n- Give your compliance officers the job of verifying that your passwordless system will adhere to regulatory guidelines, such as ISO, SOC 2, and GDPR.\n- With passwords still needed during the transition, make sure you use an enterprise password manager to control the use of passwords and ease the process for employees.\n- Wherever possible, get rid of risky authentication methods such as SMS codes.\nGet the biggest stories in tech every Friday with ZDNET's Week in Review newsletter.",
      "enhanced_at": 1762260704.4617026,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:44.462024+00:00Z"
}