{
  "id": "latest-news-zdnet-com-2025-11-03-2c9c449e",
  "source_id": "latest-news-zdnet-com",
  "guid": "69ba10fd-1a73-46e7-85d1-53048b75421e",
  "title": "This is the only power bank I'll ever need for traveling (especially when there's no Wi-Fi)",
  "url": "https://www.zdnet.com/article/this-is-the-only-power-bank-ill-ever-need-for-traveling-especially-when-theres-no-wi-fi/",
  "published_at": "2025-11-03T10:00:30+00:00",
  "fetched_at": "2025-11-03T11:16:06.513088Z",
  "status": "rejected",
  "content": {
    "raw": "This 20,000mAh power bank from Baeseus also features a 4G Mi-Fi SIM-free hotspot, but there's a catch.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis is the only power bank I'll ever need for traveling (especially when there's no Wi-Fi)\nBaseus EnerGeek GX11 power bank\nZDNET's key takeaways\n- The Baseus EnerGeek GX11 is a power bank and 4G hotspot in one for $129 on Amazon.\n- Its built-in SIM-free hotspot works in over 150 countries, and is a no-fuss way to get online.\n- The global data plans are pricey\n- but the regional plans are much more reasonable.\nFollow ZDNET: Add us as a preferred source on Google.\nA power bank is an imperative part of my EDC (everyday carry), whether I'm at home or abroad. Along with my smartphone, smartwatch, laptop and earbuds, my hotspot is just another device that needs charging. After all, it's easier and cheaper to have a data plan for one hotspot than it is to have one for every smartphone and tablet.\nWhat if you could combine both of these features into one device?\nAlso: The best power banks you can buy\nThis unit from Baseus not only keeps your devices powered up, but also connected to 4G. Yes, the Baseus EnerGeek GX11 power bank has a built-in hotspot, which means I can leave my hotspot device at home!\nThe EnerGeek GX11 comes in a tower form factor. Measuring 4.7 x 2 x 2 inches and weighing a shade under a pound, it's quite a beefy power bank, but packs 20,000mAh of battery capacity (small enough to take on a commercial airliner without running into regulatory headaches).\nIn practical terms, this is good for some two to three recharges of a modern smartphone. It features a total of three ports: two USB-C input/output ports (67W maximum output for a single port) and a single USB-A port (15W maximum output).\nIt can output a maximum of 67W of power, enough to charge a laptop, albeit slower than using a full-speed charger. There's also a lanyard built into the side of the unit which houses a 10 inch USB-C-to-USB-C braided cable, so you should always have at least one with you.\nSo far, nothing all that new, but let me get to its best feature. Yes, there's a built-in hotspot that works in over 150 countries. Even better, there's no SIM card to have to fiddle with and no contract to pay monthly. The unit comes with 1GB of global use data per month for the first year, and using the Baseus MiFi app (for iOS and Android) you can buy global or regional data packages.\nUsing data is easy. Flip the switch on the side of the unit, connect to the Wi-Fi signal, and away you go. Up to 10 devices can connect simultaneously, and the power bank when fully charged can run the hotspot feature for around 114 hours.\nAlso: I found a discrete gadget to track my expensive jacket, and can't travel without it\nFending off the inevitable cries of \"why not just use the hotspot facility built into your phone?\" my rebuttal is that this seriously burns through battery life, and keeping Android devices connected to an iPhone is a pain. For me, and the sort of traveling I do, an external hotspot is a better solution. That's not to say that I don't use my iPhone and its data plan, but it's not the best way to share data.\nIt all just works, smooth and simple. And on the side of the unit is the obligatory display, a small and bright one that shows the basics: battery level and whether the mobile Wi-Fi is turned on.\nAlso: The only charging adapter I ever travel with beats competing models with a hidden superpower\nMobile hotspots are one of those love/hate things. If I'm traveling alone, I'm fine with my iPhone, but once I add others into the mix, I find that a mobile hotspot makes life easier. I'm freed from having to fiddle with my hotspot on all the time (connecting Android devices to an iPhone is a faff), and my traveling buddies don't need to experience the hit of expensive roaming charges.\nZDNET's buying advice\nI quite like the Baseus EnerGeek GX11. I'm used to hotspot devices that use SIM cards and are packed with settings and features, but I'm sold on how easy this is to use. There's no tiny SIM card to fiddle with, no settings to fiddle with, and no hidden charges.\nThe plans aren't the cheapest, and the global plans to get pricey (the 100GB 3-day global package is a seriously hefty $499), but if you go for the more modest regional plans, they're pretty affordable (a seven-day 15GB European plan is $19).\nThe priciest of the plans aside, for the price of the hardware -- $129, but if you're fast there's currently 10% off on Amazon -- this is a great device for travelers who want to stay connected.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-03T11:18:59.832429Z"
}