{
  "id": "latest-news-zdnet-com-2025-11-03-846522f2",
  "source_id": "latest-news-zdnet-com",
  "guid": "4927698f-d243-4e2f-b52d-cd6a9136478a",
  "title": "The secret to a successful AI rollout? It's all about timing - and these 5 factors",
  "url": "https://www.zdnet.com/article/the-secret-to-a-successful-ai-rollout-its-all-about-timing-and-these-5-factors/",
  "published_at": "2025-11-03T11:00:00+00:00",
  "fetched_at": "2025-11-03T11:16:06.512813Z",
  "status": "rejected",
  "content": {
    "raw": "AI rollouts fail 95% of the time. Here's how to get yours right.",
    "full": "The secret to a successful AI rollout? It's all about timing - and these 5 factors\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Most AI projects get stuck at the starting gate.\n- Reaching the goal successfully is all about timing.\n- Manage change and link investments to outcomes.\nThe near-instant content-generating powers of generative AI tools, such as ChatGPT and Gemini, might lead some people to think that making the most of emerging technology is as easy as writing a good prompt and clicking a button.\nHowever, with MIT recently reporting 95% failure rates, the evidence suggests that rolling out a successful AI initiative is much tougher than you'd think. Too many projects get stuck at the starting gate due to poor integration, prioritization, and cultural concerns.\nAlso: No ROI in AI yet? Try these six proven tactics for creating real business value\nSo, how can you ensure your AI project is rolled out at the best moment? Five business leaders share their tips.\n1. Get the right speed\nKirsty Roth, chief operations and technology officer at business information services specialist Thomson Reuters, said her organization has learned some important lessons about AI product rollouts.\nMost crucially, success is related to cadence. Push out too many updates rapidly, and the people who rely on your services will get left behind.\n\"We learned that once we'd got to about the two-week rollout stage, our customers couldn't cope with changes too often. So, there's a limit to that speed of rollout, right?\"\nRoth told ZDNET that her organization has an experiment-based approach to AI project development. After exploring 200 AI use cases, her organization has pushed 70 products live.\nAlso: A minority of businesses have won big with AI. What are they doing right?\nThese products include CoCounsel Legal, a technology that uses deep research and agentic-guided workflows. The tool, which is grounded in Westlaw, the company's legal research tool and proprietary database for lawyers and legal professionals, creates citation-backed reports.\nRoth said these explorations have also taught her that a great user experience is a critical component of a well-timed rollout.\n\"Products with an incredibly intuitive UX clearly get better feedback than some of the others. And I'm not a UX expert, but I can see the difference,\" she said, adding that her organization will continue to focus on user experience in its explorations into generative and agentic AI.\n\"With some of the new technologies, that's going to be an area that we're going to continue to focus on,\" she said.\n\"I think Thomson Reuters, 24 months from now, will look richer in terms of AI. The pace of innovation continues to go up.\"\n2. Think about psychology\nDavid Walmsley, chief digital and technology officer at jewelry specialist Pandora, said the right timing for AI rollouts is connected to psychology: \"What's your ability as an organization to absorb change?\"\nWalmsley told ZDNET that the focus on cadence resonates strongly. He said it's important to consider how timing varies across functions and use cases.\n\"When it comes to digital experience, yeah, we can deploy features discreetly in different markets to different groups of customers,\" he said.\nAlso: 4 ways to turn AI into your business advantage\nWalmsley gave the example of the people who work on online customer experience, who are digital natives.\n\"They get it,\" he said. \"In a function like HR services, you might have a different type of cadence because the stakeholders are in a different frame of mind. But it's clear that understanding psychology and cadence is critical to your success.\"\n3. Focus on change management\nOrla Daly, CIO at technology specialist Skillsoft, said digital leaders must concentrate on their users' ability to absorb new services. Those who don't could see their implementations fail.\nDaly gave ZDNET the example of a recent conversation with a CIO who had created an AI-enabled user interface for salespeople to query Salesforce without accessing the application directly.\n\"The AI would also say, 'Hey, your meeting is coming up today. Here are some materials so you're prepared,'\" she said.\n\"And you would think every salesperson would lap that service up when it came to them, but they struggled mightily with adoption and getting attention.\"\nAlso: AI use is up, but organizations still aren't seeing gains, Atlassian study finds\nDaly said the key to timing AI rollouts is change management. Just as traditional IT projects have always been implemented carefully, CIOs must ensure they adhere to similar rules for explorations into emerging technology.\n\"You can't overwhelm people with change, and you have to manage it,\" she said.\nThis focus, said Daly, means a crucial set of capabilities will be significant for companies that want to time the rollout of future AI projects effectively.\n\"And it's not just technical skills,\" she said. \"As we think about AI, it's the broader skills around leadership, being able to connect it to your business strategy, and then the change management that comes around that effort.\"\n4. Prioritize simplicity\nFausto Fleites, vice president of data intelligence at gardening specialist ScottsMiracle-Gro, said digital leaders must spend time with the people who use their AI-enabled products and be sensitive to times when a change in cadence is required.\n\"You should be transparent with the consumer,\" he said. \"If the consumer is facing pressure in the way that the new services are coming out, then I don't think your pace of delivery is right.\"\nAlso: The best free AI courses and certificates for upskilling in 2025 - and I've tried them all\nIn those circumstances, Fleites encouraged CIOs to take a step back and pause the rollout of new features.\nHe gave the example of Apple and its tried-and-tested focus on simple but effective user interfaces.\n\"You need to think about simplicity and how it becomes natural,\" he said. \"So, that focus will be the guiding principle that I will follow, and that should drive whether we implement technology quickly or not.\"\n5. Link technologies to outcomes\nRupal Karia, SVP for North America, UKI, and MEA at technology firm Celonis, said the right pace of delivery depends on your customer, your environment, and what you're trying to achieve. And while dollars and cents could be a priority, it's not the only consideration.\n\"The risk with a customer is that you turn up and try to tell them the answer is how it will save money,\" he said.\n\"But sometimes, I meet a CIO and they're not as worried about money. A lot of banks are worried about regulation and ensuring they don't get fined, or someone else is worried about cash flow, or someone's worried about waiting lists, like a healthcare organization.\"\nAlso: Even the best AI agents are thwarted by this protocol - what can be done\nKaria told ZDNET that the first thing that should guide the timing of your AI project rollouts is understanding how the technology will help your business achieve its desired outcomes.\n\"Don't worry about the technology; the technology is an enabler. You're buying the outcome, and we've got to get people thinking in that mind,\" he said.\n\"It used to be the case that you were buying SAP, Microsoft, Oracle, or whatever. But now you must think about, 'What are you buying those systems to do?' Because now there are so many alternative ways of getting to that same outcome.\"",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-03T11:18:25.468010Z"
}