{
  "id": "latest-news-zdnet-com-2025-11-03-6ef5a641",
  "source_id": "latest-news-zdnet-com",
  "guid": "c0e63170-6d6a-4a8b-ba5b-829b43b11a5e",
  "title": "Is that video AI? 6 tell-tale signs it's a deepfake",
  "url": "https://www.zdnet.com/article/is-that-video-ai-6-tell-tale-signs-its-a-deepfake/",
  "published_at": "2025-11-03T10:12:57+00:00",
  "fetched_at": "2025-11-03T11:16:06.512955Z",
  "status": "rejected",
  "content": {
    "raw": "Don't be fooled. Here's how you can spot AI videos.",
    "full": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nIs that video AI? 6 tell-tale signs it's a deepfake\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET key takeaways\n- AI videos are flooding social media feeds daily.\n- It is harder than ever to tell real from fake.\n- Here's how you can distinguish what's real or not\nAI-generated videos are everywhere now -- on TikTok, YouTube, Instagram, you name it.\nWe've all seen one in our feeds at this point: a wild bear sneaks into a backyard toward a toddler, only to be heroically chased off by the family dog (what a good boy!), or an alligator returning a lost baby safely to its mother.\nAlso: I've been testing AI content detectors for years - these are your best options in 2025\nThese unbelievable videos are literally that: unbelievable, as in not real. But sometimes they're less conspicuous, like deer or rabbits jumping on trampolines, an angry preacher giving a heated sermon, or a well-known influencer doing their makeup and skincare.\nAll of these are deepfakes created with artificial intelligence, and believe it or not, they're fooling millions of people every day. New tools like OpenAI's Sora 2 and Google's Nano Banana model can generate photorealistic scenes complete with synced dialogue and sound effects. They can even feature famous or historical figures. Today, anything can be faked in a video.\nHow to spot an AI video\nScared now? If you're wondering how you can tell when a clip is actually AI-generated, don't worry. Here are some telltale signs.\n1. Glitches and continuity errors\nThe biggest giveaway is visual glitches. If you inspect frames closely, you might catch bizarre anomalies.\nFor example, an AI-generated video that went viral with over 9.5 million likes on TikTok shows a polar bear cub being \"rescued\" at sea with Titanic's theme music playing in the background. Convincing at a glance, but eagle-eyed viewers noticed the cub momentarily morphs into a dog and sprouts an extra paw for a few frames.\nAlso: I tested Sora's new 'Character Cameo' feature, and it was borderline disturbing\nIn yet another video of a bear encounter, the back end of a car seems to get all fuzzy and fade in and out of the frame as the wild animal moves in front of it. Or this video, where hundreds of American bald eagles land on vehicles and supposedly block traffic for hours. You can clearly see the video frames glitching on the right.\nTake a close look at the shadows, reflections, and lighting in a suspicious video. Does everything line up consistently? Sometimes it's more obvious, like people's faces in the background suddenly looking garbled. Distorted subjects, elements flickering in and out of existence, or erratic movements are signs of AI footage.\n2. Low-res, bad-quality footage\nNearly everyone today has a 4K camera in their pocket, on their porch, or watching their driveway. Even your grandma's doorbell can shoot video crisp enough to be on TV.\nSo when you stumble across a \"mind-blowing\" clip that looks like it was filmed on your uncle's handheld camcorder from 1992, it might be time to take a beat and ask yourself, \"Why does this footage look like it was uploaded from a potato?\" Because in 2025, no real video should look that chopped.\nAlso: This new most popular AI image and video generator has enterprise users flocking to it\nFor instance, that grainy AI video of former President Barack Obama \"giving a secret speech,\" or the \"cell phone footage\" of a tornado tearing through town -- with pixels the size of Legos -- yeah, those are red flags. The same goes for that V-shaped UFO caught hovering over Los Angeles. They're all bad.\nIf you're watching something wild and unbelievable, but it's weirdly low-quality, there's a good chance it's AI.\n3. Uncanny, hyper-realistic appearance\nOK, I've talked about how obviously bad videos are often AI, but sometimes AI can look too good -- so good it almost crosses into uncanny territory.\nTake this video of parents cuddling their babies. Everyone's skin is poreless, the lighting looks like it came straight out of a movie, and, somehow, no one blinks at the right time. Or this one of someone getting a facial at a spa, or this one of President Donald Trump getting an orange spray tan (yes, really).\nAlso: Are Sora 2 and other AI video tools risky to use? Here's what a legal scholar says\nHere's another video of a baby putting on lipstick and babbling into a phone. They're all so hyperrealistic, it's like they're animated. That's because they are -- they're generated by AI.\nIn my opinion, these kinds of AI videos are actually more obvious than many of the other examples I've shared -- precisely because they're too perfect. But you'd be surprised how many people still fall for them, especially when the internet keeps churning them out faster than anyone can fact-check.\n4. Oddly slow, dreamlike videos\nAnother clue that a video might be AI is its overall speed, fluidity, and cinematic-like quality.\nHave you noticed how many of these AI clips have a strangely dreamy appearance? This technique certainly adds a vibe that grabs viewers, like something right out of a movie. But it's AI.\nAlso: I'm an AI tools expert, and these are the 4 I pay for now (plus 2 I'm eyeing)\nA perfect example is all those \"historical\" POV videos you see on social media -- like people walking through Pompeii on the day Mount Vesuvius erupted. Or never-before-seen footage of the movie Titanic, from Rose's perspective. Not only are they hyperrealistic and almost animated-looking, but the frame rate and pacing are off.\nThe camera movement is too smooth, and there's often a subtle slow-mo effect that gives everything an eerie polish. These aren't movie scenes filmed by Hollywood -- they're deepfakes.\nThese clips might seem obvious to some now, but when they first started showing up, they fooled plenty of people.\n5. Audio syncing issues\nBeyond your eyes, you can use your ears to spot AI videos. Audio can be a real giveaway when it comes to deepfakes. If someone is speaking, watch closely to see if their mouth movements truly align with the words.\nOften, you'll notice slight lip-sync issues. The timing is just a bit off, or the mouth shapes don't quite match the speech sounds. For example, take this video of a woman running from a tsunami. It just doesn't sound right.\nAlso: Adobe Firefly can generate royalty-free music for your videos in seconds now - here's how\nThis kind of AI video is especially common with politicians and celebrities. People love taking what looks like a real clip of them and making them say wildly inappropriate things -- like this video of former President Joe Biden giving a speech. While the footage might look like him and the voice might sound like him, look closer and you'll see the lips and jaw movement are slightly off. These issues are just enough to feel unsettling to our brains.\nAnd beyond the voice, listen for the setting. Are the background noises right? Sometimes deepfake audio lacks the natural ambient sounds or echoes you'd expect from a real environment. There might not even be sound on some AI videos, such as this clip of actor Brad Pitt giving actress Jennifer Aniston a haircut.\n6. It's too out there to be true\nLast but not least, ask yourself if what you just watched seems even remotely possible or too funny, cute, or amazing to be real. It probably is, if that's the case.\nI remember last year, when those videos of babies walking the runway started popping up, my aunt shared one on Facebook and gushed about how adorable it was to see the babies all dressed up like tiny models. Seriously.\nAlso: I tried the new Sora 2 to generate AI videos - and the results were pure sorcery\nThe thing is, babies this age usually can't walk yet, at least not that well. That issue should've been the first red flag. But AI is good at playing on our emotions, especially when it comes to adorable, hilarious, or shocking content.\nEven when it's not as blatantly impossible as runway-walking infants, the same rule applies. Maybe it's a video of animals pulling off heroic stunts, performing suspiciously well-timed tricks, or just acting ridiculous.\nTake that viral clip of cats running all over a woman in bed at night, for instance. It tricked millions of people into thinking it was genuine -- until someone revealed it was AI-generated.\nFAQs\nAre there tools to detect AI videos?\nYes. A few AI detection tools exist.\nThe AI cybersecurity firm CloudSEK released a Deepfake Analyzer that scans video frames for signs of manipulation. In tests, it successfully flagged viral AI videos like that fake polar bear rescue (it gave the clip a 57% \"likely AI\" score).\nAlso: You can try Google's viral image editing tool right in Search now - here's how\nThere are other services like WasItAI or AI-or-Not that allow you to upload frames or videos to check if they are AI-generated. These tools look for the kinds of inconsistencies I talked about above, but from my experience, they can be hit or miss.\nFor example, an entirely AI-generated Coca-Cola commercial fooled CloudSEK's detector into thinking it was likely human-made.\nWhat about watermarks on AI videos?\nI didn't mention this as a telltale sign because it should be obvious. But if a video has a logo floating across it, like a Sora watermark, it's AI. Sometimes, if you're caught up in the moment, they're easy to miss. But once you start looking for them, they really stand out.\nWant more stories about AI? Check out AI Leaderboard, our weekly newsletter.",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "enhanced",
  "content_fetch_method": "trafilatura",
  "processing_metadata": {},
  "updated_at": "2025-11-03T11:18:43.360751Z"
}