{
  "id": "latest-news-zdnet-com-2025-11-03-b77f4f07",
  "source_id": "latest-news-zdnet-com",
  "guid": "050a8e6f-d93c-4299-82c9-557b505e58cd",
  "title": "Own a Samsung smartwatch? These 8 features and settings are very useful (but often overlooked)",
  "url": "https://www.zdnet.com/article/own-a-samsung-smartwatch-these-8-features-and-settings-are-very-useful-but-often-overlooked/",
  "published_at": "2025-11-03T20:56:00+00:00",
  "fetched_at": "2025-11-04T12:51:22.627399+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Samsung's Galaxy Watch series features the latest and greatest Android software, resulting in key features that you should be taking advantage of.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Own a Samsung smartwatch? These 8 features and settings are very useful (but often overlooked)\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Samsung's Galaxy Watch 8 and Ultra offer the best of both Samsung and Google.\n- These features are compatible with the Classic model featuring a rotating bezel, the sleeker Watch 8, and the rugged Galaxy Watch Ultra.\n- The Galaxy Watch 8 series and Ultra are compatible with all Android phones and offer a high level of personalization.\nSamsung's Galaxy Watch 8 and Ultra are arguably among the best Google Wear watches available today, and can be found with compelling discount offers and trade-in deals from Samsung. In addition to featuring the best of Google, the watches also incorporate Samsung functions and features to enhance the overall experience.\nWith three Samsung Galaxy watches available, there is a watch to fit any wrist size and match your preferred styling. I love the rotating bezel of the Galaxy Watch 8 Classic, but keep going back to the blue 2025 Watch Ultra due to the advanced safety features, large size, and rugged build.\nAlso: The best Android smartwatches you can buy - one now supports satellite SOS\nLet's take a closer look at some functions and features that help you make the most of your Galaxy Watch experience. If you have others to add to the list, please share them here for all of us to enjoy.\n1. Watch face optimization\nOne of the easiest ways to personalize your Galaxy Watch and also enhance its efficiency is to set up your preferred watch face. There are thousands of watch face options, and with the ability to use your own photos as watch face backgrounds, the watch face you have can be unique to your watch. There are a couple I recommend you try out as you explore the options available to you.\nUse the Heritage Classic watch face and then customize it to your delight, including having your own image as part of the background. To enjoy one of the coolest effects available from Samsung, go to the low-light mode setting and select the auto option. Now, when the lights go out, the entire display changes to a cool 80s luminescent glowing color.\nAlso: Own a Samsung watch? My 30-second routine keeps the system running like new\nAlso consider trying the Daily Dashboard watch face, which dynamically changes its background color according to the time of day. You can also add up to eight complications on this watch face for ultimate productivity and efficiency. The number of available complications increases as you install apps on your watch, and in my case, there are more than 50 to choose from.\n2. Gestures for quick action\nApple offers several gestures for Apple Watch users, but Google has not yet implemented gesture support on its Pixel Watch. Thankfully, Samsung has long been known for utilizing gestures, including air movements with the S Pen, and there are plenty of options available for the Galaxy Watch.\nThe basic gesture is a double pinch with your index finger and thumb, which is available to answer a call, turn off an alarm, capture a photo, scroll through notifications, and more. You can also rotate your wrist twice, also known as a shake, to reject a call, dismiss an alert, or go back to the watch face after checking notifications.\nAlso: These Galaxy S26 rumors hint at Samsung making a big performance bet - will it pay off?\nAnother gesture that I don't use often, since I have yet to see reliable performance, is the knock gesture, where you make a fist and bend it down and then up quickly two times in a row. The knock gesture can be customized to launch an app or perform a single action in the settings.\nOne last gesture option that really sets Samsung apart from others is the ability to create universal, custom gestures. Note that these gestures are not supported when a pattern security lock is enabled on your watch. The settings for universal gestures are located in the accessibility area and are primarily designed to help users interact with their Galaxy Watch primarily through gestures, rather than requiring tapping and swiping on the display.\n3. Stack your Tiles\nGoogle's new Material Expressive Tiles are functional and lovely, but Samsung takes Tiles to the next level with stackable Tiles. I recommend using the Galaxy Wearable app on your connected Android phone to create and organize your Tiles in the most efficient manner. All of the work you do to create these Tiles on your phone will sync over to the watch.\nGo into the Tiles settings in the Galaxy Wearable app, and then you can add up to 11 widgets to each individual tile. On your smartphone, you will see an outline of the round watch face, allowing you to preview the information that will be displayed on the watch.\nSometimes, you will see multiple widgets at once. In other cases, especially if you have 11 widgets on one tile, you simply swipe up and down on that tile on your watch face to view the widget content. Note that some app tile options only support one widget per tile.\nAlso: A week with this Samsung smart monitor convinced me I might be done with TVs\nWidgets are available for Samsung Health, Samsung apps, Google apps, and other third-party apps where the developer has enabled a Tiles widget option. I have Tiles for health metrics, workout functions, weather, and calendar information, communications-related functions, alarms, and one for various utilities that include the voice recorder, camera controller, calculator, and more. With the intentional setup of your Tiles, you rarely need to open the app launcher to perform functions on your Galaxy Watch.\n4. Customize the app launcher\nAs much as I like the Pixel Watch 4, Google organizes all your watch apps in alphabetical order and does not offer a way to customize the placement of these shortcuts. You can view in list or icon format, but that's it. Thankfully, Samsung allows you to fully customize the organization of your apps.\nSimilar to my recommendation for the Tiles, you should use the Galaxy Wearable smartphone app to organize these rather than working on the smaller watch display.\nOpen up the Apps screen utility on your connected Android phone. There is a toggle to show featured apps based on your usage up top, so that may be something to try to improve your efficiency. You can also choose to show your apps in grid or list form. Note that if you select the list form, all your apps will be displayed in alphabetical order.\nThe real superpower is the ability to touch, hold, and drag the app shortcut anywhere on the app's screen when in grid mode. With Samsung, you can even drag the shortcut over the top of another and create folders for your apps. If you have ever seen my smartphone home screens, you'll notice that they are all organized into folders, and I do the same thing here with watch apps.\n5. Focus on exercise\nThe Samsung Galaxy Watch is an excellent fitness watch that can track metrics for over 90 sports and activities. With numerous options available, it can be overwhelming and time-consuming to scroll through them all to find your preferred activities. Thankfully, there is a way to customize the experience and improve your ability to get started quickly.\nAlso: Samsung Galaxy Buds 3 Pro vs. Apple AirPods Pro 3: I compared both, and this one wins\nGo to the Samsung Health app on your connected Android smartphone and then tap on the three-dot/line menu at the far right of the exercise widget. Scroll through the list of exercises and add up to three of them as your favorites by tapping on the star icon. You can also rearrange these favorites using the three-dot menu.\nThen, below the favorites, all of the other available exercises and activities will appear. You can hide any you never participate in and also add as many as you like below the favorites. Exercises can be chosen from a list created manually by you, as well as workout routines. These other exercises can also be organized in a manner that matches your participation. All of these Samsung Health customizations will be synced to your watch for easy access.\n6. Use those hardware buttons\nGestures can be very useful, but don't forget there are also three buttons available on the Galaxy Watch 8 and Ultra. The center (Quick) button can be set up to launch an exercise, turn on the flashlight, open the camera controller, and more. A short or double-press action will perform the action. You cannot set up different actions for short or double presses, so the Quick button is used for a single action.\nAlso: Which smartwatch has the best safety features? I tested them all, and here's how Google fares\nThe top button can be set up to perform functions with a double press and a long press. The double press action supports opening any application on your watch, as well as some utilities, such as Water Lock or the most recent app. The long-press action only supports Gemini, Bixby, and the power-off menu. A brief press of the top button returns you to the watch face and is a default setting that cannot be changed.\nThe bottom button's short-press action can be set to go to the previous screen (back) or show your recent apps. A long press of the bottom button launches Samsung Wallet, and this can not be modified in the settings.\n7. Quick panel tweaks\nWhen you swipe down from the top of the watch face, the Quick panel appears. Six icons appear on the watch face, and then swiping from right to left moves to other displays, if you have them set up.\nUsing either the Galaxy Wearable smartphone app or the watch itself, you can add, remove, and reorganize these icons and associated utilities. There are options for the flashlight, settings access, sound mode, airplane mode, Find My Phone, and many more. Set these up to improve your efficiency with the phone.\n8. Use modes or create one\nIn my experience, Samsung excels at mode management and creation to help your devices perform how you want and when you want. Modes can be synced between your phone and Galaxy Watch, allowing for quick access to sleep, theater, work, commute, relax, and more, to perform as desired.\nAlso: Samsung phones have a secret Wi-Fi menu that can solve your internet problems - how to enable it\nGo into the Modes and Routines option in the Galaxy Wearable app on your smartphone and then tap the Modes and Routines hyperlink at the bottom of the display. This will open the utility on your phone, and here you can customize the existing modes and even create your own.\nWhen creating a custom mode, set up the mode's start conditions (which can be a specific time, location, or condition) and then specify the mode's actions. There are a large number of actions available for the mode, including opening an app, adjusting the volume, changing the display, and more.\nOne reason I enjoy Samsung devices is the vast array of customization options available to optimize your experience. It can be overwhelming at times, and I hope that some of these tips and tricks help you get the most out of your Galaxy Watch. However, be sure to explore the settings and options further for even more benefits. If you have some favorite features I didn't cover, please share in the comments below.",
      "enhanced_at": 1762260699.586168,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:39.586502+00:00Z"
}