{
  "id": "security-affairs-securityaffairs-co-2025-11-03-aa88baa8",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184158",
  "title": "Jabber Zeus developer ‘MrICQ’ extradited to US from Italy",
  "url": "https://securityaffairs.com/184158/cyber-crime/jabber-zeus-developer-mricq-extradited-to-us-from-italy.html",
  "published_at": "2025-11-03T19:37:18+00:00",
  "fetched_at": "2025-11-04T12:51:00.752222+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Ukrainian Yuriy Rybtsov, aka MrICQ, a suspected Jabber Zeus developer, was extradited from Italy to the US to face cybercrime charges. Ukrainian national Yuriy Igorevich Rybtsov (41), aka MrICQ, an alleged Jabber Zeus developer, was arrested in Italy, lost his extradition appeal, and has been sent to the US to face cybercrime charges. After a decade-long global manhunt, “MrICQ,” is now in a Nebraska prison awaiting trial. The 2012 DOJ indictment named him “John Doe #3.” &#8220;The 2012 indictment targeting the Jabber Zeus crew named MrICQ as “John Doe #3,” and said this person handled incoming notifications of newly compromised victims. The Department of Justice (DOJ) said MrICQ also helped the group launder the proceeds of their heists through electronic currency exchange services.&#8221; reported Brian Krebs. &#8220;Two sources familiar with the Jabber Zeus investigation said Rybtsov was arrested in Italy, although the exact date and circumstances of his arrest remain unclear. A summary of recent decisions (PDF) published by the Italian Supreme Court states that in April 2025, Rybtsov lost a final appeal to avoid extradition to the United States.&#8221; Jabber Zeus, a variant of Zeus banking Trojan, acted as a full cybercrime ecosystem. Its standout feature, called Leprechaun, was a real-time Jabber alert system; whenever a victim entered a one-time password (OTP) on a fake banking page, operators were instantly notified. The Jabber Zeus group targeted small to mid-sized businesses using the Zeus banking trojan to steal credentials. The crew used the malware to capture account numbers, passwords, PINs, and other sensitive data. They then used social engineering and the stolen info to make fraudulent transfers to U.S. bank accounts controlled by money mules. The Jabber Zeus gang stole millions from victims’ accounts, using money mules to withdraw or transfer funds overseas, defrauding banks including Bank of America, KeyBank, and others. Rybtsov arrived in Nebraska on October 9 under an FBI warrant. He shared a Donetsk building with Jabber Zeus leader Vyacheslav “Tank” Penchukov, who was arrested in 2022 and sentenced to 18 years plus $73M restitution. Other Jabber Zeus members, including Maksim Yakubets, who later founded the cybercrime group Evil Corp, which shifted from using the Dridex trojan to launching ransomware attacks. Follow me on Twitter: @securityaffairs and Facebook and Mastodon Pierluigi Paganini (SecurityAffairs – hacking, Jabber Zeus)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Ukrainian national Yuriy Igorevich Rybtsov (41), aka MrICQ, an alleged Jabber Zeus developer, was arrested in Italy, lost his extradition appeal, and has been sent to the US to face cybercrime charges.\nAfter a decade-long global manhunt, “MrICQ,” is now in a Nebraska prison awaiting trial. The 2012 DOJ indictment named him “John Doe #3.”\n“The 2012 indictment targeting the Jabber Zeus crew named MrICQ as “John Doe #3,” and said this person handled incoming notifications of newly compromised victims. The Department of Justice (DOJ) said MrICQ also helped the group launder the proceeds of their heists through electronic currency exchange services.” reported Brian Krebs. “Two sources familiar with the Jabber Zeus investigation said Rybtsov was arrested in Italy, although the exact date and circumstances of his arrest remain unclear. A summary of recent decisions (PDF) published by the Italian Supreme Court states that in April 2025, Rybtsov lost a final appeal to avoid extradition to the United States.”\nJabber Zeus, a variant of Zeus banking Trojan, acted as a full cybercrime ecosystem. Its standout feature, called Leprechaun, was a real-time Jabber alert system; whenever a victim entered a one-time password (OTP) on a fake banking page, operators were instantly notified.\nThe Jabber Zeus group targeted small to mid-sized businesses using the Zeus banking trojan to steal credentials. The crew used the malware to capture account numbers, passwords, PINs, and other sensitive data. They then used social engineering and the stolen info to make fraudulent transfers to U.S. bank accounts controlled by money mules.\nThe Jabber Zeus gang stole millions from victims’ accounts, using money mules to withdraw or transfer funds overseas, defrauding banks including Bank of America, KeyBank, and others.\nRybtsov arrived in Nebraska on October 9 under an FBI warrant. He shared a Donetsk building with Jabber Zeus leader Vyacheslav “Tank” Penchukov, who was arrested in 2022 and sentenced to 18 years plus $73M restitution.\nOther Jabber Zeus members, including Maksim Yakubets, who later founded the cybercrime group Evil Corp, which shifted from using the Dridex trojan to launching ransomware attacks.\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n(SecurityAffairs – hacking, Jabber Zeus)",
      "enhanced_at": 1762260723.1130404,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:52:03.113367+00:00Z"
}