{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-03-d0a7f1f2",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/wyden-letter-ftc-flock-safety-investigate-cybersecurity-practices",
  "title": "Lawmakers ask FTC to probe Flock Safety’s cybersecurity practices",
  "url": "https://therecord.media/wyden-letter-ftc-flock-safety-investigate-cybersecurity-practices",
  "published_at": "2025-11-03T19:53:03+00:00",
  "fetched_at": "2025-11-04T12:50:12.940393+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Questioning how Flock Safety protects sensitive user accounts, Sen. Ron Wyden and Rep. Raja Krishnamoorthi want the FTC to investigate the police surveillance tech provider.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Lawmakers ask FTC to probe Flock Safety’s cybersecurity practices\nCongressional Democrats want the Federal Trade Commission (FTC) to investigate the police surveillance technology company Flock Safety for reportedly poor cybersecurity practices.\nFlock Safety does not require law enforcement customers to use multi-factor authentication (MFA), and its voluntary authentication mechanism does not “natively support” phishing- resistant MFA, according to a letter Sen. Ron Wyden (D-OR) and Rep. Raja Krishnamoorthi (D-IL) sent on Monday to FTC Chairman Andrew Ferguson.\nAt least 35 Flock customer accounts have reportedly been stolen by hackers, according to the letter, which cited data from the cybersecurity company Hudson Rock. Phishing-resistant MFA can help shield accounts from breaches.\nFlock’s automated license plate reader cameras are now used in more than 8,000 communities nationwide and have become controversial as reports have surfaced of their being used in investigations of abortion patients and undocumented immigrants.\nFlock accounts can be used to track the locations of millions of Americans at any time, the letter notes.\n“Flock has received vast sums of taxpayer money to build a national surveillance network,” the letter says. “But Flock’s cavalier attitude towards cybersecurity needlessly exposes Americans to the threat of hackers and foreign spies tapping this data.”\nIn at least four instances, the FTC has issued enforcement actions against companies for failing to use MFA, the letter says, citing agency settlements with Uber, Cheff, Drizly and Blackbaud.\nFlock’s lack of mandatory MFA has allowed law enforcement to see other agencies’ Flock data through improper password sharing, the letter said. As a result, federal agents can access Flock’s systems using passwords belonging to other users without detection, raising “serious questions about the effectiveness of Flock’s cybersecurity defenses,” the letter says.\nA spokesperson for the FTC did not respond to a request for comment. Flock Safety also did not respond to a request for comment.\nSuzanne Smalley\nis a reporter covering privacy, disinformation and cybersecurity policy for The Record. She was previously a cybersecurity reporter at CyberScoop and Reuters. Earlier in her career Suzanne covered the Boston Police Department for the Boston Globe and two presidential campaign cycles for Newsweek. She lives in Washington with her husband and three children.",
      "enhanced_at": 1762260711.918065,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:51.918398+00:00Z"
}