{
  "id": "the-record-from-recorded-future-news-therecord-media-2025-11-03-934c71cb",
  "source_id": "the-record-from-recorded-future-news-therecord-media",
  "guid": "https://therecord.media/crypto-heist-balancer-exploit",
  "title": "More than $100 million stolen in exploit of Balancer DeFi protocol",
  "url": "https://therecord.media/crypto-heist-balancer-exploit",
  "published_at": "2025-11-03T21:27:25+00:00",
  "fetched_at": "2025-11-04T12:50:12.940096+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Hackers pilfered millions of dollars worth of cryptocurrency on Monday from the decentralized finance protocol Balancer.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "More than $100 million stolen in exploit of Balancer DeFi protocol\nHackers pilfered millions of dollars worth of cryptocurrency on Monday from the decentralized finance protocol Balancer.\nEstimates varied but most blockchain security firms tracked more than $120 million in losses. At least $99 million of the stolen funds were in ETH.\nA mainstay in the DeFi industry, Balancer initially said it is aware of the exploit and is investigating it. Cryptocurrency security experts said the incident was traced back to faulty access control mechanisms that were compromised by the attackers.\nBy Monday afternoon, the company released a longer message explaining the incident began in the early morning.\n“Any pools that could be paused have been paused and are now in recovery mode,” the company said, noting that it has ties to several other crypto platforms that they could not unilaterally pause.\n“Balancer is committed to operational security, has undergone extensive auditing by top firms, and had bug bounties running for a long time to incentivize independent auditors. We are working closely with our security and legal teams to ensure user safety and are conducting a swift & thorough investigation.”\nThey are still working with experts to examine what happened and plan to release a post-mortem at some point.\nBalancer warned users that fraudulent messages claiming to be from the company’s security team are circulating and should not be interacted with.\nSeveral other blockchain organizations tied to Balancer announced efforts to address the incident. The Berachain Foundation said it halted its network as its team took emergency measures to protect user assets. The organization was able to freeze some funds stolen from its platform. Other crypto platforms like Gnosis, Sonic, Beefy and others have taken similar measures.\nBalancer has had several minor security incidents in the past but had been audited about 10 times by blockchain security firms.\nLast week, hackers stole about $10.8 million from another DeFi platform called Garden Finance.\nMore than $2 billion in cryptocurrency was stolen by hackers in the first half of 2025, according to the blockchain security firm Chainalysis.\nMost of the funds were stolen by hackers allegedly connected to North Korea’s government — which has made crypto theft a key source of revenue for its ballistics missile program.\nA report released last week by the governments of the U.S., France, Germany, Japan and others said North Korea was responsible for stealing at least $1.65 billion in cryptocurrency from January to September 2025.\nJonathan Greig\nis a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.",
      "enhanced_at": 1762260692.9182744,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:32.918622+00:00Z"
}