{
  "id": "the-hacker-news-feeds-feedburner-com-2025-11-03-e1add2ce",
  "source_id": "the-hacker-news-feeds-feedburner-com",
  "guid": "https://thehackernews.com/2025/11/malicious-vsx-extension-sleepyduck-uses.html",
  "title": "Malicious VSX Extension \"SleepyDuck\" Uses Ethereum to Keep Its Command Server Alive",
  "url": "https://thehackernews.com/2025/11/malicious-vsx-extension-sleepyduck-uses.html",
  "published_at": "2025-11-03T18:08:00+00:00",
  "fetched_at": "2025-11-04T12:47:48.562106+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Cybersecurity researchers have flagged a new malicious extension in the Open VSX registry that harbors a remote access trojan called SleepyDuck. According to Secure Annex's John Tuckner, the extension in question, juan-bianco.solidity-vlang (version 0.0.7), was first published on October 31, 2025, as a completely benign library that was subsequently updated to version 0.0.8 on November 1 to",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Cybersecurity researchers have flagged a new malicious extension in the Open VSX registry that harbors a remote access trojan called SleepyDuck.\nAccording to Secure Annex's John Tuckner, the extension in question, juan-bianco.solidity-vlang (version 0.0.7), was first published on October 31, 2025, as a completely benign library that was subsequently updated to version 0.0.8 on November 1 to include new malicious capabilities after reaching 14,000 downloads.\n\"The malware includes sandbox evasion techniques and utilizes an Ethereum contract to update its command and control address in case the original address is taken down,\" Tuckner added.\nCampaigns distributing rogue extensions targeting Solidity developers have been repeatedly detected across both the Visual Studio Extension Marketplace and Open VSX. In July 2025, Kaspersky disclosed that a Russian developer lost $500,000 in cryptocurrency assets after installing one such extension through Cursor.\nIn the latest instance detected by the enterprise extension security firm, the malware is triggered when a new code editor window is opened or a .sol file is selected.\nSpecifically, it's configured to find the fastest Ethereum Remote Procedure Call (RPC) provider to connect to in order to obtain access to the blockchain, initialize contact with a remote server at \"sleepyduck[.]xyz\" (hence the name) via the contract address \"0xDAfb81732db454DA238e9cFC9A9Fe5fb8e34c465,\" and kicks off a polling loop that checks for new commands to be executed on the host every 30 seconds.\nIt's also capable of gathering system information, such as hostname, username, MAC address, and timezone, and exfiltrating the details to the server. In the event the domain is seized or taken down, the malware has built-in fallback controls to reach out to a predefined list of Ethereum RPC addresses to extract the contract information that can hold the server details.\nWhat's more, the extension is equipped to reach a new configuration from the contract address to set a new server, as well as execute an emergency command to all endpoints in the event that something unexpected occurs. The contract was created on October 31, 2025, with the threat actor updating the server details from \"localhost:8080\" to \"sleepyduck[.]xyz\" over the course of four transactions.\nIt's not clear if the download counts were artificially inflated by the threat actors to boost the relevance of the extension in search results – a tactic often adopted to increase the popularity so as to trick unsuspecting developers into installing a malicious library.\n\"The download counts likely are manipulated making it hard to know exactly,\" Tuckner told The Hacker News. \"This is very likely done to make it more relevant in the search results for Cursor/Open VSX.\"\nThe development comes as the company also disclosed details of another set of five extensions, this time published to the VS Code Extension Marketplace by a user named \"developmentinc,\" including a Pokémon-themed library that downloads a batch script miner from an external server (\"mock1[.]su:443\") as soon as it's installed or enabled, and executes it using \"cmd.exe.\"\nThe script file, besides relaunching itself with administrator privileges using PowerShell and configuring Microsoft Defender Antivirus exclusions by adding every drive letter from C: through Z:, downloads a Monero mining executable from \"mock1[.]su\" and runs it.\nThe extensions uploaded by the threat actor, now no longer available for download, are listed below -\n- developmentinc.cfx-lua-vs\n- developmentinc.pokemon\n- developmentinc.torizon-vs\n- developmentinc.minecraftsnippets\n- developmentinc.kombai-vs\nUsers are advised to exercise caution when it comes to downloading extensions, and make sure that they are from trusted publishers. Microsoft, for its part, announced back in June that it's instituting periodic marketplace-wide scans to protect users against malware. Every removed extension from the official marketplace can be viewed from the RemovedPackages page on GitHub.",
      "enhanced_at": 1762260772.682894,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:52:52.683199+00:00Z"
}