{
  "id": "zack-whittaker-author-at-techcrunch-techcrunch-com-2025-11-03-b5b95e41",
  "source_id": "zack-whittaker-author-at-techcrunch-techcrunch-com",
  "guid": "https://techcrunch.com/?p=3064599",
  "title": "DOJ accuses US ransomware negotiators of launching their own ransomware attacks",
  "url": "https://techcrunch.com/2025/11/03/doj-accuses-us-ransomware-negotiators-of-launching-their-own-ransomware-attacks/",
  "published_at": "2025-11-03T19:46:12+00:00",
  "fetched_at": "2025-11-04T12:50:15.013290+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Three people, including two U.S. ransomware negotiators, are accused of working on behalf of the ALPHV/BlackCat ransomware gang.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "U.S. prosecutors have charged two rogue employees of a cybersecurity company that specializes in negotiating ransom payments to hackers on behalf of their victims with carrying out ransomware attacks of their own.\nLast month, the Department of Justice indicted Kevin Tyler Martin and another unnamed employee, who both worked as ransomware negotiators at DigitalMint, with three counts of computer hacking and extortion related to a series of attempted ransomware attacks against at least five U.S.-based companies.\nProsecutors also charged a third individual, Ryan Clifford Goldberg, a former incident response manager at cybersecurity giant Sygnia, as part of the scheme.\nThe three are accused of hacking into companies, stealing their sensitive data, and deploying ransomware developed by the ALPHV/BlackCat group.\nThe ALPHV/BlackCat gang operates as a ransomware-as-a-service model, in which the gang develops the file-encrypting malware used to steal and scramble the victims’ data, while its affiliates — such as the three individuals indicted — carry out the hacks and deploy the gang’s ransomware. The gang then takes a cut of the profits made from any ransom payments.\nAccording to an FBI affidavit filed in September, the rogue employees received more than $1.2 million in ransom payments from one victim, a medical device maker in Florida. They also targeted several other companies, including a Virginia-based drone maker and a Maryland-headquartered pharmaceutical company.\nThe Chicago Sun-Times first reported the indictment on Sunday.\nSygnia chief executive Guy Segal confirmed to TechCrunch that Goldberg was a Sygnia employee and was terminated after Sygnia learned of his alleged involvement with the ransomware attacks. The company declined to comment further, citing the FBI’s ongoing investigation.\nDigitalMint president Marc Grens told TechCrunch that Martin was an employee at the time of the alleged hacks but said Martin was “acting completely outside the scope of his employment.”\nGrens also confirmed that the unnamed individual may be a former employee. DigitalMint is also cooperating with the government’s investigation, said Grens.",
      "enhanced_at": 1762260718.3865185,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:58.386828+00:00Z"
}