{
  "id": "zack-whittaker-author-at-techcrunch-techcrunch-com-2025-11-03-379a89b4",
  "source_id": "zack-whittaker-author-at-techcrunch-techcrunch-com",
  "guid": "https://techcrunch.com/?p=3064701",
  "title": "Lawmakers say stolen police logins are exposing Flock surveillance cameras to hackers",
  "url": "https://techcrunch.com/2025/11/03/lawmakers-say-stolen-police-logins-are-exposing-flock-surveillance-cameras-to-hackers/",
  "published_at": "2025-11-03T22:53:50+00:00",
  "fetched_at": "2025-11-04T12:50:15.012933+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Flock said around 3% of its law enforcement customers do not use multi-factor authentication, potentially leaving dozens of law enforcement agency accounts open to compromise and improper access.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {},
  "updates": {
    "content": {
      "full": "Lawmakers have called on the Federal Trade Commission to investigate Flock Safety, a company that operates license plate-scanning cameras, for allegedly failing to implement cybersecurity protections that expose its camera network to hackers and spies.\nIn a letter sent by Sen. Ron Wyden (D-OR) and Rep. Raja Krishnamoorthi (D-IL, 8th), the lawmakers urge FTC chairman Andrew Ferguson to probe why Flock does not enforce the use of multi-factor authentication (MFA), a security protection that prevents malicious access by someone with knowledge of the account holder’s password.\nWyden and Krishnamoorthi said that while the company offers its law enforcement customers the ability to enable MFA, “Flock does not require it, which the company confirmed to Congress in October,” according to the letter.\nWyden and Krishnamoorthi said that if hackers or foreign spies learn of a law enforcement user’s password, “they can gain access to law-enforcement-only areas of Flock’s website and search the billions of photos of Americans’ license plates collected by taxpayer-funded cameras across the country.”\nFlock operates one of the largest networks of cameras and license plate readers in the U.S., providing access to more than 5,000 police departments, as well as private businesses, across the country. Flock’s cameras scan the license plates of passing vehicles so that police and federal agencies with logins to Flock’s platform can search the billions of captured photos and track where vehicles have traveled at any given time.\nThe lawmakers said that they had found evidence that some of Flock’s law enforcement customers’ logins had been previously stolen and shared online, citing data from Hudson Rock, a cybersecurity company that identifies usernames and passwords stolen by information-stealing malware.\nIndependent security researcher Benn Jordan also provided the lawmakers with a screenshot showing a Russian cybercrime forum allegedly selling access to Flock logins.\nWhen reached by TechCrunch for comment, Flock shared the company’s response in a letter from its chief legal officer Dan Haley, in which he says the company switched on MFA by default for all new customers starting in November 2024 and that 97% of its law enforcement customers have enabled MFA to date.\nThat leaves around 3% of the company’s customers — potentially dozens of law enforcement agencies — that have declined to switch on MFA, citing “reasons specific to them,” Haley wrote.\nHolly Beilin, a spokesperson for Flock, did not immediately provide a specific number of law enforcement customers that have not yet switched on MFA, nor did she say if any federal agencies are among the remaining customers, or for what reason Flock does not require its customers to switch on the security feature.\nAs previously reported by 404 Media, the U.S. Drug Enforcement Administration used a local police officer’s password to access Flock’s cameras to search for an individual suspected of an “immigration violation,” but without the officer’s knowledge. The Palos Heights Police Department said it switched on multi-factor authentication following the breach.",
      "enhanced_at": 1762260685.0122612,
      "fetch_method": "trafilatura"
    }
  },
  "updated_at": "2025-11-04T12:51:25.012615+00:00Z"
}