{
  "id": "cyberscoop-2025-11-19-9934e28f",
  "source_id": "cyberscoop",
  "guid": "https://cyberscoop.com/?p=86876",
  "title": "Palo Alto Networks to acquire observability firm Chronosphere for $3.35 billion",
  "url": "https://cyberscoop.com/palo-alto-networks-to-acquire-observability-firm-chronosphere-for-3-35-billion/",
  "published_at": "2025-11-19T22:43:22+00:00",
  "fetched_at": "2025-11-20T11:19:36.954999+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Palo Alto Networks announced Wednesday it will acquire Chronosphere, a cloud observability platform, for $3.35 billion in cash and equity, marking the cybersecurity company&#8217;s latest move to expand beyond its traditional security perimeter into adjacent infrastructure monitoring capabilities. The acquisition represents a significant bet on the convergence of security and operational observability as organizations grapple with increasingly complex AI workloads and cloud-native applications. The deal underscores how the demands of artificial intelligence infrastructure are reshaping enterprise software markets and driving consolidation across previously distinct technology categories. “The foundational requirement for every modern AI data center is constant uptime and resilience, which demands real-time, always-on observability delivered at the right cost,” Nikesh Arora, chairman and CEO of Palo Alto Networks, said in a release. “Chronosphere was built to scale for the data demands of the AI era from day one, which is why it is chosen by leading AI-native and born-in-the-cloud organizations. And once we leverage AgentiX with Chronosphere, we will take observability from simple dashboards to real-time, agentic remediation. We are excited to not just enter this space, but to disrupt it.&#8221;&nbsp; Chronosphere, founded to provide monitoring and observability for large-scale digital operations, reported annual recurring revenue exceeding $160 million as of September 2025, with triple-digit year-over-year growth. The company has been recognized as a leader in Gartner&#8217;s 2025 Magic Quadrant for Observability Platforms and counts major AI companies among its customers, including two leading large language model providers. The California-based cybersecurity company has been on a spending spree over the past year. In July, it announced it was buying identity security firm CyberArk for approximately $25 billion in one of the largest technology acquisitions to date.&nbsp; The deal is yet another in a lengthy list of cybersecurity companies acquiring AI-focused companies in 2025. Similar deals this year include:&nbsp; Check Point acquires AI security firm Lakera F5 Networks acquiring CalypsoAI Cato Networks acquires AI security startup Aim Security Varonis buys AI email security firm SlashNext Palo Alto Networks plans to integrate Chronosphere with its AgentiX platform, aiming to transform observability from passive monitoring into what the company describes as autonomous remediation. The combined system would deploy AI agents to detect performance issues, investigate root causes, and implement fixes automatically, rather than simply alerting human operators to problems. &#8220;We founded Chronosphere to provide scalable resiliency for the world&#8217;s largest digital organizations. Palo Alto Networks is the perfect strategic partner for our customers, partners, and employees,” Martin Mao, co-founder and CEO of Chronosphere, said in the release. “It allows us to combine our disruptive observability platform with the world&#8217;s best security company, accelerating our momentum in solving the most complex data and resiliency challenges. Together, we look forward to continuing to partner with industry-leading cloud and AI-native customers across the world on their mission-critical observability and security needs.&#8221;&nbsp; The deal is expected to close in 2026, during the second half of Palo Alto Networks&#8217; fiscal year. The post Palo Alto Networks to acquire observability firm Chronosphere for $3.35 billion appeared first on CyberScoop.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}