{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-19-3fe612f7",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42346",
  "title": "Se disparan un 232% las webs falsas de Amazon antes del Black Friday",
  "url": "https://cybersecuritynews.es/se-disparan-un-232-las-webs-falsas-de-amazon-antes-del-black-friday/",
  "published_at": "2025-11-19T22:00:00+00:00",
  "fetched_at": "2025-11-20T11:19:13.803309+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "El Black Friday de 2025 promete tener los mejores descuentos, con muchas tiendas extendiendo el periodo de ofertas por más tiempo. Aunque es una gran noticia para los compradores que aprovechan la temporada, también lo es para los cibercriminales. El frenesí de las compras y promociones crea nuevas oportunidades para que los estafadores exploten el afán y el desorden que puede traer. Según información de la&nbsp;Protección contra amenazas Pro™&nbsp;de NordVPN, los&nbsp;sitios web falsos de Amazon&nbsp;crecieron en un 232% en octubre, en comparación con septiembre. Si se suman todas las tiendas en línea que fueron analizadas, las páginas fraudulentas aumentaron en un 250%, con eBay teniendo el mayor incremento: sus copias ilegítimas se dispararon en un 525%. “Los eventos de compras como el Black Friday son una mina de oro para los cibercriminales. Los estafadores explotan el desorden que hay alrededor de las ofertas y los descuentos, sabiendo que los compradores apurados son propensos a hacer clic en enlaces peligrosos o a compartir información personal sin pensarlo a profundidad. Incluso, durante la locura de la búsqueda de ofertas, la gente debe mantener una buena higiene digital”, explica Marijus Briedis, Director de Tecnología (CTO) de NordVPN. La mayoría de las personas no saben identificar una página de phishing De acuerdo al&nbsp;Test Nacional de Privacidad&nbsp;de NordVPN, el 68% de los consumidores en el mundo no saben identificar un sitio web de phishing. Estas vulnerabilidades son críticas durante las temporadas de compras, cuando los usuarios visitan varias tiendas en línea, muchas veces entrando a través de correos electrónicos promocionales que llevan a páginas ilegítimas. El incremento en un 36% de los ataques de phishing entre agosto y octubre, según información de la Protección contra amenazas Pro™, hace que la situación sea más grave. Este incremento muestra que los cibercriminales están mejorando sus estrategias al dirigirse a compradores inocentes durante una de las épocas más movidas del año para el comercio. Mientras que los usuarios se preparan para el Black Friday, Cyber Monday y la temporada de compras navideñas, los cibercriminales ven una oportunidad maravillosa para explotar el aumento de las actividades en internet. Suelen crear correos electrónicos sofisticados de phishing que se hacen pasar por notificaciones de entrega u ofertas exclusivas, sabiendo que las personas son susceptibles a hacer clic en mensajes relacionados a compras durante este periodo del año. Consejos para evitar las estafas en línea Asegúrate de comprar directamente en la página oficial de las tiendas, así te proteges de las estafas de la temporada. Verifica que en las URL diga “https://” y tengan el icono del candado antes de dejar cualquier información personal. Sospecha de promociones que suenan demasiado buenas para ser verdad. Los precios que están muy por debajo del mercado también son señales de alerta de piratería o fraude. “Los aspectos básicos de la ciberseguridad pueden olvidarse durante los grandes eventos de compras”, explica Briedis. “Los compradores nunca deben hacer clic en correos electrónicos que no son solicitados, así parezca que vienen de sitios legítimos. En cambio, es mejor entrar directamente a la página web. Leer comentarios de usuarios, así como filtrar para ver los negativos e identificar las quejas recurrentes, es una muy buena práctica”. Recuerda que las comunicaciones de las tiendas legítimas son profesionales y tienen estándares de calidad, no son mensajes genéricos que amenazan con cerrar tu cuenta. Las compañías que tienen una reputación jamás deben solicitar información confidencial, como contraseñas o números de identificación a través de correo electrónico o llamada. Si tienes dudas, ingresa a tu cuenta o contacta a servicio al cliente a través de los canales oficiales para verificar tus sospechas. La entrada Se disparan un 232% las webs falsas de Amazon antes del Black Friday se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}