{
  "id": "cybersecurity-news-cybersecuritynews-es-2025-11-19-4de22280",
  "source_id": "cybersecurity-news-cybersecuritynews-es",
  "guid": "https://cybersecuritynews.es/?p=42344",
  "title": "El 70% de los correos electrónicos en Black Friday son fraudulentos y exponen a la cadena de suministro",
  "url": "https://cybersecuritynews.es/el-70-de-los-correos-electronicos-en-black-friday-son-fraudulentos-y-exponen-a-la-cadena-de-suministro/",
  "published_at": "2025-11-19T22:00:00+00:00",
  "fetched_at": "2025-11-20T11:19:13.802850+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "El Black Friday ya no es solo un reto para el consumidor, se ha convertido en una prueba crítica de ciberresiliencia para las empresas y sus cadenas de suministro. Según los análisis de Trend Micro, empresa mundial en ciberseguridad, durante estas campañas el volumen de ciberestafas aumenta exponencialmente, con un porcentaje de correos electrónicos fraudulentos que supera el 70% del total del tráfico comercial relacionado con las rebajas. El incremento del comercio electrónico impulsa la aparición de miles de webs clonadas, campañas de phishing corporativo y anuncios falsos diseñados no solo para engañar a los clientes, sino también para comprometer a los proveedores y empleados de las propias organizaciones. Trend Micro advierte de que los delincuentes están industrializando el fraude online mediante malware-as-a-service y herramientas de inteligencia artificial generativa que permiten suplantar marcas, identidades y comunicaciones empresariales con un realismo sin precedentes. “Durante las grandes campañas comerciales, los ciberdelincuentes adaptan su infraestructura de fraude en cuestión de horas”, explica José de la Cruz, director técnico de Trend Micro Iberia. “No hablamos solo de correos falsos o enlaces sospechosos. Hoy vemos tiendas completas copiadas píxel a píxel, perfiles en redes sociales que suplantan a marcas reales, e incluso vídeos o voces creadas por IA para hacer más creíble una comunicación falsa.” La interconexión entre tiendas online, plataformas logísticas, pasarelas de pago y sistemas ERP multiplica los puntos de exposición. Durante el Black Friday, el volumen de transacciones y comunicaciones entre empresas se dispara, y con él la probabilidad de ataques de suplantación o compromiso de correo empresarial En su informe Deepfake It ’Til You Make It, Trend Micro documenta un aumento del 600 % en los ataques de fraude corporativo impulsados por deepfakes durante 2025, incluyendo casos en los que delincuentes crearon reuniones por videollamada con directivos falsos para autorizar transferencias o compartir información sensible. Este tipo de amenazas, que antes requerían altos conocimientos técnicos, hoy pueden ejecutarse con herramientas accesibles por menos de 50 euros al mes. El impacto se extiende a toda la cadena de suministro. Al suplantar a proveedores legítimos o crear tiendas espejo, los atacantes pueden infiltrarse en flujos de pago, alterar facturas o desviar fondos. “La duplicidad de dominios no solo engaña a los compradores, sino que erosiona la confianza entre socios empresariales y puede provocar fugas de datos o interrupciones operativas en cuestión de minutos”, añade José de la Cruz. Fraudes cada vez más creíbles y automatizados Las investigaciones de Trend Micro muestran que más del 60% de las estafas del Black Friday de 2024 tuvieron origen en campañas de phishing corporativo, muchas de ellas simulando pedidos, devoluciones o incidencias logísticas. En 2025, la compañía anticipa un crecimiento de estas amenazas impulsadas por IA generativa, capaz de crear correos, audios o vídeos totalmente personalizados para cada víctima. Además, se observa un incremento sostenido en el uso de aplicaciones fraudulentas y servicios de terceros comprometidos que se integran en entornos empresariales a través de APIs o marketplaces no verificados. “Los atacantes han entendido que la empresa es tan segura como el eslabón más débil de su ecosistema digital”, señala Trend Micro. La combinación de urgencia, descuentos masivos y alta actividad transaccional convierte el Black Friday en una ventana de oportunidad ideal para los ciberdelincuentes. “Este periodo es una prueba de estrés de ciberseguridad para las organizaciones”, apunta el directivo. “Millones de transacciones, identidades y credenciales circulan entre sistemas interconectados. Un correo mal verificado o una web clonada pueden comprometer toda la cadena de suministro.” Para mitigar el riesgo, Trend Micro recomienda reforzar los controles de verificación de dominios y comunicaciones, implementar políticas de “confianza cero” en entornos de pago y colaboración, y formar a los equipos sobre los riesgos de suplantación mediante deepfakes o phishing avanzado. “Las campañas de descuentos han pasado de ser una oportunidad comercial a un campo de pruebas para el cibercrimen. Las organizaciones que entienden esto no solo se protegen a sí mismas, sino también a su cadena de suministro y a sus clientes”, concluye José de la Cruz. La entrada El 70% de los correos electrónicos en Black Friday son fraudulentos y exponen a la cadena de suministro se publicó primero en CyberSecurity News.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}