{
  "id": "krebs-on-security-2025-11-19-bd148c83",
  "source_id": "krebs-on-security",
  "guid": "https://krebsonsecurity.com/?p=72665",
  "title": "The Cloudflare Outage May Be a Security Roadmap",
  "url": "https://krebsonsecurity.com/2025/11/the-cloudflare-outage-may-be-a-security-roadmap/",
  "published_at": "2025-11-19T14:07:03+00:00",
  "fetched_at": "2025-11-20T11:20:36.724837+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "An intermittent outage at Cloudflare on Tuesday briefly knocked many of the Internet&#8217;s top destinations offline. Some affected Cloudflare customers were able to pivot away from the platform temporarily so that visitors could still access their websites. But security experts say doing so may have also triggered an impromptu network penetration test for organizations that have come to rely on Cloudflare to block many types of abusive and malicious traffic. At around 6:30 EST/11:30 UTC on Nov. 18, Cloudflare&#8217;s status page acknowledged the company was experiencing &#8220;an internal service degradation.&#8221; After several hours of Cloudflare services coming back up and failing again, many websites behind Cloudflare found they could not migrate away from using the company&#8217;s services because the Cloudflare portal was unreachable and/or because they also were getting their domain name system (DNS) services from Cloudflare. However, some customers did manage to pivot their domains away from Cloudflare during the outage. And many of those organizations probably need to take a closer look at their web application firewall (WAF) logs during that time, said Aaron Turner, a faculty member at IANS Research. Turner said Cloudflare&#8217;s WAF does a good job filtering out malicious traffic that matches any one of the top ten types of application-layer attacks, including credential stuffing, cross-site scripting, SQL injection, bot attacks and API abuse. But he said this outage might be a good opportunity for Cloudflare customers to better understand how their own app and website defenses may be failing without Cloudflare&#8217;s help. &#8220;Your developers could have been lazy in the past for SQL injection because Cloudflare stopped that stuff at the edge,&#8221; Turner said. &#8220;Maybe you didn&#8217;t have the best security QA [quality assurance] for certain things because Cloudflare was the control layer to compensate for that.&#8221; Turner said one company he&#8217;s working with saw a huge increase in log volume and they are still trying to figure out what was &#8220;legit malicious&#8221; versus just noise. &#8220;It looks like there was about an eight hour window when several high-profile sites decided to bypass Cloudflare for the sake of availability,&#8221; Turner said. &#8220;Many companies have essentially relied on Cloudflare for the OWASP Top Ten [web application vulnerabilities] and a whole range of bot blocking. How much badness could have happened in that window? Any organization that made that decision needs to look closely at any exposed infrastructure to see if they have someone persisting after they&#8217;ve switched back to Cloudflare protections.&#8221; Turner said some cybercrime groups likely noticed when an online merchant they normally stalk stopped using Cloudflare&#8217;s services during the outage. &#8220;Let&#8217;s say you were an attacker, trying to grind your way into a target, but you felt that Cloudflare was in the way in the past,&#8221; he said. &#8220;Then you see through DNS changes that the target has eliminated Cloudflare from their web stack due to the outage. You&#8217;re now going to launch a whole bunch of new attacks because the protective layer is no longer in place.&#8221; Nicole Scott, senior product marketing manager at the McLean, Va. based Replica Cyber, called yesterday&#8217;s outage &#8220;a free tabletop exercise, whether you meant to run one or not.&#8221; &#8220;That few-hour window was a live stress test of how your organization routes around its own control plane and shadow IT blossoms under the sunlamp of time pressure,&#8221; Scott said in a post on LinkedIn. &#8220;Yes, look at the traffic that hit you while protections were weakened. But also look hard at the behavior inside your org.&#8221; Scott said organizations seeking security insights from the Cloudflare outage should ask themselves: 1. What was turned off or bypassed (WAF, bot protections, geo blocks), and for how long? 2. What emergency DNS or routing changes were made, and who approved them? 3. Did people shift work to personal devices, home Wi-Fi, or unsanctioned Software-as-a-Service providers to get around the outage? 4. Did anyone stand up new services, tunnels, or vendor accounts “just for now”? 5. Is there a plan to unwind those changes, or are they now permanent workarounds? 6. For the next incident, what’s the intentional fallback plan, instead of decentralized improvisation? In a postmortem published Tuesday evening, Cloudflare said the disruption was not caused, directly or indirectly, by a cyberattack or malicious activity of any kind. &#8220;Instead, it was triggered by a change to one of our database systems&#8217; permissions which caused the database to output multiple entries into a &#8216;feature file&#8217; used by our Bot Management system,&#8221; Cloudflare CEO Matthew Prince wrote. &#8220;That feature file, in turn, doubled in size. The larger-than-expected feature file was then propagated to all the machines that make up our network.&#8221; Cloudflare estimates that roughly 20 percent of websites use its services, and with much of the modern web relying heavily on a handful of other cloud providers including AWS and Azure, even a brief outage at one of these platforms can create a single point of failure for many organizations. Martin Greenfield, CEO at the IT consultancy Quod Orbis, said Tuesday&#8217;s outage was another reminder that many organizations may be putting too many of their eggs in one basket. &#8220;There are several practical and overdue fixes,&#8221; Greenfield advised. &#8220;Split your estate. Spread WAF and DDoS protection across multiple zones. Use multi-vendor DNS. Segment applications so a single provider outage doesn’t cascade. And continuously monitor controls to detect single-vendor dependency.&#8221;",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}