{
  "id": "schneier-on-security-schneier-com-2025-11-19-b83f0a9a",
  "source_id": "schneier-on-security-schneier-com",
  "guid": "https://www.schneier.com/?p=71198",
  "title": "Legal Restrictions on Vulnerability Disclosure",
  "url": "https://www.schneier.com/blog/archives/2025/11/legal-restrictions-on-vulnerability-disclosure.html",
  "published_at": "2025-11-19T12:04:50+00:00",
  "fetched_at": "2025-11-20T11:20:08.877718+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "Kendra Albert gave an excellent talk at USENIX Security this year, pointing out that the legal agreements surrounding vulnerability disclosure muzzle researchers while allowing companies to not fix the vulnerabilities&#8212;exactly the opposite of what the responsible disclosure movement of the early 2000s was supposed to prevent. This is the talk. Thirty years ago, a debate raged over whether vulnerability disclosure was good for computer security. On one side, full disclosure advocates argued that software bugs weren&#8217;t getting fixed and wouldn&#8217;t get fixed if companies that made insecure software wasn&#8217;t called out publicly. On the other side, companies argued that full disclosure led to exploitation of unpatched vulnerabilities, especially if they were hard to fix. After blog posts, public debates, and countless mailing list flame wars, there emerged a compromise solution: coordinated vulnerability disclosure, where vulnerabilities were disclosed after a period of confidentiality where vendors can attempt to fix things. Although full disclosure fell out of fashion, disclosure won and security through obscurity lost. We&#8217;ve lived happily ever after since. Or have we? The move towards paid bug bounties and the rise of platforms that manage bug bounty programs for security teams has changed the reality of disclosure significantly. In certain cases, these programs require agreement to contractual restrictions. Under the status quo, that means that software companies sometimes funnel vulnerabilities into bug bounty management platforms and then condition submission on confidentiality agreements that can prohibit researchers from ever sharing their findings. In this talk, I&#8217;ll explain how confidentiality requirements for managed bug bounty programs restrict the ability of those who attempt to report vulnerabilities to share their findings publicly, compromising the bargain at the center of the CVD process. I&#8217;ll discuss what contract law can tell us about how and when these restrictions are enforceable, and more importantly, when they aren&#8217;t, providing advice to hackers around how to understand their legal rights when submitting. Finally, I&#8217;ll call upon platforms and companies to adapt their practices to be more in line with the original bargain of coordinated vulnerability disclosure, including by banning agreements that require non-disclosure. And this is me from 2007, talking about &#8220;responsible disclosure&#8221;: This was a good idea&#8212;and these days it&#8217;s normal procedure&#8212;but one that was possible only because full disclosure was the norm. And it remains a good idea only as long as full disclosure is the threat.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}