{
  "id": "securelist-securelist-com-2025-11-19-677b70e4",
  "source_id": "securelist-securelist-com",
  "guid": "https://kasperskycontenthub.com/securelist/?p=118020",
  "title": "IT threat evolution in Q3 2025. Non-mobile statistics",
  "url": "https://securelist.com/malware-report-q3-2025-pc-iot-statistics/118020/",
  "published_at": "2025-11-19T10:00:02+00:00",
  "fetched_at": "2025-11-19T11:20:03.858701+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "IT threat evolution in Q3 2025. Mobile statistics IT threat evolution in Q3 2025. Non-mobile statistics Quarterly figures In Q3 2025: Kaspersky solutions blocked more than 389 million attacks that originated with various online resources. Web Anti-Virus responded to 52 million unique links. File Anti-Virus blocked more than 21 million malicious and potentially unwanted objects. 2,200 new ransomware variants were detected. Nearly 85,000 users experienced ransomware attacks. 15% of all ransomware victims whose data was published on threat actors&#8217; data leak sites (DLSs) were victims of Qilin. More than 254,000 users were targeted by miners. Ransomware Quarterly trends and highlights Law enforcement success The UK&#8217;s National Crime Agency (NCA) arrested the first suspect in connection with a ransomware attack that caused disruptions at numerous European airports in September 2025. Details of the arrest have not been published as the investigation remains ongoing. According to security researcher Kevin Beaumont, the attack employed the HardBit ransomware, which he described as primitive and lacking its own data leak site. The U.S. Department of Justice filed charges against the administrator of the LockerGoga, MegaCortex and Nefilim ransomware gangs. His attacks caused millions of dollars in damage, putting him on wanted lists for both the FBI and the European Union. U.S. authorities seized over $2.8 million in cryptocurrency, $70,000 in cash, and a luxury vehicle from a suspect allegedly involved in distributing the Zeppelin ransomware. The criminal scheme involved data theft, file encryption, and extortion, with numerous organizations worldwide falling victim. A coordinated international operation conducted by the FBI, Homeland Security Investigations (HSI), the U.S. Internal Revenue Service (IRS), and law enforcement agencies from several other countries successfully dismantled the infrastructure of the BlackSuit ransomware. The operation resulted in the seizure of four servers, nine domains, and $1.09 million in cryptocurrency. The objective of the operation was to destabilize the malware ecosystem and protect critical U.S. infrastructure. Vulnerabilities and attacks SSL VPN attacks on SonicWall Since late July, researchers have recorded a rise in attacks by the Akira threat actor targeting SonicWall firewalls supporting SSL VPN. SonicWall has linked these incidents to the already-patched vulnerability CVE-2024-40766, which allows unauthorized users to gain access to system resources. Attackers exploited the vulnerability to steal credentials, subsequently using them to access devices, even those that had been patched. Furthermore, the attackers were able to bypass multi-factor authentication enabled on the devices. SonicWall urges customers to reset all passwords and update their SonicOS firmware. Scattered Spider uses social engineering to breach VMware ESXi The Scattered Spider (UNC3944) group is attacking VMware virtual environments. The attackers contact IT support posing as company employees and request to reset their Active Directory password. Once access to vCenter is obtained, the threat actors enable SSH on the ESXi servers, extract the NTDS.dit database, and, in the final phase of the attack, deploy ransomware to encrypt all virtual machines. Exploitation of a Microsoft SharePoint vulnerability In late July, researchers uncovered attacks on SharePoint servers that exploited the ToolShell vulnerability chain. In the course of investigating this campaign, which affected over 140 organizations globally, researchers discovered the 4L4MD4R ransomware based on Mauri870 code. The malware is written in Go and packed using the UPX compressor. It demands a ransom of 0.005 BTC. The application of AI in ransomware development A UK-based threat actor used Claude to create and launch a ransomware-as-a-service (RaaS) platform. The AI was responsible for writing the code, which included advanced features such as anti-EDR techniques, encryption using ChaCha20 and RSA algorithms, shadow copy deletion, and network file encryption. Anthropic noted that the attacker was almost entirely dependent on Claude, as they lacked the necessary technical knowledge to provide technical support to their own clients. The threat actor sold the completed malware kits on the dark web for $400–$1,200. Researchers also discovered a new ransomware strain, dubbed PromptLock, that utilizes an LLM directly during attacks. The malware is written in Go. It uses hardcoded prompts to dynamically generate Lua scripts for data theft and encryption across Windows, macOS and Linux systems. For encryption, it employs the SPECK-128 algorithm, which is rarely used by ransomware groups. Subsequently, scientists from the NYU Tandon School of Engineering traced back the likely origins of PromptLock to their own educational project, Ransomware 3.0, which they detailed in a prior publication. The most prolific groups This section highlights the most prolific ransomware gangs by number of victims added to each group&#8217;s DLS. As in the previous quarter, Qilin leads by this metric. Its share grew by 1.89 percentage points (p.p.) to reach 14.96%. The Clop ransomware showed reduced activity, while the share of Akira (10.02%) slightly increased. The INC Ransom group, active since 2023, rose to third place with 8.15%. Number of each group&#8217;s victims according to its DLS as a percentage of all groups&#8217; victims published on all the DLSs under review during the reporting period (download) Number of new variants In the third quarter, Kaspersky solutions detected four new families and 2,259 new ransomware modifications, nearly one-third more than in Q2 2025 and slightly more than in Q3 2024. Number of new ransomware modifications, Q3 2024 — Q3 2025 (download) Number of users attacked by ransomware Trojans During the reporting period, our solutions protected 84,903 unique users from ransomware. Ransomware activity was highest in July, while August proved to be the quietest month. Number of unique users attacked by ransomware Trojans, Q3 2025 (download) Attack geography TOP 10 countries attacked by ransomware Trojans In the third quarter, Israel had the highest share (1.42%) of attacked users. Most of the ransomware in that country was detected in August via behavioral analysis. Country/territory* %** 1 Israel 1.42 2 Libya 0.64 3 Rwanda 0.59 4 South Korea 0.58 5 China 0.51 6 Pakistan 0.47 7 Bangladesh 0.45 8 Iraq 0.44 9 Tajikistan 0.39 10 Ethiopia 0.36 * Excluded are countries and territories with relatively few (under 50,000) Kaspersky users. ** Unique users whose computers were attacked by ransomware Trojans as a percentage of all unique users of Kaspersky products in the country/territory. TOP 10 most common families of ransomware Trojans Name Verdict %* 1 (generic verdict) Trojan-Ransom.Win32.Gen 26.82 2 (generic verdict) Trojan-Ransom.Win32.Crypren 8.79 3 (generic verdict) Trojan-Ransom.Win32.Encoder 8.08 4 WannaCry Trojan-Ransom.Win32.Wanna 7.08 5 (generic verdict) Trojan-Ransom.Win32.Agent 4.40 6 LockBit Trojan-Ransom.Win32.Lockbit 3.06 7 (generic verdict) Trojan-Ransom.Win32.Crypmod 2.84 8 (generic verdict) Trojan-Ransom.Win32.Phny 2.58 9 PolyRansom/VirLock Trojan-Ransom.Win32.PolyRansom / Virus.Win32.PolyRansom 2.54 10 (generic verdict) Trojan-Ransom.MSIL.Agent 2.05 * Unique Kaspersky users attacked by the specific ransomware Trojan family as a percentage of all unique users attacked by this type of threat. Miners Number of new variants In Q3 2025, Kaspersky solutions detected 2,863 new modifications of miners. Number of new miner modifications, Q3 2025 (download) Number of users attacked by miners During the third quarter, we detected attacks using miner programs on the computers of 254,414 unique Kaspersky users worldwide. Number of unique users attacked by miners, Q3 2025 (download) Attack geography TOP 10 countries and territories attacked by miners Country/territory* %** 1 Senegal 3.52 2 Mali 1.50 3 Afghanistan 1.17 4 Algeria 0.95 5 Kazakhstan 0.93 6 Tanzania 0.92 7 Dominican Republic 0.86 8 Ethiopia 0.77 9 Portugal 0.75 10 Belarus 0.75 * Excluded are countries and territories with relatively few (under 50,000) Kaspersky users. ** Unique users whose computers were attacked by miners as a percentage of all unique users of Kaspersky products in the country/territory. Attacks on macOS In April, researchers at Iru (formerly Kandji) reported the discovery of a new spyware family, PasivRobber. We observed the development of this family throughout the third quarter. Its new modifications introduced additional executable modules that were absent in previous versions. Furthermore, the attackers began employing obfuscation techniques in an attempt to hinder sample detection. In July, we reported on a cryptostealer distributed through fake extensions for the Cursor AI development environment, which is based on Visual Studio Code. At that time, the malicious JavaScript (JS) script downloaded a payload in the form of the ScreenConnect remote access utility. This utility was then used to download cryptocurrency-stealing VBS scripts onto the victim&#8217;s device. Later, researcher Michael Bocanegra reported on new fake VS Code extensions that also executed malicious JS code. This time, the code downloaded a malicious macOS payload: a Rust-based loader. This loader then delivered a backdoor to the victim&#8217;s device, presumably also aimed at cryptocurrency theft. The backdoor supported the loading of additional modules to collect data about the victim&#8217;s machine. The Rust downloader was analyzed in detail by researchers at Iru. In September, researchers at Jamf reported the discovery of a previously unknown version of the modular backdoor ChillyHell, first described in 2023. Notably, the Trojan&#8217;s executable files were signed with a valid developer certificate at the time of discovery. The new sample had been available on Dropbox since 2021. In addition to its backdoor functionality, it also contains a module responsible for bruteforcing passwords of existing system users. By the end of the third quarter, researchers at Microsoft reported new versions of the XCSSET spyware, which targets developers and spreads through infected Xcode projects. These new versions incorporated additional modules for data theft and system persistence. TOP 20 threats to macOS Unique users* who encountered this malware as a percentage of all attacked users of Kaspersky security solutions for macOS (download) * Data for the previous quarter may differ slightly from previously published data due to some verdicts being retrospectively revised. The PasivRobber spyware continues to increase its activity, with its modifications occupying the top spots in the list of the most widespread macOS malware varieties. Other highly active threats include Amos Trojans, which steal passwords and cryptocurrency wallet data, and various adware. The Backdoor.OSX.Agent.l family, which took thirteenth place, represents a variation on the well-known open-source malware, Mettle. Geography of threats to macOS TOP 10 countries and territories by share of attacked users Country/territory %* Q2 2025 %* Q3 2025 Mainland China 2.50 1.70 Italy 0.74 0.85 France 1.08 0.83 Spain 0.86 0.81 Brazil 0.70 0.68 The Netherlands 0.41 0.68 Mexico 0.76 0.65 Hong Kong 0.84 0.62 United Kingdom 0.71 0.58 India 0.76 0.56 IoT threat statistics This section presents statistics on attacks targeting Kaspersky IoT honeypots. The geographic data on attack sources is based on the IP addresses of attacking devices. In Q3 2025, there was a slight increase in the share of devices attacking Kaspersky honeypots via the SSH protocol. Distribution of attacked services by number of unique IP addresses of attacking devices (download) Conversely, the share of attacks using the SSH protocol slightly decreased. Distribution of attackers&#8217; sessions in Kaspersky honeypots (download) TOP 10 threats delivered to IoT devices Share of each threat delivered to an infected device as a result of a successful attack, out of the total number of threats delivered (download) In the third quarter, the shares of the NyaDrop and Mirai.b botnets significantly decreased in the overall volume of IoT threats. Conversely, the activity of several other members of the Mirai family, as well as the Gafgyt botnet, increased. As is typical, various Mirai variants occupy the majority of the list of the most widespread malware strains. Attacks on IoT honeypots Germany and the United States continue to lead in the distribution of attacks via the SSH protocol. The share of attacks originating from Panama and Iran also saw a slight increase. Country/territory Q2 2025 Q3 2025 Germany 24.58% 13.72% United States 10.81% 13.57% Panama 1.05% 7.81% Iran 1.50% 7.04% Seychelles 6.54% 6.69% South Africa 2.28% 5.50% The Netherlands 3.53% 3.94% Vietnam 3.00% 3.52% India 2.89% 3.47% Russian Federation 8.45% 3.29% The largest number of attacks via the Telnet protocol were carried out from China, as is typically the case. Devices located in India reduced their activity, whereas the share of attacks from Indonesia increased. Country/territory Q2 2025 Q3 2025 China 47.02% 57.10% Indonesia 5.54% 9.48% India 28.08% 8.66% Russian Federation 4.85% 7.44% Pakistan 3.58% 6.66% Nigeria 1.66% 3.25% Vietnam 0.55% 1.32% Seychelles 0.58% 0.93% Ukraine 0.51% 0.73% Sweden 0.39% 0.72% Attacks via web resources The statistics in this section are based on detection verdicts by Web Anti-Virus, which protects users when suspicious objects are downloaded from malicious or infected web pages. These malicious pages are purposefully created by cybercriminals. Websites that host user-generated content, such as message boards, as well as compromised legitimate sites, can become infected. TOP 10 countries that served as sources of web-based attacks This section gives the geographical distribution of sources of online attacks (such as web pages redirecting to exploits, sites hosting exploits and other malware, and botnet C2 centers) blocked by Kaspersky products. One or more web-based attacks could originate from each unique host. To determine the geographic source of web attacks, we matched the domain name with the real IP address where the domain is hosted, then identified the geographic location of that IP address (GeoIP). In the third quarter of 2025, Kaspersky solutions blocked 389,755,481 attacks from internet resources worldwide. Web Anti-Virus was triggered by 51,886,619 unique URLs. Web-based attacks by country, Q3 2025 (download) Countries and territories where users faced the greatest risk of online infection To assess the risk of malware infection via the internet for users&#8217; computers in different countries and territories, we calculated the share of Kaspersky users in each location on whose computers Web Anti-Virus was triggered during the reporting period. The resulting data provides an indication of the aggressiveness of the environment in which computers operate in different countries and territories. This ranked list includes only attacks by malicious objects classified as Malware. Our calculations leave out Web Anti-Virus detections of potentially dangerous or unwanted programs, such as RiskTool or adware. Country/territory* %** 1 Panama 11.24 2 Bangladesh 8.40 3 Tajikistan 7.96 4 Venezuela 7.83 5 Serbia 7.74 6 Sri Lanka 7.57 7 North Macedonia 7.39 8 Nepal 7.23 9 Albania 7.04 10 Qatar 6.91 11 Malawi 6.90 12 Algeria 6.74 13 Egypt 6.73 14 Bosnia and Herzegovina 6.59 15 Tunisia 6.54 16 Belgium 6.51 17 Kuwait 6.49 18 Turkey 6.41 19 Belarus 6.40 20 Bulgaria 6.36 * Excluded are countries and territories with relatively few (under 10,000) Kaspersky users. ** Unique users targeted by web-based Malware attacks as a percentage of all unique users of Kaspersky products in the country/territory. On average, over the course of the quarter, 4.88% of devices globally were subjected to at least one web-based Malware attack. Local threats Statistics on local infections of user computers are an important indicator. They include objects that penetrated the target computer by infecting files or removable media, or initially made their way onto the computer in non-open form. Examples of the latter are programs in complex installers and encrypted files. Data in this section is based on analyzing statistics produced by anti-virus scans of files on the hard drive at the moment they were created or accessed, and the results of scanning removable storage media: flash drives, camera memory cards, phones, and external drives. The statistics are based on detection verdicts from the on-access scan (OAS) and on-demand scan (ODS) modules of File Anti-Virus. In the third quarter of 2025, our File Anti-Virus recorded 21,356,075 malicious and potentially unwanted objects. Countries and territories where users faced the highest risk of local infection For each country and territory, we calculated the percentage of Kaspersky users on whose computers File Anti-Virus was triggered during the reporting period. This statistic reflects the level of personal computer infection in different countries and territories around the world. Note that this ranked list includes only attacks by malicious objects classified as Malware. Our calculations leave out File Anti-Virus detections of potentially dangerous or unwanted programs, such as RiskTool or adware. Country/territory* %** 1 Turkmenistan 45.69 2 Yemen 33.19 3 Afghanistan 32.56 4 Tajikistan 31.06 5 Cuba 30.13 6 Uzbekistan 29.08 7 Syria 25.61 8 Bangladesh 24.69 9 China 22.77 10 Vietnam 22.63 11 Cameroon 22.53 12 Belarus 21.98 13 Tanzania 21.80 14 Niger 21.70 15 Mali 21.29 16 Iraq 20.77 17 Nicaragua 20.75 18 Algeria 20.51 19 Congo 20.50 20 Venezuela 20.48 * Excluded are countries and territories with relatively few (under 10,000) Kaspersky users. ** Unique users on whose computers local Malware threats were blocked, as a percentage of all unique users of Kaspersky products in the country/territory. On average worldwide, local Malware threats were detected at least once on 12.36% of computers during the third quarter.",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}