{
  "id": "security-affairs-securityaffairs-co-2025-11-19-2ca400db",
  "source_id": "security-affairs-securityaffairs-co",
  "guid": "https://securityaffairs.com/?p=184850",
  "title": "7-Zip RCE flaw (CVE-2025-11001) actively exploited in attacks in the wild",
  "url": "https://securityaffairs.com/184850/security/7-zip-rce-flaw-cve-2025-11001-actively-exploited-in-attacks-in-the-wild.html",
  "published_at": "2025-11-19T19:23:13+00:00",
  "fetched_at": "2025-11-20T11:20:54.367632+00:00Z",
  "status": "fetched",
  "content": {
    "raw": "A remote code execution vulnerability, tracked as CVE-2025-11001, in the 7-Zip software is under active exploitation. A new 7-Zip flaw tracked as CVE-2025-11001 (CVSS score of 7.0) is now being actively exploited in the wild, NHS England warns. Remote attackers can trigger the vulnerability to execute arbitrary code on affected installations of 7-Zip. &#8220;Active exploitation of CVE-2025-11001 has been observed in the wild.&#8221; reads the alert published by NHS. &#8220;A security researcher has also publicly released a proof-of-concept (PoC) exploit for CVE-2025-11001. The PoC allows attackers to abuse symbolic-link handling to write files outside of the intended extraction folder, which in some scenarios, can enable arbitrary code execution.&#8221; Malicious ZIP symlinks let attackers escape target folders and run code with the service account’s permissions. &#8220;This vulnerability allows remote attackers to execute arbitrary code on affected installations of 7-Zip. Interaction with this product is required to exploit this vulnerability but attack vectors may vary depending on the implementation.&#8221; reads the advisory. &#8220;The specific flaw exists within the handling of symbolic links in ZIP files. Crafted data in a ZIP file can cause the process to traverse to unintended directories. An attacker can leverage this vulnerability to execute code in the context of a service account.&#8221; The researchers Ryota Shiga (GMO Flatt Security Inc.) with takumi-san.ai reported the vulnerability. Version 25.00, released in July 2025, addressed the vulnerability. &#8220;This vulnerability can only be exploited from the context of an elevated user / service account or a machine with developer mode enabled.&#8221; wrote security researcher Dominik (aka pacbypass), who released a PoC. &#8220;This vulnerability can only be exploited on Windows&#8221; 7-Zip users are recommended to quickly upgrade their version due to the availability of proof-of-concept (PoC) exploits. Follow me on Twitter:&nbsp;@securityaffairs&nbsp;and&nbsp;Facebook&nbsp;and&nbsp;Mastodon Pierluigi&nbsp;Paganini (SecurityAffairs – hacking, CVE-2025-11001)",
    "full": "",
    "processed": ""
  },
  "analysis": {
    "score": null,
    "relevance_score": null,
    "threat_category": null,
    "summary": null,
    "key_entities": [],
    "ttps": []
  },
  "content_source": "rss",
  "content_fetch_method": null,
  "processing_metadata": {}
}